Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/test_app/firmware/src/packs/ATSAMA5D29_DFP/component/lcdc.h
/*
 * Component description for LCDC
 *
 * Copyright (c) 2022 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2022-10-04T10:37:14Z */
#ifndef _SAMA5D_LCDC_COMPONENT_H_
#define _SAMA5D_LCDC_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR LCDC                                         */
/* ************************************************************************** */

/* -------- LCDC_LCDCFG0 : (LCDC Offset: 0x00) (R/W 32) LCD Controller Configuration Register 0 -------- */
#define LCDC_LCDCFG0_CLKPOL_Pos               _UINT32_(0)                                          /* (LCDC_LCDCFG0) LCD Controller Clock Polarity Position */
#define LCDC_LCDCFG0_CLKPOL_Msk               (_UINT32_(0x1) << LCDC_LCDCFG0_CLKPOL_Pos)           /* (LCDC_LCDCFG0) LCD Controller Clock Polarity Mask */
#define LCDC_LCDCFG0_CLKPOL(value)            (LCDC_LCDCFG0_CLKPOL_Msk & (_UINT32_(value) << LCDC_LCDCFG0_CLKPOL_Pos)) /* Assigment of value for CLKPOL in the LCDC_LCDCFG0 register */
#define LCDC_LCDCFG0_CLKSEL_Pos               _UINT32_(2)                                          /* (LCDC_LCDCFG0) LCD Controller Clock Source Selection Position */
#define LCDC_LCDCFG0_CLKSEL_Msk               (_UINT32_(0x1) << LCDC_LCDCFG0_CLKSEL_Pos)           /* (LCDC_LCDCFG0) LCD Controller Clock Source Selection Mask */
#define LCDC_LCDCFG0_CLKSEL(value)            (LCDC_LCDCFG0_CLKSEL_Msk & (_UINT32_(value) << LCDC_LCDCFG0_CLKSEL_Pos)) /* Assigment of value for CLKSEL in the LCDC_LCDCFG0 register */
#define LCDC_LCDCFG0_CLKPWMSEL_Pos            _UINT32_(3)                                          /* (LCDC_LCDCFG0) LCD Controller PWM Clock Source Selection Position */
#define LCDC_LCDCFG0_CLKPWMSEL_Msk            (_UINT32_(0x1) << LCDC_LCDCFG0_CLKPWMSEL_Pos)        /* (LCDC_LCDCFG0) LCD Controller PWM Clock Source Selection Mask */
#define LCDC_LCDCFG0_CLKPWMSEL(value)         (LCDC_LCDCFG0_CLKPWMSEL_Msk & (_UINT32_(value) << LCDC_LCDCFG0_CLKPWMSEL_Pos)) /* Assigment of value for CLKPWMSEL in the LCDC_LCDCFG0 register */
#define LCDC_LCDCFG0_CGDISBASE_Pos            _UINT32_(8)                                          /* (LCDC_LCDCFG0) Clock Gating Disable Control for the Base Layer Position */
#define LCDC_LCDCFG0_CGDISBASE_Msk            (_UINT32_(0x1) << LCDC_LCDCFG0_CGDISBASE_Pos)        /* (LCDC_LCDCFG0) Clock Gating Disable Control for the Base Layer Mask */
#define LCDC_LCDCFG0_CGDISBASE(value)         (LCDC_LCDCFG0_CGDISBASE_Msk & (_UINT32_(value) << LCDC_LCDCFG0_CGDISBASE_Pos)) /* Assigment of value for CGDISBASE in the LCDC_LCDCFG0 register */
#define LCDC_LCDCFG0_CGDISOVR1_Pos            _UINT32_(9)                                          /* (LCDC_LCDCFG0) Clock Gating Disable Control for the Overlay 1 Layer Position */
#define LCDC_LCDCFG0_CGDISOVR1_Msk            (_UINT32_(0x1) << LCDC_LCDCFG0_CGDISOVR1_Pos)        /* (LCDC_LCDCFG0) Clock Gating Disable Control for the Overlay 1 Layer Mask */
#define LCDC_LCDCFG0_CGDISOVR1(value)         (LCDC_LCDCFG0_CGDISOVR1_Msk & (_UINT32_(value) << LCDC_LCDCFG0_CGDISOVR1_Pos)) /* Assigment of value for CGDISOVR1 in the LCDC_LCDCFG0 register */
#define LCDC_LCDCFG0_CGDISOVR2_Pos            _UINT32_(10)                                         /* (LCDC_LCDCFG0) Clock Gating Disable Control for the Overlay 2 Layer Position */
#define LCDC_LCDCFG0_CGDISOVR2_Msk            (_UINT32_(0x1) << LCDC_LCDCFG0_CGDISOVR2_Pos)        /* (LCDC_LCDCFG0) Clock Gating Disable Control for the Overlay 2 Layer Mask */
#define LCDC_LCDCFG0_CGDISOVR2(value)         (LCDC_LCDCFG0_CGDISOVR2_Msk & (_UINT32_(value) << LCDC_LCDCFG0_CGDISOVR2_Pos)) /* Assigment of value for CGDISOVR2 in the LCDC_LCDCFG0 register */
#define LCDC_LCDCFG0_CGDISHEO_Pos             _UINT32_(11)                                         /* (LCDC_LCDCFG0) Clock Gating Disable Control for the High-End Overlay Position */
#define LCDC_LCDCFG0_CGDISHEO_Msk             (_UINT32_(0x1) << LCDC_LCDCFG0_CGDISHEO_Pos)         /* (LCDC_LCDCFG0) Clock Gating Disable Control for the High-End Overlay Mask */
#define LCDC_LCDCFG0_CGDISHEO(value)          (LCDC_LCDCFG0_CGDISHEO_Msk & (_UINT32_(value) << LCDC_LCDCFG0_CGDISHEO_Pos)) /* Assigment of value for CGDISHEO in the LCDC_LCDCFG0 register */
#define LCDC_LCDCFG0_CGDISPP_Pos              _UINT32_(13)                                         /* (LCDC_LCDCFG0) Clock Gating Disable Control for the Post Processing Layer Position */
#define LCDC_LCDCFG0_CGDISPP_Msk              (_UINT32_(0x1) << LCDC_LCDCFG0_CGDISPP_Pos)          /* (LCDC_LCDCFG0) Clock Gating Disable Control for the Post Processing Layer Mask */
#define LCDC_LCDCFG0_CGDISPP(value)           (LCDC_LCDCFG0_CGDISPP_Msk & (_UINT32_(value) << LCDC_LCDCFG0_CGDISPP_Pos)) /* Assigment of value for CGDISPP in the LCDC_LCDCFG0 register */
#define LCDC_LCDCFG0_CLKDIV_Pos               _UINT32_(16)                                         /* (LCDC_LCDCFG0) LCD Controller Clock Divider Position */
#define LCDC_LCDCFG0_CLKDIV_Msk               (_UINT32_(0xFF) << LCDC_LCDCFG0_CLKDIV_Pos)          /* (LCDC_LCDCFG0) LCD Controller Clock Divider Mask */
#define LCDC_LCDCFG0_CLKDIV(value)            (LCDC_LCDCFG0_CLKDIV_Msk & (_UINT32_(value) << LCDC_LCDCFG0_CLKDIV_Pos)) /* Assigment of value for CLKDIV in the LCDC_LCDCFG0 register */
#define LCDC_LCDCFG0_Msk                      _UINT32_(0x00FF2F0D)                                 /* (LCDC_LCDCFG0) Register Mask  */

#define LCDC_LCDCFG0_CGDISOVR_Pos             _UINT32_(9)                                          /* (LCDC_LCDCFG0 Position) Clock Gating Disable Control for the Overlay x Layer */
#define LCDC_LCDCFG0_CGDISOVR_Msk             (_UINT32_(0x3) << LCDC_LCDCFG0_CGDISOVR_Pos)         /* (LCDC_LCDCFG0 Mask) CGDISOVR */
#define LCDC_LCDCFG0_CGDISOVR(value)          (LCDC_LCDCFG0_CGDISOVR_Msk & (_UINT32_(value) << LCDC_LCDCFG0_CGDISOVR_Pos)) 

/* -------- LCDC_LCDCFG1 : (LCDC Offset: 0x04) (R/W 32) LCD Controller Configuration Register 1 -------- */
#define LCDC_LCDCFG1_HSPW_Pos                 _UINT32_(0)                                          /* (LCDC_LCDCFG1) Horizontal Synchronization Pulse Width Position */
#define LCDC_LCDCFG1_HSPW_Msk                 (_UINT32_(0x3FF) << LCDC_LCDCFG1_HSPW_Pos)           /* (LCDC_LCDCFG1) Horizontal Synchronization Pulse Width Mask */
#define LCDC_LCDCFG1_HSPW(value)              (LCDC_LCDCFG1_HSPW_Msk & (_UINT32_(value) << LCDC_LCDCFG1_HSPW_Pos)) /* Assigment of value for HSPW in the LCDC_LCDCFG1 register */
#define LCDC_LCDCFG1_VSPW_Pos                 _UINT32_(16)                                         /* (LCDC_LCDCFG1) Vertical Synchronization Pulse Width Position */
#define LCDC_LCDCFG1_VSPW_Msk                 (_UINT32_(0x3FF) << LCDC_LCDCFG1_VSPW_Pos)           /* (LCDC_LCDCFG1) Vertical Synchronization Pulse Width Mask */
#define LCDC_LCDCFG1_VSPW(value)              (LCDC_LCDCFG1_VSPW_Msk & (_UINT32_(value) << LCDC_LCDCFG1_VSPW_Pos)) /* Assigment of value for VSPW in the LCDC_LCDCFG1 register */
#define LCDC_LCDCFG1_Msk                      _UINT32_(0x03FF03FF)                                 /* (LCDC_LCDCFG1) Register Mask  */


/* -------- LCDC_LCDCFG2 : (LCDC Offset: 0x08) (R/W 32) LCD Controller Configuration Register 2 -------- */
#define LCDC_LCDCFG2_VFPW_Pos                 _UINT32_(0)                                          /* (LCDC_LCDCFG2) Vertical Front Porch Width Position */
#define LCDC_LCDCFG2_VFPW_Msk                 (_UINT32_(0x3FF) << LCDC_LCDCFG2_VFPW_Pos)           /* (LCDC_LCDCFG2) Vertical Front Porch Width Mask */
#define LCDC_LCDCFG2_VFPW(value)              (LCDC_LCDCFG2_VFPW_Msk & (_UINT32_(value) << LCDC_LCDCFG2_VFPW_Pos)) /* Assigment of value for VFPW in the LCDC_LCDCFG2 register */
#define LCDC_LCDCFG2_VBPW_Pos                 _UINT32_(16)                                         /* (LCDC_LCDCFG2) Vertical Back Porch Width Position */
#define LCDC_LCDCFG2_VBPW_Msk                 (_UINT32_(0x3FF) << LCDC_LCDCFG2_VBPW_Pos)           /* (LCDC_LCDCFG2) Vertical Back Porch Width Mask */
#define LCDC_LCDCFG2_VBPW(value)              (LCDC_LCDCFG2_VBPW_Msk & (_UINT32_(value) << LCDC_LCDCFG2_VBPW_Pos)) /* Assigment of value for VBPW in the LCDC_LCDCFG2 register */
#define LCDC_LCDCFG2_Msk                      _UINT32_(0x03FF03FF)                                 /* (LCDC_LCDCFG2) Register Mask  */


/* -------- LCDC_LCDCFG3 : (LCDC Offset: 0x0C) (R/W 32) LCD Controller Configuration Register 3 -------- */
#define LCDC_LCDCFG3_HFPW_Pos                 _UINT32_(0)                                          /* (LCDC_LCDCFG3) Horizontal Front Porch Width Position */
#define LCDC_LCDCFG3_HFPW_Msk                 (_UINT32_(0x3FF) << LCDC_LCDCFG3_HFPW_Pos)           /* (LCDC_LCDCFG3) Horizontal Front Porch Width Mask */
#define LCDC_LCDCFG3_HFPW(value)              (LCDC_LCDCFG3_HFPW_Msk & (_UINT32_(value) << LCDC_LCDCFG3_HFPW_Pos)) /* Assigment of value for HFPW in the LCDC_LCDCFG3 register */
#define LCDC_LCDCFG3_HBPW_Pos                 _UINT32_(16)                                         /* (LCDC_LCDCFG3) Horizontal Back Porch Width Position */
#define LCDC_LCDCFG3_HBPW_Msk                 (_UINT32_(0x3FF) << LCDC_LCDCFG3_HBPW_Pos)           /* (LCDC_LCDCFG3) Horizontal Back Porch Width Mask */
#define LCDC_LCDCFG3_HBPW(value)              (LCDC_LCDCFG3_HBPW_Msk & (_UINT32_(value) << LCDC_LCDCFG3_HBPW_Pos)) /* Assigment of value for HBPW in the LCDC_LCDCFG3 register */
#define LCDC_LCDCFG3_Msk                      _UINT32_(0x03FF03FF)                                 /* (LCDC_LCDCFG3) Register Mask  */


/* -------- LCDC_LCDCFG4 : (LCDC Offset: 0x10) (R/W 32) LCD Controller Configuration Register 4 -------- */
#define LCDC_LCDCFG4_PPL_Pos                  _UINT32_(0)                                          /* (LCDC_LCDCFG4) Number of Pixels Per Line Position */
#define LCDC_LCDCFG4_PPL_Msk                  (_UINT32_(0x7FF) << LCDC_LCDCFG4_PPL_Pos)            /* (LCDC_LCDCFG4) Number of Pixels Per Line Mask */
#define LCDC_LCDCFG4_PPL(value)               (LCDC_LCDCFG4_PPL_Msk & (_UINT32_(value) << LCDC_LCDCFG4_PPL_Pos)) /* Assigment of value for PPL in the LCDC_LCDCFG4 register */
#define LCDC_LCDCFG4_RPF_Pos                  _UINT32_(16)                                         /* (LCDC_LCDCFG4) Number of Active Row Per Frame Position */
#define LCDC_LCDCFG4_RPF_Msk                  (_UINT32_(0x7FF) << LCDC_LCDCFG4_RPF_Pos)            /* (LCDC_LCDCFG4) Number of Active Row Per Frame Mask */
#define LCDC_LCDCFG4_RPF(value)               (LCDC_LCDCFG4_RPF_Msk & (_UINT32_(value) << LCDC_LCDCFG4_RPF_Pos)) /* Assigment of value for RPF in the LCDC_LCDCFG4 register */
#define LCDC_LCDCFG4_Msk                      _UINT32_(0x07FF07FF)                                 /* (LCDC_LCDCFG4) Register Mask  */


