Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/test_app/firmware/src/packs/ATSAMA5D29_DFP/component/lcdc.h
/* -------- LCDC_LCDEN : (LCDC Offset: 0x20) ( /W 32) LCD Controller Enable Register -------- */
#define LCDC_LCDEN_CLKEN_Pos                  _UINT32_(0)                                          /* (LCDC_LCDEN) LCD Controller Pixel Clock Enable Position */
#define LCDC_LCDEN_CLKEN_Msk                  (_UINT32_(0x1) << LCDC_LCDEN_CLKEN_Pos)              /* (LCDC_LCDEN) LCD Controller Pixel Clock Enable Mask */
#define LCDC_LCDEN_CLKEN(value)               (LCDC_LCDEN_CLKEN_Msk & (_UINT32_(value) << LCDC_LCDEN_CLKEN_Pos)) /* Assigment of value for CLKEN in the LCDC_LCDEN register */
#define LCDC_LCDEN_SYNCEN_Pos                 _UINT32_(1)                                          /* (LCDC_LCDEN) LCD Controller Horizontal and Vertical Synchronization Enable Position */
#define LCDC_LCDEN_SYNCEN_Msk                 (_UINT32_(0x1) << LCDC_LCDEN_SYNCEN_Pos)             /* (LCDC_LCDEN) LCD Controller Horizontal and Vertical Synchronization Enable Mask */
#define LCDC_LCDEN_SYNCEN(value)              (LCDC_LCDEN_SYNCEN_Msk & (_UINT32_(value) << LCDC_LCDEN_SYNCEN_Pos)) /* Assigment of value for SYNCEN in the LCDC_LCDEN register */
#define LCDC_LCDEN_DISPEN_Pos                 _UINT32_(2)                                          /* (LCDC_LCDEN) LCD Controller DISP Signal Enable Position */
#define LCDC_LCDEN_DISPEN_Msk                 (_UINT32_(0x1) << LCDC_LCDEN_DISPEN_Pos)             /* (LCDC_LCDEN) LCD Controller DISP Signal Enable Mask */
#define LCDC_LCDEN_DISPEN(value)              (LCDC_LCDEN_DISPEN_Msk & (_UINT32_(value) << LCDC_LCDEN_DISPEN_Pos)) /* Assigment of value for DISPEN in the LCDC_LCDEN register */
#define LCDC_LCDEN_PWMEN_Pos                  _UINT32_(3)                                          /* (LCDC_LCDEN) LCD Controller Pulse Width Modulation Enable Position */
#define LCDC_LCDEN_PWMEN_Msk                  (_UINT32_(0x1) << LCDC_LCDEN_PWMEN_Pos)              /* (LCDC_LCDEN) LCD Controller Pulse Width Modulation Enable Mask */
#define LCDC_LCDEN_PWMEN(value)               (LCDC_LCDEN_PWMEN_Msk & (_UINT32_(value) << LCDC_LCDEN_PWMEN_Pos)) /* Assigment of value for PWMEN in the LCDC_LCDEN register */
#define LCDC_LCDEN_Msk                        _UINT32_(0x0000000F)                                 /* (LCDC_LCDEN) Register Mask  */


/* -------- LCDC_LCDDIS : (LCDC Offset: 0x24) ( /W 32) LCD Controller Disable Register -------- */
#define LCDC_LCDDIS_CLKDIS_Pos                _UINT32_(0)                                          /* (LCDC_LCDDIS) LCD Controller Pixel Clock Disable Position */
#define LCDC_LCDDIS_CLKDIS_Msk                (_UINT32_(0x1) << LCDC_LCDDIS_CLKDIS_Pos)            /* (LCDC_LCDDIS) LCD Controller Pixel Clock Disable Mask */
#define LCDC_LCDDIS_CLKDIS(value)             (LCDC_LCDDIS_CLKDIS_Msk & (_UINT32_(value) << LCDC_LCDDIS_CLKDIS_Pos)) /* Assigment of value for CLKDIS in the LCDC_LCDDIS register */
#define LCDC_LCDDIS_SYNCDIS_Pos               _UINT32_(1)                                          /* (LCDC_LCDDIS) LCD Controller Horizontal and Vertical Synchronization Disable Position */
#define LCDC_LCDDIS_SYNCDIS_Msk               (_UINT32_(0x1) << LCDC_LCDDIS_SYNCDIS_Pos)           /* (LCDC_LCDDIS) LCD Controller Horizontal and Vertical Synchronization Disable Mask */
#define LCDC_LCDDIS_SYNCDIS(value)            (LCDC_LCDDIS_SYNCDIS_Msk & (_UINT32_(value) << LCDC_LCDDIS_SYNCDIS_Pos)) /* Assigment of value for SYNCDIS in the LCDC_LCDDIS register */
#define LCDC_LCDDIS_DISPDIS_Pos               _UINT32_(2)                                          /* (LCDC_LCDDIS) LCD Controller DISP Signal Disable Position */
#define LCDC_LCDDIS_DISPDIS_Msk               (_UINT32_(0x1) << LCDC_LCDDIS_DISPDIS_Pos)           /* (LCDC_LCDDIS) LCD Controller DISP Signal Disable Mask */
#define LCDC_LCDDIS_DISPDIS(value)            (LCDC_LCDDIS_DISPDIS_Msk & (_UINT32_(value) << LCDC_LCDDIS_DISPDIS_Pos)) /* Assigment of value for DISPDIS in the LCDC_LCDDIS register */
#define LCDC_LCDDIS_PWMDIS_Pos                _UINT32_(3)                                          /* (LCDC_LCDDIS) LCD Controller Pulse Width Modulation Disable Position */
#define LCDC_LCDDIS_PWMDIS_Msk                (_UINT32_(0x1) << LCDC_LCDDIS_PWMDIS_Pos)            /* (LCDC_LCDDIS) LCD Controller Pulse Width Modulation Disable Mask */
#define LCDC_LCDDIS_PWMDIS(value)             (LCDC_LCDDIS_PWMDIS_Msk & (_UINT32_(value) << LCDC_LCDDIS_PWMDIS_Pos)) /* Assigment of value for PWMDIS in the LCDC_LCDDIS register */
#define LCDC_LCDDIS_CLKRST_Pos                _UINT32_(8)                                          /* (LCDC_LCDDIS) LCD Controller Clock Reset Position */
#define LCDC_LCDDIS_CLKRST_Msk                (_UINT32_(0x1) << LCDC_LCDDIS_CLKRST_Pos)            /* (LCDC_LCDDIS) LCD Controller Clock Reset Mask */
#define LCDC_LCDDIS_CLKRST(value)             (LCDC_LCDDIS_CLKRST_Msk & (_UINT32_(value) << LCDC_LCDDIS_CLKRST_Pos)) /* Assigment of value for CLKRST in the LCDC_LCDDIS register */
#define LCDC_LCDDIS_SYNCRST_Pos               _UINT32_(9)                                          /* (LCDC_LCDDIS) LCD Controller Horizontal and Vertical Synchronization Reset Position */
#define LCDC_LCDDIS_SYNCRST_Msk               (_UINT32_(0x1) << LCDC_LCDDIS_SYNCRST_Pos)           /* (LCDC_LCDDIS) LCD Controller Horizontal and Vertical Synchronization Reset Mask */
#define LCDC_LCDDIS_SYNCRST(value)            (LCDC_LCDDIS_SYNCRST_Msk & (_UINT32_(value) << LCDC_LCDDIS_SYNCRST_Pos)) /* Assigment of value for SYNCRST in the LCDC_LCDDIS register */
#define LCDC_LCDDIS_DISPRST_Pos               _UINT32_(10)                                         /* (LCDC_LCDDIS) LCD Controller DISP Signal Reset Position */
#define LCDC_LCDDIS_DISPRST_Msk               (_UINT32_(0x1) << LCDC_LCDDIS_DISPRST_Pos)           /* (LCDC_LCDDIS) LCD Controller DISP Signal Reset Mask */
#define LCDC_LCDDIS_DISPRST(value)            (LCDC_LCDDIS_DISPRST_Msk & (_UINT32_(value) << LCDC_LCDDIS_DISPRST_Pos)) /* Assigment of value for DISPRST in the LCDC_LCDDIS register */
#define LCDC_LCDDIS_PWMRST_Pos                _UINT32_(11)                                         /* (LCDC_LCDDIS) LCD Controller PWM Reset Position */
#define LCDC_LCDDIS_PWMRST_Msk                (_UINT32_(0x1) << LCDC_LCDDIS_PWMRST_Pos)            /* (LCDC_LCDDIS) LCD Controller PWM Reset Mask */
#define LCDC_LCDDIS_PWMRST(value)             (LCDC_LCDDIS_PWMRST_Msk & (_UINT32_(value) << LCDC_LCDDIS_PWMRST_Pos)) /* Assigment of value for PWMRST in the LCDC_LCDDIS register */
#define LCDC_LCDDIS_Msk                       _UINT32_(0x00000F0F)                                 /* (LCDC_LCDDIS) Register Mask  */


/* -------- LCDC_LCDSR : (LCDC Offset: 0x28) ( R/ 32) LCD Controller Status Register -------- */
#define LCDC_LCDSR_CLKSTS_Pos                 _UINT32_(0)                                          /* (LCDC_LCDSR) Clock Status Position */
#define LCDC_LCDSR_CLKSTS_Msk                 (_UINT32_(0x1) << LCDC_LCDSR_CLKSTS_Pos)             /* (LCDC_LCDSR) Clock Status Mask */
#define LCDC_LCDSR_CLKSTS(value)              (LCDC_LCDSR_CLKSTS_Msk & (_UINT32_(value) << LCDC_LCDSR_CLKSTS_Pos)) /* Assigment of value for CLKSTS in the LCDC_LCDSR register */
#define LCDC_LCDSR_LCDSTS_Pos                 _UINT32_(1)                                          /* (LCDC_LCDSR) LCD Controller Synchronization status Position */
#define LCDC_LCDSR_LCDSTS_Msk                 (_UINT32_(0x1) << LCDC_LCDSR_LCDSTS_Pos)             /* (LCDC_LCDSR) LCD Controller Synchronization status Mask */
#define LCDC_LCDSR_LCDSTS(value)              (LCDC_LCDSR_LCDSTS_Msk & (_UINT32_(value) << LCDC_LCDSR_LCDSTS_Pos)) /* Assigment of value for LCDSTS in the LCDC_LCDSR register */
#define LCDC_LCDSR_DISPSTS_Pos                _UINT32_(2)                                          /* (LCDC_LCDSR) LCD Controller DISP Signal Status Position */
#define LCDC_LCDSR_DISPSTS_Msk                (_UINT32_(0x1) << LCDC_LCDSR_DISPSTS_Pos)            /* (LCDC_LCDSR) LCD Controller DISP Signal Status Mask */
#define LCDC_LCDSR_DISPSTS(value)             (LCDC_LCDSR_DISPSTS_Msk & (_UINT32_(value) << LCDC_LCDSR_DISPSTS_Pos)) /* Assigment of value for DISPSTS in the LCDC_LCDSR register */
#define LCDC_LCDSR_PWMSTS_Pos                 _UINT32_(3)                                          /* (LCDC_LCDSR) LCD Controller PWM Signal Status Position */
#define LCDC_LCDSR_PWMSTS_Msk                 (_UINT32_(0x1) << LCDC_LCDSR_PWMSTS_Pos)             /* (LCDC_LCDSR) LCD Controller PWM Signal Status Mask */
#define LCDC_LCDSR_PWMSTS(value)              (LCDC_LCDSR_PWMSTS_Msk & (_UINT32_(value) << LCDC_LCDSR_PWMSTS_Pos)) /* Assigment of value for PWMSTS in the LCDC_LCDSR register */
#define LCDC_LCDSR_SIPSTS_Pos                 _UINT32_(4)                                          /* (LCDC_LCDSR) Synchronization In Progress Position */
#define LCDC_LCDSR_SIPSTS_Msk                 (_UINT32_(0x1) << LCDC_LCDSR_SIPSTS_Pos)             /* (LCDC_LCDSR) Synchronization In Progress Mask */
#define LCDC_LCDSR_SIPSTS(value)              (LCDC_LCDSR_SIPSTS_Msk & (_UINT32_(value) << LCDC_LCDSR_SIPSTS_Pos)) /* Assigment of value for SIPSTS in the LCDC_LCDSR register */
#define LCDC_LCDSR_Msk                        _UINT32_(0x0000001F)                                 /* (LCDC_LCDSR) Register Mask  */


/* -------- LCDC_LCDIER : (LCDC Offset: 0x2C) ( /W 32) LCD Controller Interrupt Enable Register -------- */
#define LCDC_LCDIER_SOFIE_Pos                 _UINT32_(0)                                          /* (LCDC_LCDIER) Start of Frame Interrupt Enable Position */
#define LCDC_LCDIER_SOFIE_Msk                 (_UINT32_(0x1) << LCDC_LCDIER_SOFIE_Pos)             /* (LCDC_LCDIER) Start of Frame Interrupt Enable Mask */
#define LCDC_LCDIER_SOFIE(value)              (LCDC_LCDIER_SOFIE_Msk & (_UINT32_(value) << LCDC_LCDIER_SOFIE_Pos)) /* Assigment of value for SOFIE in the LCDC_LCDIER register */
#define LCDC_LCDIER_DISIE_Pos                 _UINT32_(1)                                          /* (LCDC_LCDIER) LCD Disable Interrupt Enable Position */
#define LCDC_LCDIER_DISIE_Msk                 (_UINT32_(0x1) << LCDC_LCDIER_DISIE_Pos)             /* (LCDC_LCDIER) LCD Disable Interrupt Enable Mask */
#define LCDC_LCDIER_DISIE(value)              (LCDC_LCDIER_DISIE_Msk & (_UINT32_(value) << LCDC_LCDIER_DISIE_Pos)) /* Assigment of value for DISIE in the LCDC_LCDIER register */
#define LCDC_LCDIER_DISPIE_Pos                _UINT32_(2)                                          /* (LCDC_LCDIER) Powerup/Powerdown Sequence Terminated Interrupt Enable Position */
#define LCDC_LCDIER_DISPIE_Msk                (_UINT32_(0x1) << LCDC_LCDIER_DISPIE_Pos)            /* (LCDC_LCDIER) Powerup/Powerdown Sequence Terminated Interrupt Enable Mask */
#define LCDC_LCDIER_DISPIE(value)             (LCDC_LCDIER_DISPIE_Msk & (_UINT32_(value) << LCDC_LCDIER_DISPIE_Pos)) /* Assigment of value for DISPIE in the LCDC_LCDIER register */
#define LCDC_LCDIER_FIFOERRIE_Pos             _UINT32_(4)                                          /* (LCDC_LCDIER) Output FIFO Error Interrupt Enable Position */
#define LCDC_LCDIER_FIFOERRIE_Msk             (_UINT32_(0x1) << LCDC_LCDIER_FIFOERRIE_Pos)         /* (LCDC_LCDIER) Output FIFO Error Interrupt Enable Mask */
#define LCDC_LCDIER_FIFOERRIE(value)          (LCDC_LCDIER_FIFOERRIE_Msk & (_UINT32_(value) << LCDC_LCDIER_FIFOERRIE_Pos)) /* Assigment of value for FIFOERRIE in the LCDC_LCDIER register */
#define LCDC_LCDIER_BASEIE_Pos                _UINT32_(8)                                          /* (LCDC_LCDIER) Base Layer Interrupt Enable Position */
#define LCDC_LCDIER_BASEIE_Msk                (_UINT32_(0x1) << LCDC_LCDIER_BASEIE_Pos)            /* (LCDC_LCDIER) Base Layer Interrupt Enable Mask */
#define LCDC_LCDIER_BASEIE(value)             (LCDC_LCDIER_BASEIE_Msk & (_UINT32_(value) << LCDC_LCDIER_BASEIE_Pos)) /* Assigment of value for BASEIE in the LCDC_LCDIER register */
#define LCDC_LCDIER_OVR1IE_Pos                _UINT32_(9)                                          /* (LCDC_LCDIER) Overlay 1 Interrupt Enable Position */
#define LCDC_LCDIER_OVR1IE_Msk                (_UINT32_(0x1) << LCDC_LCDIER_OVR1IE_Pos)            /* (LCDC_LCDIER) Overlay 1 Interrupt Enable Mask */
#define LCDC_LCDIER_OVR1IE(value)             (LCDC_LCDIER_OVR1IE_Msk & (_UINT32_(value) << LCDC_LCDIER_OVR1IE_Pos)) /* Assigment of value for OVR1IE in the LCDC_LCDIER register */
#define LCDC_LCDIER_OVR2IE_Pos                _UINT32_(10)                                         /* (LCDC_LCDIER) Overlay 2 Interrupt Enable Position */
#define LCDC_LCDIER_OVR2IE_Msk                (_UINT32_(0x1) << LCDC_LCDIER_OVR2IE_Pos)            /* (LCDC_LCDIER) Overlay 2 Interrupt Enable Mask */
#define LCDC_LCDIER_OVR2IE(value)             (LCDC_LCDIER_OVR2IE_Msk & (_UINT32_(value) << LCDC_LCDIER_OVR2IE_Pos)) /* Assigment of value for OVR2IE in the LCDC_LCDIER register */
#define LCDC_LCDIER_HEOIE_Pos                 _UINT32_(11)                                         /* (LCDC_LCDIER) High-End Overlay Interrupt Enable Position */
#define LCDC_LCDIER_HEOIE_Msk                 (_UINT32_(0x1) << LCDC_LCDIER_HEOIE_Pos)             /* (LCDC_LCDIER) High-End Overlay Interrupt Enable Mask */
#define LCDC_LCDIER_HEOIE(value)              (LCDC_LCDIER_HEOIE_Msk & (_UINT32_(value) << LCDC_LCDIER_HEOIE_Pos)) /* Assigment of value for HEOIE in the LCDC_LCDIER register */
#define LCDC_LCDIER_PPIE_Pos                  _UINT32_(13)                                         /* (LCDC_LCDIER) Post Processing Interrupt Enable Position */
#define LCDC_LCDIER_PPIE_Msk                  (_UINT32_(0x1) << LCDC_LCDIER_PPIE_Pos)              /* (LCDC_LCDIER) Post Processing Interrupt Enable Mask */
#define LCDC_LCDIER_PPIE(value)               (LCDC_LCDIER_PPIE_Msk & (_UINT32_(value) << LCDC_LCDIER_PPIE_Pos)) /* Assigment of value for PPIE in the LCDC_LCDIER register */
#define LCDC_LCDIER_Msk                       _UINT32_(0x00002F17)                                 /* (LCDC_LCDIER) Register Mask  */


