Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/test_app/firmware/src/packs/ATSAMA5D29_DFP/component/lcdc.h
/* -------- LCDC_OVR1CFG3 : (LCDC Offset: 0x178) (R/W 32) Overlay 1 Configuration Register 3 -------- */
#define LCDC_OVR1CFG3_XSIZE_Pos               _UINT32_(0)                                          /* (LCDC_OVR1CFG3) Horizontal Window Size Position */
#define LCDC_OVR1CFG3_XSIZE_Msk               (_UINT32_(0x7FF) << LCDC_OVR1CFG3_XSIZE_Pos)         /* (LCDC_OVR1CFG3) Horizontal Window Size Mask */
#define LCDC_OVR1CFG3_XSIZE(value)            (LCDC_OVR1CFG3_XSIZE_Msk & (_UINT32_(value) << LCDC_OVR1CFG3_XSIZE_Pos)) /* Assigment of value for XSIZE in the LCDC_OVR1CFG3 register */
#define LCDC_OVR1CFG3_YSIZE_Pos               _UINT32_(16)                                         /* (LCDC_OVR1CFG3) Vertical Window Size Position */
#define LCDC_OVR1CFG3_YSIZE_Msk               (_UINT32_(0x7FF) << LCDC_OVR1CFG3_YSIZE_Pos)         /* (LCDC_OVR1CFG3) Vertical Window Size Mask */
#define LCDC_OVR1CFG3_YSIZE(value)            (LCDC_OVR1CFG3_YSIZE_Msk & (_UINT32_(value) << LCDC_OVR1CFG3_YSIZE_Pos)) /* Assigment of value for YSIZE in the LCDC_OVR1CFG3 register */
#define LCDC_OVR1CFG3_Msk                     _UINT32_(0x07FF07FF)                                 /* (LCDC_OVR1CFG3) Register Mask  */


/* -------- LCDC_OVR1CFG4 : (LCDC Offset: 0x17C) (R/W 32) Overlay 1 Configuration Register 4 -------- */
#define LCDC_OVR1CFG4_XSTRIDE_Pos             _UINT32_(0)                                          /* (LCDC_OVR1CFG4) Horizontal Stride Position */
#define LCDC_OVR1CFG4_XSTRIDE_Msk             (_UINT32_(0xFFFFFFFF) << LCDC_OVR1CFG4_XSTRIDE_Pos)  /* (LCDC_OVR1CFG4) Horizontal Stride Mask */
#define LCDC_OVR1CFG4_XSTRIDE(value)          (LCDC_OVR1CFG4_XSTRIDE_Msk & (_UINT32_(value) << LCDC_OVR1CFG4_XSTRIDE_Pos)) /* Assigment of value for XSTRIDE in the LCDC_OVR1CFG4 register */
#define LCDC_OVR1CFG4_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (LCDC_OVR1CFG4) Register Mask  */


/* -------- LCDC_OVR1CFG5 : (LCDC Offset: 0x180) (R/W 32) Overlay 1 Configuration Register 5 -------- */
#define LCDC_OVR1CFG5_PSTRIDE_Pos             _UINT32_(0)                                          /* (LCDC_OVR1CFG5) Pixel Stride Position */
#define LCDC_OVR1CFG5_PSTRIDE_Msk             (_UINT32_(0xFFFFFFFF) << LCDC_OVR1CFG5_PSTRIDE_Pos)  /* (LCDC_OVR1CFG5) Pixel Stride Mask */
#define LCDC_OVR1CFG5_PSTRIDE(value)          (LCDC_OVR1CFG5_PSTRIDE_Msk & (_UINT32_(value) << LCDC_OVR1CFG5_PSTRIDE_Pos)) /* Assigment of value for PSTRIDE in the LCDC_OVR1CFG5 register */
#define LCDC_OVR1CFG5_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (LCDC_OVR1CFG5) Register Mask  */


/* -------- LCDC_OVR1CFG6 : (LCDC Offset: 0x184) (R/W 32) Overlay 1 Configuration Register 6 -------- */
#define LCDC_OVR1CFG6_BDEF_Pos                _UINT32_(0)                                          /* (LCDC_OVR1CFG6) Blue Default Position */
#define LCDC_OVR1CFG6_BDEF_Msk                (_UINT32_(0xFF) << LCDC_OVR1CFG6_BDEF_Pos)           /* (LCDC_OVR1CFG6) Blue Default Mask */
#define LCDC_OVR1CFG6_BDEF(value)             (LCDC_OVR1CFG6_BDEF_Msk & (_UINT32_(value) << LCDC_OVR1CFG6_BDEF_Pos)) /* Assigment of value for BDEF in the LCDC_OVR1CFG6 register */
#define LCDC_OVR1CFG6_GDEF_Pos                _UINT32_(8)                                          /* (LCDC_OVR1CFG6) Green Default Position */
#define LCDC_OVR1CFG6_GDEF_Msk                (_UINT32_(0xFF) << LCDC_OVR1CFG6_GDEF_Pos)           /* (LCDC_OVR1CFG6) Green Default Mask */
#define LCDC_OVR1CFG6_GDEF(value)             (LCDC_OVR1CFG6_GDEF_Msk & (_UINT32_(value) << LCDC_OVR1CFG6_GDEF_Pos)) /* Assigment of value for GDEF in the LCDC_OVR1CFG6 register */
#define LCDC_OVR1CFG6_RDEF_Pos                _UINT32_(16)                                         /* (LCDC_OVR1CFG6) Red Default Position */
#define LCDC_OVR1CFG6_RDEF_Msk                (_UINT32_(0xFF) << LCDC_OVR1CFG6_RDEF_Pos)           /* (LCDC_OVR1CFG6) Red Default Mask */
#define LCDC_OVR1CFG6_RDEF(value)             (LCDC_OVR1CFG6_RDEF_Msk & (_UINT32_(value) << LCDC_OVR1CFG6_RDEF_Pos)) /* Assigment of value for RDEF in the LCDC_OVR1CFG6 register */
#define LCDC_OVR1CFG6_Msk                     _UINT32_(0x00FFFFFF)                                 /* (LCDC_OVR1CFG6) Register Mask  */


/* -------- LCDC_OVR1CFG7 : (LCDC Offset: 0x188) (R/W 32) Overlay 1 Configuration Register 7 -------- */
#define LCDC_OVR1CFG7_BKEY_Pos                _UINT32_(0)                                          /* (LCDC_OVR1CFG7) Blue Color Component Chroma Key Position */
#define LCDC_OVR1CFG7_BKEY_Msk                (_UINT32_(0xFF) << LCDC_OVR1CFG7_BKEY_Pos)           /* (LCDC_OVR1CFG7) Blue Color Component Chroma Key Mask */
#define LCDC_OVR1CFG7_BKEY(value)             (LCDC_OVR1CFG7_BKEY_Msk & (_UINT32_(value) << LCDC_OVR1CFG7_BKEY_Pos)) /* Assigment of value for BKEY in the LCDC_OVR1CFG7 register */
#define LCDC_OVR1CFG7_GKEY_Pos                _UINT32_(8)                                          /* (LCDC_OVR1CFG7) Green Color Component Chroma Key Position */
#define LCDC_OVR1CFG7_GKEY_Msk                (_UINT32_(0xFF) << LCDC_OVR1CFG7_GKEY_Pos)           /* (LCDC_OVR1CFG7) Green Color Component Chroma Key Mask */
#define LCDC_OVR1CFG7_GKEY(value)             (LCDC_OVR1CFG7_GKEY_Msk & (_UINT32_(value) << LCDC_OVR1CFG7_GKEY_Pos)) /* Assigment of value for GKEY in the LCDC_OVR1CFG7 register */
#define LCDC_OVR1CFG7_RKEY_Pos                _UINT32_(16)                                         /* (LCDC_OVR1CFG7) Red Color Component Chroma Key Position */
#define LCDC_OVR1CFG7_RKEY_Msk                (_UINT32_(0xFF) << LCDC_OVR1CFG7_RKEY_Pos)           /* (LCDC_OVR1CFG7) Red Color Component Chroma Key Mask */
#define LCDC_OVR1CFG7_RKEY(value)             (LCDC_OVR1CFG7_RKEY_Msk & (_UINT32_(value) << LCDC_OVR1CFG7_RKEY_Pos)) /* Assigment of value for RKEY in the LCDC_OVR1CFG7 register */
#define LCDC_OVR1CFG7_Msk                     _UINT32_(0x00FFFFFF)                                 /* (LCDC_OVR1CFG7) Register Mask  */


/* -------- LCDC_OVR1CFG8 : (LCDC Offset: 0x18C) (R/W 32) Overlay 1 Configuration Register 8 -------- */
#define LCDC_OVR1CFG8_BMASK_Pos               _UINT32_(0)                                          /* (LCDC_OVR1CFG8) Blue Color Component Chroma Key Mask Position */
#define LCDC_OVR1CFG8_BMASK_Msk               (_UINT32_(0xFF) << LCDC_OVR1CFG8_BMASK_Pos)          /* (LCDC_OVR1CFG8) Blue Color Component Chroma Key Mask Mask */
#define LCDC_OVR1CFG8_BMASK(value)            (LCDC_OVR1CFG8_BMASK_Msk & (_UINT32_(value) << LCDC_OVR1CFG8_BMASK_Pos)) /* Assigment of value for BMASK in the LCDC_OVR1CFG8 register */
#define LCDC_OVR1CFG8_GMASK_Pos               _UINT32_(8)                                          /* (LCDC_OVR1CFG8) Green Color Component Chroma Key Mask Position */
#define LCDC_OVR1CFG8_GMASK_Msk               (_UINT32_(0xFF) << LCDC_OVR1CFG8_GMASK_Pos)          /* (LCDC_OVR1CFG8) Green Color Component Chroma Key Mask Mask */
#define LCDC_OVR1CFG8_GMASK(value)            (LCDC_OVR1CFG8_GMASK_Msk & (_UINT32_(value) << LCDC_OVR1CFG8_GMASK_Pos)) /* Assigment of value for GMASK in the LCDC_OVR1CFG8 register */
#define LCDC_OVR1CFG8_RMASK_Pos               _UINT32_(16)                                         /* (LCDC_OVR1CFG8) Red Color Component Chroma Key Mask Position */
#define LCDC_OVR1CFG8_RMASK_Msk               (_UINT32_(0xFF) << LCDC_OVR1CFG8_RMASK_Pos)          /* (LCDC_OVR1CFG8) Red Color Component Chroma Key Mask Mask */
#define LCDC_OVR1CFG8_RMASK(value)            (LCDC_OVR1CFG8_RMASK_Msk & (_UINT32_(value) << LCDC_OVR1CFG8_RMASK_Pos)) /* Assigment of value for RMASK in the LCDC_OVR1CFG8 register */
#define LCDC_OVR1CFG8_Msk                     _UINT32_(0x00FFFFFF)                                 /* (LCDC_OVR1CFG8) Register Mask  */


/* -------- LCDC_OVR1CFG9 : (LCDC Offset: 0x190) (R/W 32) Overlay 1 Configuration Register 9 -------- */
#define LCDC_OVR1CFG9_CRKEY_Pos               _UINT32_(0)                                          /* (LCDC_OVR1CFG9) Blender Chroma Key Enable Position */
#define LCDC_OVR1CFG9_CRKEY_Msk               (_UINT32_(0x1) << LCDC_OVR1CFG9_CRKEY_Pos)           /* (LCDC_OVR1CFG9) Blender Chroma Key Enable Mask */
#define LCDC_OVR1CFG9_CRKEY(value)            (LCDC_OVR1CFG9_CRKEY_Msk & (_UINT32_(value) << LCDC_OVR1CFG9_CRKEY_Pos)) /* Assigment of value for CRKEY in the LCDC_OVR1CFG9 register */
#define LCDC_OVR1CFG9_INV_Pos                 _UINT32_(1)                                          /* (LCDC_OVR1CFG9) Blender Inverted Blender Output Enable Position */
#define LCDC_OVR1CFG9_INV_Msk                 (_UINT32_(0x1) << LCDC_OVR1CFG9_INV_Pos)             /* (LCDC_OVR1CFG9) Blender Inverted Blender Output Enable Mask */
#define LCDC_OVR1CFG9_INV(value)              (LCDC_OVR1CFG9_INV_Msk & (_UINT32_(value) << LCDC_OVR1CFG9_INV_Pos)) /* Assigment of value for INV in the LCDC_OVR1CFG9 register */
#define LCDC_OVR1CFG9_ITER2BL_Pos             _UINT32_(2)                                          /* (LCDC_OVR1CFG9) Blender Iterated Color Enable Position */
#define LCDC_OVR1CFG9_ITER2BL_Msk             (_UINT32_(0x1) << LCDC_OVR1CFG9_ITER2BL_Pos)         /* (LCDC_OVR1CFG9) Blender Iterated Color Enable Mask */
#define LCDC_OVR1CFG9_ITER2BL(value)          (LCDC_OVR1CFG9_ITER2BL_Msk & (_UINT32_(value) << LCDC_OVR1CFG9_ITER2BL_Pos)) /* Assigment of value for ITER2BL in the LCDC_OVR1CFG9 register */
#define LCDC_OVR1CFG9_ITER_Pos                _UINT32_(3)                                          /* (LCDC_OVR1CFG9) Blender Use Iterated Color Position */
#define LCDC_OVR1CFG9_ITER_Msk                (_UINT32_(0x1) << LCDC_OVR1CFG9_ITER_Pos)            /* (LCDC_OVR1CFG9) Blender Use Iterated Color Mask */
#define LCDC_OVR1CFG9_ITER(value)             (LCDC_OVR1CFG9_ITER_Msk & (_UINT32_(value) << LCDC_OVR1CFG9_ITER_Pos)) /* Assigment of value for ITER in the LCDC_OVR1CFG9 register */
#define LCDC_OVR1CFG9_REVALPHA_Pos            _UINT32_(4)                                          /* (LCDC_OVR1CFG9) Blender Reverse Alpha Position */
#define LCDC_OVR1CFG9_REVALPHA_Msk            (_UINT32_(0x1) << LCDC_OVR1CFG9_REVALPHA_Pos)        /* (LCDC_OVR1CFG9) Blender Reverse Alpha Mask */
#define LCDC_OVR1CFG9_REVALPHA(value)         (LCDC_OVR1CFG9_REVALPHA_Msk & (_UINT32_(value) << LCDC_OVR1CFG9_REVALPHA_Pos)) /* Assigment of value for REVALPHA in the LCDC_OVR1CFG9 register */
#define LCDC_OVR1CFG9_GAEN_Pos                _UINT32_(5)                                          /* (LCDC_OVR1CFG9) Blender Global Alpha Enable Position */
#define LCDC_OVR1CFG9_GAEN_Msk                (_UINT32_(0x1) << LCDC_OVR1CFG9_GAEN_Pos)            /* (LCDC_OVR1CFG9) Blender Global Alpha Enable Mask */
#define LCDC_OVR1CFG9_GAEN(value)             (LCDC_OVR1CFG9_GAEN_Msk & (_UINT32_(value) << LCDC_OVR1CFG9_GAEN_Pos)) /* Assigment of value for GAEN in the LCDC_OVR1CFG9 register */
#define LCDC_OVR1CFG9_LAEN_Pos                _UINT32_(6)                                          /* (LCDC_OVR1CFG9) Blender Local Alpha Enable Position */
#define LCDC_OVR1CFG9_LAEN_Msk                (_UINT32_(0x1) << LCDC_OVR1CFG9_LAEN_Pos)            /* (LCDC_OVR1CFG9) Blender Local Alpha Enable Mask */
#define LCDC_OVR1CFG9_LAEN(value)             (LCDC_OVR1CFG9_LAEN_Msk & (_UINT32_(value) << LCDC_OVR1CFG9_LAEN_Pos)) /* Assigment of value for LAEN in the LCDC_OVR1CFG9 register */
#define LCDC_OVR1CFG9_OVR_Pos                 _UINT32_(7)                                          /* (LCDC_OVR1CFG9) Blender Overlay Layer Enable Position */
#define LCDC_OVR1CFG9_OVR_Msk                 (_UINT32_(0x1) << LCDC_OVR1CFG9_OVR_Pos)             /* (LCDC_OVR1CFG9) Blender Overlay Layer Enable Mask */
#define LCDC_OVR1CFG9_OVR(value)              (LCDC_OVR1CFG9_OVR_Msk & (_UINT32_(value) << LCDC_OVR1CFG9_OVR_Pos)) /* Assigment of value for OVR in the LCDC_OVR1CFG9 register */
#define LCDC_OVR1CFG9_DMA_Pos                 _UINT32_(8)                                          /* (LCDC_OVR1CFG9) Blender DMA Layer Enable Position */
#define LCDC_OVR1CFG9_DMA_Msk                 (_UINT32_(0x1) << LCDC_OVR1CFG9_DMA_Pos)             /* (LCDC_OVR1CFG9) Blender DMA Layer Enable Mask */
#define LCDC_OVR1CFG9_DMA(value)              (LCDC_OVR1CFG9_DMA_Msk & (_UINT32_(value) << LCDC_OVR1CFG9_DMA_Pos)) /* Assigment of value for DMA in the LCDC_OVR1CFG9 register */
#define LCDC_OVR1CFG9_REP_Pos                 _UINT32_(9)                                          /* (LCDC_OVR1CFG9) Use Replication logic to expand RGB color to 24 bits Position */
#define LCDC_OVR1CFG9_REP_Msk                 (_UINT32_(0x1) << LCDC_OVR1CFG9_REP_Pos)             /* (LCDC_OVR1CFG9) Use Replication logic to expand RGB color to 24 bits Mask */
#define LCDC_OVR1CFG9_REP(value)              (LCDC_OVR1CFG9_REP_Msk & (_UINT32_(value) << LCDC_OVR1CFG9_REP_Pos)) /* Assigment of value for REP in the LCDC_OVR1CFG9 register */
#define LCDC_OVR1CFG9_DSTKEY_Pos              _UINT32_(10)                                         /* (LCDC_OVR1CFG9) Destination Chroma Keying Position */
#define LCDC_OVR1CFG9_DSTKEY_Msk              (_UINT32_(0x1) << LCDC_OVR1CFG9_DSTKEY_Pos)          /* (LCDC_OVR1CFG9) Destination Chroma Keying Mask */
#define LCDC_OVR1CFG9_DSTKEY(value)           (LCDC_OVR1CFG9_DSTKEY_Msk & (_UINT32_(value) << LCDC_OVR1CFG9_DSTKEY_Pos)) /* Assigment of value for DSTKEY in the LCDC_OVR1CFG9 register */
#define LCDC_OVR1CFG9_GA_Pos                  _UINT32_(16)                                         /* (LCDC_OVR1CFG9) Blender Global Alpha Position */
#define LCDC_OVR1CFG9_GA_Msk                  (_UINT32_(0xFF) << LCDC_OVR1CFG9_GA_Pos)             /* (LCDC_OVR1CFG9) Blender Global Alpha Mask */
#define LCDC_OVR1CFG9_GA(value)               (LCDC_OVR1CFG9_GA_Msk & (_UINT32_(value) << LCDC_OVR1CFG9_GA_Pos)) /* Assigment of value for GA in the LCDC_OVR1CFG9 register */
#define LCDC_OVR1CFG9_Msk                     _UINT32_(0x00FF07FF)                                 /* (LCDC_OVR1CFG9) Register Mask  */


/* -------- LCDC_OVR2CHER : (LCDC Offset: 0x240) ( /W 32) Overlay 2 Channel Enable Register -------- */
#define LCDC_OVR2CHER_CHEN_Pos                _UINT32_(0)                                          /* (LCDC_OVR2CHER) Channel Enable Position */
#define LCDC_OVR2CHER_CHEN_Msk                (_UINT32_(0x1) << LCDC_OVR2CHER_CHEN_Pos)            /* (LCDC_OVR2CHER) Channel Enable Mask */
#define LCDC_OVR2CHER_CHEN(value)             (LCDC_OVR2CHER_CHEN_Msk & (_UINT32_(value) << LCDC_OVR2CHER_CHEN_Pos)) /* Assigment of value for CHEN in the LCDC_OVR2CHER register */
#define LCDC_OVR2CHER_UPDATEEN_Pos            _UINT32_(1)                                          /* (LCDC_OVR2CHER) Update Overlay Attributes Enable Position */
#define LCDC_OVR2CHER_UPDATEEN_Msk            (_UINT32_(0x1) << LCDC_OVR2CHER_UPDATEEN_Pos)        /* (LCDC_OVR2CHER) Update Overlay Attributes Enable Mask */
#define LCDC_OVR2CHER_UPDATEEN(value)         (LCDC_OVR2CHER_UPDATEEN_Msk & (_UINT32_(value) << LCDC_OVR2CHER_UPDATEEN_Pos)) /* Assigment of value for UPDATEEN in the LCDC_OVR2CHER register */
#define LCDC_OVR2CHER_A2QEN_Pos               _UINT32_(2)                                          /* (LCDC_OVR2CHER) Add To Queue Enable Position */
#define LCDC_OVR2CHER_A2QEN_Msk               (_UINT32_(0x1) << LCDC_OVR2CHER_A2QEN_Pos)           /* (LCDC_OVR2CHER) Add To Queue Enable Mask */
#define LCDC_OVR2CHER_A2QEN(value)            (LCDC_OVR2CHER_A2QEN_Msk & (_UINT32_(value) << LCDC_OVR2CHER_A2QEN_Pos)) /* Assigment of value for A2QEN in the LCDC_OVR2CHER register */
#define LCDC_OVR2CHER_Msk                     _UINT32_(0x00000007)                                 /* (LCDC_OVR2CHER) Register Mask  */


/* -------- LCDC_OVR2CHDR : (LCDC Offset: 0x244) ( /W 32) Overlay 2 Channel Disable Register -------- */
#define LCDC_OVR2CHDR_CHDIS_Pos               _UINT32_(0)                                          /* (LCDC_OVR2CHDR) Channel Disable Position */
#define LCDC_OVR2CHDR_CHDIS_Msk               (_UINT32_(0x1) << LCDC_OVR2CHDR_CHDIS_Pos)           /* (LCDC_OVR2CHDR) Channel Disable Mask */
#define LCDC_OVR2CHDR_CHDIS(value)            (LCDC_OVR2CHDR_CHDIS_Msk & (_UINT32_(value) << LCDC_OVR2CHDR_CHDIS_Pos)) /* Assigment of value for CHDIS in the LCDC_OVR2CHDR register */
#define LCDC_OVR2CHDR_CHRST_Pos               _UINT32_(8)                                          /* (LCDC_OVR2CHDR) Channel Reset Position */
#define LCDC_OVR2CHDR_CHRST_Msk               (_UINT32_(0x1) << LCDC_OVR2CHDR_CHRST_Pos)           /* (LCDC_OVR2CHDR) Channel Reset Mask */
#define LCDC_OVR2CHDR_CHRST(value)            (LCDC_OVR2CHDR_CHRST_Msk & (_UINT32_(value) << LCDC_OVR2CHDR_CHRST_Pos)) /* Assigment of value for CHRST in the LCDC_OVR2CHDR register */
#define LCDC_OVR2CHDR_Msk                     _UINT32_(0x00000101)                                 /* (LCDC_OVR2CHDR) Register Mask  */


