Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/test_app/firmware/src/packs/ATSAMA5D29_DFP/component/lcdc.h
/* -------- LCDC_OVR2CHSR : (LCDC Offset: 0x248) ( R/ 32) Overlay 2 Channel Status Register -------- */
#define LCDC_OVR2CHSR_CHSR_Pos                _UINT32_(0)                                          /* (LCDC_OVR2CHSR) Channel Status Position */
#define LCDC_OVR2CHSR_CHSR_Msk                (_UINT32_(0x1) << LCDC_OVR2CHSR_CHSR_Pos)            /* (LCDC_OVR2CHSR) Channel Status Mask */
#define LCDC_OVR2CHSR_CHSR(value)             (LCDC_OVR2CHSR_CHSR_Msk & (_UINT32_(value) << LCDC_OVR2CHSR_CHSR_Pos)) /* Assigment of value for CHSR in the LCDC_OVR2CHSR register */
#define LCDC_OVR2CHSR_UPDATESR_Pos            _UINT32_(1)                                          /* (LCDC_OVR2CHSR) Update Overlay Attributes In Progress Status Position */
#define LCDC_OVR2CHSR_UPDATESR_Msk            (_UINT32_(0x1) << LCDC_OVR2CHSR_UPDATESR_Pos)        /* (LCDC_OVR2CHSR) Update Overlay Attributes In Progress Status Mask */
#define LCDC_OVR2CHSR_UPDATESR(value)         (LCDC_OVR2CHSR_UPDATESR_Msk & (_UINT32_(value) << LCDC_OVR2CHSR_UPDATESR_Pos)) /* Assigment of value for UPDATESR in the LCDC_OVR2CHSR register */
#define LCDC_OVR2CHSR_A2QSR_Pos               _UINT32_(2)                                          /* (LCDC_OVR2CHSR) Add To Queue Status Position */
#define LCDC_OVR2CHSR_A2QSR_Msk               (_UINT32_(0x1) << LCDC_OVR2CHSR_A2QSR_Pos)           /* (LCDC_OVR2CHSR) Add To Queue Status Mask */
#define LCDC_OVR2CHSR_A2QSR(value)            (LCDC_OVR2CHSR_A2QSR_Msk & (_UINT32_(value) << LCDC_OVR2CHSR_A2QSR_Pos)) /* Assigment of value for A2QSR in the LCDC_OVR2CHSR register */
#define LCDC_OVR2CHSR_Msk                     _UINT32_(0x00000007)                                 /* (LCDC_OVR2CHSR) Register Mask  */


/* -------- LCDC_OVR2IER : (LCDC Offset: 0x24C) ( /W 32) Overlay 2 Interrupt Enable Register -------- */
#define LCDC_OVR2IER_DMA_Pos                  _UINT32_(2)                                          /* (LCDC_OVR2IER) End of DMA Transfer Interrupt Enable Position */
#define LCDC_OVR2IER_DMA_Msk                  (_UINT32_(0x1) << LCDC_OVR2IER_DMA_Pos)              /* (LCDC_OVR2IER) End of DMA Transfer Interrupt Enable Mask */
#define LCDC_OVR2IER_DMA(value)               (LCDC_OVR2IER_DMA_Msk & (_UINT32_(value) << LCDC_OVR2IER_DMA_Pos)) /* Assigment of value for DMA in the LCDC_OVR2IER register */
#define LCDC_OVR2IER_DSCR_Pos                 _UINT32_(3)                                          /* (LCDC_OVR2IER) Descriptor Loaded Interrupt Enable Position */
#define LCDC_OVR2IER_DSCR_Msk                 (_UINT32_(0x1) << LCDC_OVR2IER_DSCR_Pos)             /* (LCDC_OVR2IER) Descriptor Loaded Interrupt Enable Mask */
#define LCDC_OVR2IER_DSCR(value)              (LCDC_OVR2IER_DSCR_Msk & (_UINT32_(value) << LCDC_OVR2IER_DSCR_Pos)) /* Assigment of value for DSCR in the LCDC_OVR2IER register */
#define LCDC_OVR2IER_ADD_Pos                  _UINT32_(4)                                          /* (LCDC_OVR2IER) Head Descriptor Loaded Interrupt Enable Position */
#define LCDC_OVR2IER_ADD_Msk                  (_UINT32_(0x1) << LCDC_OVR2IER_ADD_Pos)              /* (LCDC_OVR2IER) Head Descriptor Loaded Interrupt Enable Mask */
#define LCDC_OVR2IER_ADD(value)               (LCDC_OVR2IER_ADD_Msk & (_UINT32_(value) << LCDC_OVR2IER_ADD_Pos)) /* Assigment of value for ADD in the LCDC_OVR2IER register */
#define LCDC_OVR2IER_DONE_Pos                 _UINT32_(5)                                          /* (LCDC_OVR2IER) End of List Interrupt Enable Position */
#define LCDC_OVR2IER_DONE_Msk                 (_UINT32_(0x1) << LCDC_OVR2IER_DONE_Pos)             /* (LCDC_OVR2IER) End of List Interrupt Enable Mask */
#define LCDC_OVR2IER_DONE(value)              (LCDC_OVR2IER_DONE_Msk & (_UINT32_(value) << LCDC_OVR2IER_DONE_Pos)) /* Assigment of value for DONE in the LCDC_OVR2IER register */
#define LCDC_OVR2IER_OVR_Pos                  _UINT32_(6)                                          /* (LCDC_OVR2IER) Overflow Interrupt Enable Position */
#define LCDC_OVR2IER_OVR_Msk                  (_UINT32_(0x1) << LCDC_OVR2IER_OVR_Pos)              /* (LCDC_OVR2IER) Overflow Interrupt Enable Mask */
#define LCDC_OVR2IER_OVR(value)               (LCDC_OVR2IER_OVR_Msk & (_UINT32_(value) << LCDC_OVR2IER_OVR_Pos)) /* Assigment of value for OVR in the LCDC_OVR2IER register */
#define LCDC_OVR2IER_Msk                      _UINT32_(0x0000007C)                                 /* (LCDC_OVR2IER) Register Mask  */


/* -------- LCDC_OVR2IDR : (LCDC Offset: 0x250) ( /W 32) Overlay 2 Interrupt Disable Register -------- */
#define LCDC_OVR2IDR_DMA_Pos                  _UINT32_(2)                                          /* (LCDC_OVR2IDR) End of DMA Transfer Interrupt Disable Position */
#define LCDC_OVR2IDR_DMA_Msk                  (_UINT32_(0x1) << LCDC_OVR2IDR_DMA_Pos)              /* (LCDC_OVR2IDR) End of DMA Transfer Interrupt Disable Mask */
#define LCDC_OVR2IDR_DMA(value)               (LCDC_OVR2IDR_DMA_Msk & (_UINT32_(value) << LCDC_OVR2IDR_DMA_Pos)) /* Assigment of value for DMA in the LCDC_OVR2IDR register */
#define LCDC_OVR2IDR_DSCR_Pos                 _UINT32_(3)                                          /* (LCDC_OVR2IDR) Descriptor Loaded Interrupt Disable Position */
#define LCDC_OVR2IDR_DSCR_Msk                 (_UINT32_(0x1) << LCDC_OVR2IDR_DSCR_Pos)             /* (LCDC_OVR2IDR) Descriptor Loaded Interrupt Disable Mask */
#define LCDC_OVR2IDR_DSCR(value)              (LCDC_OVR2IDR_DSCR_Msk & (_UINT32_(value) << LCDC_OVR2IDR_DSCR_Pos)) /* Assigment of value for DSCR in the LCDC_OVR2IDR register */
#define LCDC_OVR2IDR_ADD_Pos                  _UINT32_(4)                                          /* (LCDC_OVR2IDR) Head Descriptor Loaded Interrupt Disable Position */
#define LCDC_OVR2IDR_ADD_Msk                  (_UINT32_(0x1) << LCDC_OVR2IDR_ADD_Pos)              /* (LCDC_OVR2IDR) Head Descriptor Loaded Interrupt Disable Mask */
#define LCDC_OVR2IDR_ADD(value)               (LCDC_OVR2IDR_ADD_Msk & (_UINT32_(value) << LCDC_OVR2IDR_ADD_Pos)) /* Assigment of value for ADD in the LCDC_OVR2IDR register */
#define LCDC_OVR2IDR_DONE_Pos                 _UINT32_(5)                                          /* (LCDC_OVR2IDR) End of List Interrupt Disable Position */
#define LCDC_OVR2IDR_DONE_Msk                 (_UINT32_(0x1) << LCDC_OVR2IDR_DONE_Pos)             /* (LCDC_OVR2IDR) End of List Interrupt Disable Mask */
#define LCDC_OVR2IDR_DONE(value)              (LCDC_OVR2IDR_DONE_Msk & (_UINT32_(value) << LCDC_OVR2IDR_DONE_Pos)) /* Assigment of value for DONE in the LCDC_OVR2IDR register */
#define LCDC_OVR2IDR_OVR_Pos                  _UINT32_(6)                                          /* (LCDC_OVR2IDR) Overflow Interrupt Disable Position */
#define LCDC_OVR2IDR_OVR_Msk                  (_UINT32_(0x1) << LCDC_OVR2IDR_OVR_Pos)              /* (LCDC_OVR2IDR) Overflow Interrupt Disable Mask */
#define LCDC_OVR2IDR_OVR(value)               (LCDC_OVR2IDR_OVR_Msk & (_UINT32_(value) << LCDC_OVR2IDR_OVR_Pos)) /* Assigment of value for OVR in the LCDC_OVR2IDR register */
#define LCDC_OVR2IDR_Msk                      _UINT32_(0x0000007C)                                 /* (LCDC_OVR2IDR) Register Mask  */


/* -------- LCDC_OVR2IMR : (LCDC Offset: 0x254) ( R/ 32) Overlay 2 Interrupt Mask Register -------- */
#define LCDC_OVR2IMR_DMA_Pos                  _UINT32_(2)                                          /* (LCDC_OVR2IMR) End of DMA Transfer Interrupt Mask Position */
#define LCDC_OVR2IMR_DMA_Msk                  (_UINT32_(0x1) << LCDC_OVR2IMR_DMA_Pos)              /* (LCDC_OVR2IMR) End of DMA Transfer Interrupt Mask Mask */
#define LCDC_OVR2IMR_DMA(value)               (LCDC_OVR2IMR_DMA_Msk & (_UINT32_(value) << LCDC_OVR2IMR_DMA_Pos)) /* Assigment of value for DMA in the LCDC_OVR2IMR register */
#define LCDC_OVR2IMR_DSCR_Pos                 _UINT32_(3)                                          /* (LCDC_OVR2IMR) Descriptor Loaded Interrupt Mask Position */
#define LCDC_OVR2IMR_DSCR_Msk                 (_UINT32_(0x1) << LCDC_OVR2IMR_DSCR_Pos)             /* (LCDC_OVR2IMR) Descriptor Loaded Interrupt Mask Mask */
#define LCDC_OVR2IMR_DSCR(value)              (LCDC_OVR2IMR_DSCR_Msk & (_UINT32_(value) << LCDC_OVR2IMR_DSCR_Pos)) /* Assigment of value for DSCR in the LCDC_OVR2IMR register */
#define LCDC_OVR2IMR_ADD_Pos                  _UINT32_(4)                                          /* (LCDC_OVR2IMR) Head Descriptor Loaded Interrupt Mask Position */
#define LCDC_OVR2IMR_ADD_Msk                  (_UINT32_(0x1) << LCDC_OVR2IMR_ADD_Pos)              /* (LCDC_OVR2IMR) Head Descriptor Loaded Interrupt Mask Mask */
#define LCDC_OVR2IMR_ADD(value)               (LCDC_OVR2IMR_ADD_Msk & (_UINT32_(value) << LCDC_OVR2IMR_ADD_Pos)) /* Assigment of value for ADD in the LCDC_OVR2IMR register */
#define LCDC_OVR2IMR_DONE_Pos                 _UINT32_(5)                                          /* (LCDC_OVR2IMR) End of List Interrupt Mask Position */
#define LCDC_OVR2IMR_DONE_Msk                 (_UINT32_(0x1) << LCDC_OVR2IMR_DONE_Pos)             /* (LCDC_OVR2IMR) End of List Interrupt Mask Mask */
#define LCDC_OVR2IMR_DONE(value)              (LCDC_OVR2IMR_DONE_Msk & (_UINT32_(value) << LCDC_OVR2IMR_DONE_Pos)) /* Assigment of value for DONE in the LCDC_OVR2IMR register */
#define LCDC_OVR2IMR_OVR_Pos                  _UINT32_(6)                                          /* (LCDC_OVR2IMR) Overflow Interrupt Mask Position */
#define LCDC_OVR2IMR_OVR_Msk                  (_UINT32_(0x1) << LCDC_OVR2IMR_OVR_Pos)              /* (LCDC_OVR2IMR) Overflow Interrupt Mask Mask */
#define LCDC_OVR2IMR_OVR(value)               (LCDC_OVR2IMR_OVR_Msk & (_UINT32_(value) << LCDC_OVR2IMR_OVR_Pos)) /* Assigment of value for OVR in the LCDC_OVR2IMR register */
#define LCDC_OVR2IMR_Msk                      _UINT32_(0x0000007C)                                 /* (LCDC_OVR2IMR) Register Mask  */


/* -------- LCDC_OVR2ISR : (LCDC Offset: 0x258) ( R/ 32) Overlay 2 Interrupt Status Register -------- */
#define LCDC_OVR2ISR_DMA_Pos                  _UINT32_(2)                                          /* (LCDC_OVR2ISR) End of DMA Transfer Position */
#define LCDC_OVR2ISR_DMA_Msk                  (_UINT32_(0x1) << LCDC_OVR2ISR_DMA_Pos)              /* (LCDC_OVR2ISR) End of DMA Transfer Mask */
#define LCDC_OVR2ISR_DMA(value)               (LCDC_OVR2ISR_DMA_Msk & (_UINT32_(value) << LCDC_OVR2ISR_DMA_Pos)) /* Assigment of value for DMA in the LCDC_OVR2ISR register */
#define LCDC_OVR2ISR_DSCR_Pos                 _UINT32_(3)                                          /* (LCDC_OVR2ISR) DMA Descriptor Loaded Position */
#define LCDC_OVR2ISR_DSCR_Msk                 (_UINT32_(0x1) << LCDC_OVR2ISR_DSCR_Pos)             /* (LCDC_OVR2ISR) DMA Descriptor Loaded Mask */
#define LCDC_OVR2ISR_DSCR(value)              (LCDC_OVR2ISR_DSCR_Msk & (_UINT32_(value) << LCDC_OVR2ISR_DSCR_Pos)) /* Assigment of value for DSCR in the LCDC_OVR2ISR register */
#define LCDC_OVR2ISR_ADD_Pos                  _UINT32_(4)                                          /* (LCDC_OVR2ISR) Head Descriptor Loaded Position */
#define LCDC_OVR2ISR_ADD_Msk                  (_UINT32_(0x1) << LCDC_OVR2ISR_ADD_Pos)              /* (LCDC_OVR2ISR) Head Descriptor Loaded Mask */
#define LCDC_OVR2ISR_ADD(value)               (LCDC_OVR2ISR_ADD_Msk & (_UINT32_(value) << LCDC_OVR2ISR_ADD_Pos)) /* Assigment of value for ADD in the LCDC_OVR2ISR register */
#define LCDC_OVR2ISR_DONE_Pos                 _UINT32_(5)                                          /* (LCDC_OVR2ISR) End of List Detected Position */
#define LCDC_OVR2ISR_DONE_Msk                 (_UINT32_(0x1) << LCDC_OVR2ISR_DONE_Pos)             /* (LCDC_OVR2ISR) End of List Detected Mask */
#define LCDC_OVR2ISR_DONE(value)              (LCDC_OVR2ISR_DONE_Msk & (_UINT32_(value) << LCDC_OVR2ISR_DONE_Pos)) /* Assigment of value for DONE in the LCDC_OVR2ISR register */
#define LCDC_OVR2ISR_OVR_Pos                  _UINT32_(6)                                          /* (LCDC_OVR2ISR) Overflow Detected Position */
#define LCDC_OVR2ISR_OVR_Msk                  (_UINT32_(0x1) << LCDC_OVR2ISR_OVR_Pos)              /* (LCDC_OVR2ISR) Overflow Detected Mask */
#define LCDC_OVR2ISR_OVR(value)               (LCDC_OVR2ISR_OVR_Msk & (_UINT32_(value) << LCDC_OVR2ISR_OVR_Pos)) /* Assigment of value for OVR in the LCDC_OVR2ISR register */
#define LCDC_OVR2ISR_Msk                      _UINT32_(0x0000007C)                                 /* (LCDC_OVR2ISR) Register Mask  */


/* -------- LCDC_OVR2HEAD : (LCDC Offset: 0x25C) (R/W 32) Overlay 2 DMA Head Register -------- */
#define LCDC_OVR2HEAD_HEAD_Pos                _UINT32_(2)                                          /* (LCDC_OVR2HEAD) DMA Head Pointer Position */
#define LCDC_OVR2HEAD_HEAD_Msk                (_UINT32_(0x3FFFFFFF) << LCDC_OVR2HEAD_HEAD_Pos)     /* (LCDC_OVR2HEAD) DMA Head Pointer Mask */
#define LCDC_OVR2HEAD_HEAD(value)             (LCDC_OVR2HEAD_HEAD_Msk & (_UINT32_(value) << LCDC_OVR2HEAD_HEAD_Pos)) /* Assigment of value for HEAD in the LCDC_OVR2HEAD register */
#define LCDC_OVR2HEAD_Msk                     _UINT32_(0xFFFFFFFC)                                 /* (LCDC_OVR2HEAD) Register Mask  */


/* -------- LCDC_OVR2ADDR : (LCDC Offset: 0x260) (R/W 32) Overlay 2 DMA Address Register -------- */
#define LCDC_OVR2ADDR_ADDR_Pos                _UINT32_(0)                                          /* (LCDC_OVR2ADDR) DMA Transfer Overlay 2 Address Position */
#define LCDC_OVR2ADDR_ADDR_Msk                (_UINT32_(0xFFFFFFFF) << LCDC_OVR2ADDR_ADDR_Pos)     /* (LCDC_OVR2ADDR) DMA Transfer Overlay 2 Address Mask */
#define LCDC_OVR2ADDR_ADDR(value)             (LCDC_OVR2ADDR_ADDR_Msk & (_UINT32_(value) << LCDC_OVR2ADDR_ADDR_Pos)) /* Assigment of value for ADDR in the LCDC_OVR2ADDR register */
#define LCDC_OVR2ADDR_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (LCDC_OVR2ADDR) Register Mask  */


