Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/test_app/firmware/src/packs/ATSAMA5D29_DFP/component/lcdc.h
/* -------- LCDC_OVR2CTRL : (LCDC Offset: 0x264) (R/W 32) Overlay 2 DMA Control Register -------- */
#define LCDC_OVR2CTRL_DFETCH_Pos              _UINT32_(0)                                          /* (LCDC_OVR2CTRL) Transfer Descriptor Fetch Enable Position */
#define LCDC_OVR2CTRL_DFETCH_Msk              (_UINT32_(0x1) << LCDC_OVR2CTRL_DFETCH_Pos)          /* (LCDC_OVR2CTRL) Transfer Descriptor Fetch Enable Mask */
#define LCDC_OVR2CTRL_DFETCH(value)           (LCDC_OVR2CTRL_DFETCH_Msk & (_UINT32_(value) << LCDC_OVR2CTRL_DFETCH_Pos)) /* Assigment of value for DFETCH in the LCDC_OVR2CTRL register */
#define LCDC_OVR2CTRL_LFETCH_Pos              _UINT32_(1)                                          /* (LCDC_OVR2CTRL) Lookup Table Fetch Enable Position */
#define LCDC_OVR2CTRL_LFETCH_Msk              (_UINT32_(0x1) << LCDC_OVR2CTRL_LFETCH_Pos)          /* (LCDC_OVR2CTRL) Lookup Table Fetch Enable Mask */
#define LCDC_OVR2CTRL_LFETCH(value)           (LCDC_OVR2CTRL_LFETCH_Msk & (_UINT32_(value) << LCDC_OVR2CTRL_LFETCH_Pos)) /* Assigment of value for LFETCH in the LCDC_OVR2CTRL register */
#define LCDC_OVR2CTRL_DMAIEN_Pos              _UINT32_(2)                                          /* (LCDC_OVR2CTRL) End of DMA Transfer Interrupt Enable Position */
#define LCDC_OVR2CTRL_DMAIEN_Msk              (_UINT32_(0x1) << LCDC_OVR2CTRL_DMAIEN_Pos)          /* (LCDC_OVR2CTRL) End of DMA Transfer Interrupt Enable Mask */
#define LCDC_OVR2CTRL_DMAIEN(value)           (LCDC_OVR2CTRL_DMAIEN_Msk & (_UINT32_(value) << LCDC_OVR2CTRL_DMAIEN_Pos)) /* Assigment of value for DMAIEN in the LCDC_OVR2CTRL register */
#define LCDC_OVR2CTRL_DSCRIEN_Pos             _UINT32_(3)                                          /* (LCDC_OVR2CTRL) Descriptor Loaded Interrupt Enable Position */
#define LCDC_OVR2CTRL_DSCRIEN_Msk             (_UINT32_(0x1) << LCDC_OVR2CTRL_DSCRIEN_Pos)         /* (LCDC_OVR2CTRL) Descriptor Loaded Interrupt Enable Mask */
#define LCDC_OVR2CTRL_DSCRIEN(value)          (LCDC_OVR2CTRL_DSCRIEN_Msk & (_UINT32_(value) << LCDC_OVR2CTRL_DSCRIEN_Pos)) /* Assigment of value for DSCRIEN in the LCDC_OVR2CTRL register */
#define LCDC_OVR2CTRL_ADDIEN_Pos              _UINT32_(4)                                          /* (LCDC_OVR2CTRL) Add Head Descriptor to Queue Interrupt Enable Position */
#define LCDC_OVR2CTRL_ADDIEN_Msk              (_UINT32_(0x1) << LCDC_OVR2CTRL_ADDIEN_Pos)          /* (LCDC_OVR2CTRL) Add Head Descriptor to Queue Interrupt Enable Mask */
#define LCDC_OVR2CTRL_ADDIEN(value)           (LCDC_OVR2CTRL_ADDIEN_Msk & (_UINT32_(value) << LCDC_OVR2CTRL_ADDIEN_Pos)) /* Assigment of value for ADDIEN in the LCDC_OVR2CTRL register */
#define LCDC_OVR2CTRL_DONEIEN_Pos             _UINT32_(5)                                          /* (LCDC_OVR2CTRL) End of List Interrupt Enable Position */
#define LCDC_OVR2CTRL_DONEIEN_Msk             (_UINT32_(0x1) << LCDC_OVR2CTRL_DONEIEN_Pos)         /* (LCDC_OVR2CTRL) End of List Interrupt Enable Mask */
#define LCDC_OVR2CTRL_DONEIEN(value)          (LCDC_OVR2CTRL_DONEIEN_Msk & (_UINT32_(value) << LCDC_OVR2CTRL_DONEIEN_Pos)) /* Assigment of value for DONEIEN in the LCDC_OVR2CTRL register */
#define LCDC_OVR2CTRL_Msk                     _UINT32_(0x0000003F)                                 /* (LCDC_OVR2CTRL) Register Mask  */


/* -------- LCDC_OVR2NEXT : (LCDC Offset: 0x268) (R/W 32) Overlay 2 DMA Next Register -------- */
#define LCDC_OVR2NEXT_NEXT_Pos                _UINT32_(0)                                          /* (LCDC_OVR2NEXT) DMA Descriptor Next Address Position */
#define LCDC_OVR2NEXT_NEXT_Msk                (_UINT32_(0xFFFFFFFF) << LCDC_OVR2NEXT_NEXT_Pos)     /* (LCDC_OVR2NEXT) DMA Descriptor Next Address Mask */
#define LCDC_OVR2NEXT_NEXT(value)             (LCDC_OVR2NEXT_NEXT_Msk & (_UINT32_(value) << LCDC_OVR2NEXT_NEXT_Pos)) /* Assigment of value for NEXT in the LCDC_OVR2NEXT register */
#define LCDC_OVR2NEXT_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (LCDC_OVR2NEXT) Register Mask  */


/* -------- LCDC_OVR2CFG0 : (LCDC Offset: 0x26C) (R/W 32) Overlay 2 Configuration Register 0 -------- */
#define LCDC_OVR2CFG0_BLEN_Pos                _UINT32_(4)                                          /* (LCDC_OVR2CFG0) AHB Burst Length Position */
#define LCDC_OVR2CFG0_BLEN_Msk                (_UINT32_(0x3) << LCDC_OVR2CFG0_BLEN_Pos)            /* (LCDC_OVR2CFG0) AHB Burst Length Mask */
#define LCDC_OVR2CFG0_BLEN(value)             (LCDC_OVR2CFG0_BLEN_Msk & (_UINT32_(value) << LCDC_OVR2CFG0_BLEN_Pos)) /* Assigment of value for BLEN in the LCDC_OVR2CFG0 register */
#define   LCDC_OVR2CFG0_BLEN_AHB_SINGLE_Val   _UINT32_(0x0)                                        /* (LCDC_OVR2CFG0) AHB Access is started as soon as there is enough space in the FIFO to store one data. SINGLE, INCR, INCR4, INCR8 and INCR16 bursts are used. INCR is used for a burst of 2 and 3 beats.  */
#define   LCDC_OVR2CFG0_BLEN_AHB_INCR4_Val    _UINT32_(0x1)                                        /* (LCDC_OVR2CFG0) AHB Access is started as soon as there is enough space in the FIFO to store a total amount of 4 data. An AHB INCR4 Burst is used. SINGLE, INCR and INCR4 bursts are used. INCR is used for a burst of 2 and 3 beats.  */
#define   LCDC_OVR2CFG0_BLEN_AHB_INCR8_Val    _UINT32_(0x2)                                        /* (LCDC_OVR2CFG0) AHB Access is started as soon as there is enough space in the FIFO to store a total amount of 8 data. An AHB INCR8 Burst is used. SINGLE, INCR, INCR4 and INCR8 bursts are used. INCR is used for a burst of 2 and 3 beats.  */
#define   LCDC_OVR2CFG0_BLEN_AHB_INCR16_Val   _UINT32_(0x3)                                        /* (LCDC_OVR2CFG0) AHB Access is started as soon as there is enough space in the FIFO to store a total amount of 16 data. An AHB INCR16 Burst is used. SINGLE, INCR, INCR4, INCR8 and INCR16 bursts are used. INCR is used for a burst of 2 and 3 beats.  */
#define LCDC_OVR2CFG0_BLEN_AHB_SINGLE         (LCDC_OVR2CFG0_BLEN_AHB_SINGLE_Val << LCDC_OVR2CFG0_BLEN_Pos) /* (LCDC_OVR2CFG0) AHB Access is started as soon as there is enough space in the FIFO to store one data. SINGLE, INCR, INCR4, INCR8 and INCR16 bursts are used. INCR is used for a burst of 2 and 3 beats. Position  */
#define LCDC_OVR2CFG0_BLEN_AHB_INCR4          (LCDC_OVR2CFG0_BLEN_AHB_INCR4_Val << LCDC_OVR2CFG0_BLEN_Pos) /* (LCDC_OVR2CFG0) AHB Access is started as soon as there is enough space in the FIFO to store a total amount of 4 data. An AHB INCR4 Burst is used. SINGLE, INCR and INCR4 bursts are used. INCR is used for a burst of 2 and 3 beats. Position  */
#define LCDC_OVR2CFG0_BLEN_AHB_INCR8          (LCDC_OVR2CFG0_BLEN_AHB_INCR8_Val << LCDC_OVR2CFG0_BLEN_Pos) /* (LCDC_OVR2CFG0) AHB Access is started as soon as there is enough space in the FIFO to store a total amount of 8 data. An AHB INCR8 Burst is used. SINGLE, INCR, INCR4 and INCR8 bursts are used. INCR is used for a burst of 2 and 3 beats. Position  */
#define LCDC_OVR2CFG0_BLEN_AHB_INCR16         (LCDC_OVR2CFG0_BLEN_AHB_INCR16_Val << LCDC_OVR2CFG0_BLEN_Pos) /* (LCDC_OVR2CFG0) AHB Access is started as soon as there is enough space in the FIFO to store a total amount of 16 data. An AHB INCR16 Burst is used. SINGLE, INCR, INCR4, INCR8 and INCR16 bursts are used. INCR is used for a burst of 2 and 3 beats. Position  */
#define LCDC_OVR2CFG0_DLBO_Pos                _UINT32_(8)                                          /* (LCDC_OVR2CFG0) Defined Length Burst Only For Channel Bus Transaction Position */
#define LCDC_OVR2CFG0_DLBO_Msk                (_UINT32_(0x1) << LCDC_OVR2CFG0_DLBO_Pos)            /* (LCDC_OVR2CFG0) Defined Length Burst Only For Channel Bus Transaction Mask */
#define LCDC_OVR2CFG0_DLBO(value)             (LCDC_OVR2CFG0_DLBO_Msk & (_UINT32_(value) << LCDC_OVR2CFG0_DLBO_Pos)) /* Assigment of value for DLBO in the LCDC_OVR2CFG0 register */
#define LCDC_OVR2CFG0_ROTDIS_Pos              _UINT32_(12)                                         /* (LCDC_OVR2CFG0) Hardware Rotation Optimization Disable Position */
#define LCDC_OVR2CFG0_ROTDIS_Msk              (_UINT32_(0x1) << LCDC_OVR2CFG0_ROTDIS_Pos)          /* (LCDC_OVR2CFG0) Hardware Rotation Optimization Disable Mask */
#define LCDC_OVR2CFG0_ROTDIS(value)           (LCDC_OVR2CFG0_ROTDIS_Msk & (_UINT32_(value) << LCDC_OVR2CFG0_ROTDIS_Pos)) /* Assigment of value for ROTDIS in the LCDC_OVR2CFG0 register */
#define LCDC_OVR2CFG0_LOCKDIS_Pos             _UINT32_(13)                                         /* (LCDC_OVR2CFG0) Hardware Rotation Lock Disable Position */
#define LCDC_OVR2CFG0_LOCKDIS_Msk             (_UINT32_(0x1) << LCDC_OVR2CFG0_LOCKDIS_Pos)         /* (LCDC_OVR2CFG0) Hardware Rotation Lock Disable Mask */
#define LCDC_OVR2CFG0_LOCKDIS(value)          (LCDC_OVR2CFG0_LOCKDIS_Msk & (_UINT32_(value) << LCDC_OVR2CFG0_LOCKDIS_Pos)) /* Assigment of value for LOCKDIS in the LCDC_OVR2CFG0 register */
#define LCDC_OVR2CFG0_Msk                     _UINT32_(0x00003130)                                 /* (LCDC_OVR2CFG0) Register Mask  */


