Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/test_app/firmware/src/packs/ATSAMA5D29_DFP/component/lcdc.h
/* -------- LCDC_OVR2CFG2 : (LCDC Offset: 0x274) (R/W 32) Overlay 2 Configuration Register 2 -------- */
#define LCDC_OVR2CFG2_XPOS_Pos                _UINT32_(0)                                          /* (LCDC_OVR2CFG2) Horizontal Window Position Position */
#define LCDC_OVR2CFG2_XPOS_Msk                (_UINT32_(0x7FF) << LCDC_OVR2CFG2_XPOS_Pos)          /* (LCDC_OVR2CFG2) Horizontal Window Position Mask */
#define LCDC_OVR2CFG2_XPOS(value)             (LCDC_OVR2CFG2_XPOS_Msk & (_UINT32_(value) << LCDC_OVR2CFG2_XPOS_Pos)) /* Assigment of value for XPOS in the LCDC_OVR2CFG2 register */
#define LCDC_OVR2CFG2_YPOS_Pos                _UINT32_(16)                                         /* (LCDC_OVR2CFG2) Vertical Window Position Position */
#define LCDC_OVR2CFG2_YPOS_Msk                (_UINT32_(0x7FF) << LCDC_OVR2CFG2_YPOS_Pos)          /* (LCDC_OVR2CFG2) Vertical Window Position Mask */
#define LCDC_OVR2CFG2_YPOS(value)             (LCDC_OVR2CFG2_YPOS_Msk & (_UINT32_(value) << LCDC_OVR2CFG2_YPOS_Pos)) /* Assigment of value for YPOS in the LCDC_OVR2CFG2 register */
#define LCDC_OVR2CFG2_Msk                     _UINT32_(0x07FF07FF)                                 /* (LCDC_OVR2CFG2) Register Mask  */


/* -------- LCDC_OVR2CFG3 : (LCDC Offset: 0x278) (R/W 32) Overlay 2 Configuration Register 3 -------- */
#define LCDC_OVR2CFG3_XSIZE_Pos               _UINT32_(0)                                          /* (LCDC_OVR2CFG3) Horizontal Window Size Position */
#define LCDC_OVR2CFG3_XSIZE_Msk               (_UINT32_(0x7FF) << LCDC_OVR2CFG3_XSIZE_Pos)         /* (LCDC_OVR2CFG3) Horizontal Window Size Mask */
#define LCDC_OVR2CFG3_XSIZE(value)            (LCDC_OVR2CFG3_XSIZE_Msk & (_UINT32_(value) << LCDC_OVR2CFG3_XSIZE_Pos)) /* Assigment of value for XSIZE in the LCDC_OVR2CFG3 register */
#define LCDC_OVR2CFG3_YSIZE_Pos               _UINT32_(16)                                         /* (LCDC_OVR2CFG3) Vertical Window Size Position */
#define LCDC_OVR2CFG3_YSIZE_Msk               (_UINT32_(0x7FF) << LCDC_OVR2CFG3_YSIZE_Pos)         /* (LCDC_OVR2CFG3) Vertical Window Size Mask */
#define LCDC_OVR2CFG3_YSIZE(value)            (LCDC_OVR2CFG3_YSIZE_Msk & (_UINT32_(value) << LCDC_OVR2CFG3_YSIZE_Pos)) /* Assigment of value for YSIZE in the LCDC_OVR2CFG3 register */
#define LCDC_OVR2CFG3_Msk                     _UINT32_(0x07FF07FF)                                 /* (LCDC_OVR2CFG3) Register Mask  */


/* -------- LCDC_OVR2CFG4 : (LCDC Offset: 0x27C) (R/W 32) Overlay 2 Configuration Register 4 -------- */
#define LCDC_OVR2CFG4_XSTRIDE_Pos             _UINT32_(0)                                          /* (LCDC_OVR2CFG4) Horizontal Stride Position */
#define LCDC_OVR2CFG4_XSTRIDE_Msk             (_UINT32_(0xFFFFFFFF) << LCDC_OVR2CFG4_XSTRIDE_Pos)  /* (LCDC_OVR2CFG4) Horizontal Stride Mask */
#define LCDC_OVR2CFG4_XSTRIDE(value)          (LCDC_OVR2CFG4_XSTRIDE_Msk & (_UINT32_(value) << LCDC_OVR2CFG4_XSTRIDE_Pos)) /* Assigment of value for XSTRIDE in the LCDC_OVR2CFG4 register */
#define LCDC_OVR2CFG4_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (LCDC_OVR2CFG4) Register Mask  */


/* -------- LCDC_OVR2CFG5 : (LCDC Offset: 0x280) (R/W 32) Overlay 2 Configuration Register 5 -------- */
#define LCDC_OVR2CFG5_PSTRIDE_Pos             _UINT32_(0)                                          /* (LCDC_OVR2CFG5) Pixel Stride Position */
#define LCDC_OVR2CFG5_PSTRIDE_Msk             (_UINT32_(0xFFFFFFFF) << LCDC_OVR2CFG5_PSTRIDE_Pos)  /* (LCDC_OVR2CFG5) Pixel Stride Mask */
#define LCDC_OVR2CFG5_PSTRIDE(value)          (LCDC_OVR2CFG5_PSTRIDE_Msk & (_UINT32_(value) << LCDC_OVR2CFG5_PSTRIDE_Pos)) /* Assigment of value for PSTRIDE in the LCDC_OVR2CFG5 register */
#define LCDC_OVR2CFG5_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (LCDC_OVR2CFG5) Register Mask  */


/* -------- LCDC_OVR2CFG6 : (LCDC Offset: 0x284) (R/W 32) Overlay 2 Configuration Register 6 -------- */
#define LCDC_OVR2CFG6_BDEF_Pos                _UINT32_(0)                                          /* (LCDC_OVR2CFG6) Blue Default Position */
#define LCDC_OVR2CFG6_BDEF_Msk                (_UINT32_(0xFF) << LCDC_OVR2CFG6_BDEF_Pos)           /* (LCDC_OVR2CFG6) Blue Default Mask */
#define LCDC_OVR2CFG6_BDEF(value)             (LCDC_OVR2CFG6_BDEF_Msk & (_UINT32_(value) << LCDC_OVR2CFG6_BDEF_Pos)) /* Assigment of value for BDEF in the LCDC_OVR2CFG6 register */
#define LCDC_OVR2CFG6_GDEF_Pos                _UINT32_(8)                                          /* (LCDC_OVR2CFG6) Green Default Position */
#define LCDC_OVR2CFG6_GDEF_Msk                (_UINT32_(0xFF) << LCDC_OVR2CFG6_GDEF_Pos)           /* (LCDC_OVR2CFG6) Green Default Mask */
#define LCDC_OVR2CFG6_GDEF(value)             (LCDC_OVR2CFG6_GDEF_Msk & (_UINT32_(value) << LCDC_OVR2CFG6_GDEF_Pos)) /* Assigment of value for GDEF in the LCDC_OVR2CFG6 register */
#define LCDC_OVR2CFG6_RDEF_Pos                _UINT32_(16)                                         /* (LCDC_OVR2CFG6) Red Default Position */
#define LCDC_OVR2CFG6_RDEF_Msk                (_UINT32_(0xFF) << LCDC_OVR2CFG6_RDEF_Pos)           /* (LCDC_OVR2CFG6) Red Default Mask */
#define LCDC_OVR2CFG6_RDEF(value)             (LCDC_OVR2CFG6_RDEF_Msk & (_UINT32_(value) << LCDC_OVR2CFG6_RDEF_Pos)) /* Assigment of value for RDEF in the LCDC_OVR2CFG6 register */
#define LCDC_OVR2CFG6_Msk                     _UINT32_(0x00FFFFFF)                                 /* (LCDC_OVR2CFG6) Register Mask  */


/* -------- LCDC_OVR2CFG7 : (LCDC Offset: 0x288) (R/W 32) Overlay 2 Configuration Register 7 -------- */
#define LCDC_OVR2CFG7_BKEY_Pos                _UINT32_(0)                                          /* (LCDC_OVR2CFG7) Blue Color Component Chroma Key Position */
#define LCDC_OVR2CFG7_BKEY_Msk                (_UINT32_(0xFF) << LCDC_OVR2CFG7_BKEY_Pos)           /* (LCDC_OVR2CFG7) Blue Color Component Chroma Key Mask */
#define LCDC_OVR2CFG7_BKEY(value)             (LCDC_OVR2CFG7_BKEY_Msk & (_UINT32_(value) << LCDC_OVR2CFG7_BKEY_Pos)) /* Assigment of value for BKEY in the LCDC_OVR2CFG7 register */
#define LCDC_OVR2CFG7_GKEY_Pos                _UINT32_(8)                                          /* (LCDC_OVR2CFG7) Green Color Component Chroma Key Position */
#define LCDC_OVR2CFG7_GKEY_Msk                (_UINT32_(0xFF) << LCDC_OVR2CFG7_GKEY_Pos)           /* (LCDC_OVR2CFG7) Green Color Component Chroma Key Mask */
#define LCDC_OVR2CFG7_GKEY(value)             (LCDC_OVR2CFG7_GKEY_Msk & (_UINT32_(value) << LCDC_OVR2CFG7_GKEY_Pos)) /* Assigment of value for GKEY in the LCDC_OVR2CFG7 register */
#define LCDC_OVR2CFG7_RKEY_Pos                _UINT32_(16)                                         /* (LCDC_OVR2CFG7) Red Color Component Chroma Key Position */
#define LCDC_OVR2CFG7_RKEY_Msk                (_UINT32_(0xFF) << LCDC_OVR2CFG7_RKEY_Pos)           /* (LCDC_OVR2CFG7) Red Color Component Chroma Key Mask */
#define LCDC_OVR2CFG7_RKEY(value)             (LCDC_OVR2CFG7_RKEY_Msk & (_UINT32_(value) << LCDC_OVR2CFG7_RKEY_Pos)) /* Assigment of value for RKEY in the LCDC_OVR2CFG7 register */
#define LCDC_OVR2CFG7_Msk                     _UINT32_(0x00FFFFFF)                                 /* (LCDC_OVR2CFG7) Register Mask  */


/* -------- LCDC_OVR2CFG8 : (LCDC Offset: 0x28C) (R/W 32) Overlay 2 Configuration Register 8 -------- */
#define LCDC_OVR2CFG8_BMASK_Pos               _UINT32_(0)                                          /* (LCDC_OVR2CFG8) Blue Color Component Chroma Key Mask Position */
#define LCDC_OVR2CFG8_BMASK_Msk               (_UINT32_(0xFF) << LCDC_OVR2CFG8_BMASK_Pos)          /* (LCDC_OVR2CFG8) Blue Color Component Chroma Key Mask Mask */
#define LCDC_OVR2CFG8_BMASK(value)            (LCDC_OVR2CFG8_BMASK_Msk & (_UINT32_(value) << LCDC_OVR2CFG8_BMASK_Pos)) /* Assigment of value for BMASK in the LCDC_OVR2CFG8 register */
#define LCDC_OVR2CFG8_GMASK_Pos               _UINT32_(8)                                          /* (LCDC_OVR2CFG8) Green Color Component Chroma Key Mask Position */
#define LCDC_OVR2CFG8_GMASK_Msk               (_UINT32_(0xFF) << LCDC_OVR2CFG8_GMASK_Pos)          /* (LCDC_OVR2CFG8) Green Color Component Chroma Key Mask Mask */
#define LCDC_OVR2CFG8_GMASK(value)            (LCDC_OVR2CFG8_GMASK_Msk & (_UINT32_(value) << LCDC_OVR2CFG8_GMASK_Pos)) /* Assigment of value for GMASK in the LCDC_OVR2CFG8 register */
#define LCDC_OVR2CFG8_RMASK_Pos               _UINT32_(16)                                         /* (LCDC_OVR2CFG8) Red Color Component Chroma Key Mask Position */
#define LCDC_OVR2CFG8_RMASK_Msk               (_UINT32_(0xFF) << LCDC_OVR2CFG8_RMASK_Pos)          /* (LCDC_OVR2CFG8) Red Color Component Chroma Key Mask Mask */
#define LCDC_OVR2CFG8_RMASK(value)            (LCDC_OVR2CFG8_RMASK_Msk & (_UINT32_(value) << LCDC_OVR2CFG8_RMASK_Pos)) /* Assigment of value for RMASK in the LCDC_OVR2CFG8 register */
#define LCDC_OVR2CFG8_Msk                     _UINT32_(0x00FFFFFF)                                 /* (LCDC_OVR2CFG8) Register Mask  */


