Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/test_app/firmware/src/packs/ATSAMA5D29_DFP/component/lcdc.h
/* -------- LCDC_OVR2CFG9 : (LCDC Offset: 0x290) (R/W 32) Overlay 2 Configuration Register 9 -------- */
#define LCDC_OVR2CFG9_CRKEY_Pos               _UINT32_(0)                                          /* (LCDC_OVR2CFG9) Blender Chroma Key Enable Position */
#define LCDC_OVR2CFG9_CRKEY_Msk               (_UINT32_(0x1) << LCDC_OVR2CFG9_CRKEY_Pos)           /* (LCDC_OVR2CFG9) Blender Chroma Key Enable Mask */
#define LCDC_OVR2CFG9_CRKEY(value)            (LCDC_OVR2CFG9_CRKEY_Msk & (_UINT32_(value) << LCDC_OVR2CFG9_CRKEY_Pos)) /* Assigment of value for CRKEY in the LCDC_OVR2CFG9 register */
#define LCDC_OVR2CFG9_INV_Pos                 _UINT32_(1)                                          /* (LCDC_OVR2CFG9) Blender Inverted Blender Output Enable Position */
#define LCDC_OVR2CFG9_INV_Msk                 (_UINT32_(0x1) << LCDC_OVR2CFG9_INV_Pos)             /* (LCDC_OVR2CFG9) Blender Inverted Blender Output Enable Mask */
#define LCDC_OVR2CFG9_INV(value)              (LCDC_OVR2CFG9_INV_Msk & (_UINT32_(value) << LCDC_OVR2CFG9_INV_Pos)) /* Assigment of value for INV in the LCDC_OVR2CFG9 register */
#define LCDC_OVR2CFG9_ITER2BL_Pos             _UINT32_(2)                                          /* (LCDC_OVR2CFG9) Blender Iterated Color Enable Position */
#define LCDC_OVR2CFG9_ITER2BL_Msk             (_UINT32_(0x1) << LCDC_OVR2CFG9_ITER2BL_Pos)         /* (LCDC_OVR2CFG9) Blender Iterated Color Enable Mask */
#define LCDC_OVR2CFG9_ITER2BL(value)          (LCDC_OVR2CFG9_ITER2BL_Msk & (_UINT32_(value) << LCDC_OVR2CFG9_ITER2BL_Pos)) /* Assigment of value for ITER2BL in the LCDC_OVR2CFG9 register */
#define LCDC_OVR2CFG9_ITER_Pos                _UINT32_(3)                                          /* (LCDC_OVR2CFG9) Blender Use Iterated Color Position */
#define LCDC_OVR2CFG9_ITER_Msk                (_UINT32_(0x1) << LCDC_OVR2CFG9_ITER_Pos)            /* (LCDC_OVR2CFG9) Blender Use Iterated Color Mask */
#define LCDC_OVR2CFG9_ITER(value)             (LCDC_OVR2CFG9_ITER_Msk & (_UINT32_(value) << LCDC_OVR2CFG9_ITER_Pos)) /* Assigment of value for ITER in the LCDC_OVR2CFG9 register */
#define LCDC_OVR2CFG9_REVALPHA_Pos            _UINT32_(4)                                          /* (LCDC_OVR2CFG9) Blender Reverse Alpha Position */
#define LCDC_OVR2CFG9_REVALPHA_Msk            (_UINT32_(0x1) << LCDC_OVR2CFG9_REVALPHA_Pos)        /* (LCDC_OVR2CFG9) Blender Reverse Alpha Mask */
#define LCDC_OVR2CFG9_REVALPHA(value)         (LCDC_OVR2CFG9_REVALPHA_Msk & (_UINT32_(value) << LCDC_OVR2CFG9_REVALPHA_Pos)) /* Assigment of value for REVALPHA in the LCDC_OVR2CFG9 register */
#define LCDC_OVR2CFG9_GAEN_Pos                _UINT32_(5)                                          /* (LCDC_OVR2CFG9) Blender Global Alpha Enable Position */
#define LCDC_OVR2CFG9_GAEN_Msk                (_UINT32_(0x1) << LCDC_OVR2CFG9_GAEN_Pos)            /* (LCDC_OVR2CFG9) Blender Global Alpha Enable Mask */
#define LCDC_OVR2CFG9_GAEN(value)             (LCDC_OVR2CFG9_GAEN_Msk & (_UINT32_(value) << LCDC_OVR2CFG9_GAEN_Pos)) /* Assigment of value for GAEN in the LCDC_OVR2CFG9 register */
#define LCDC_OVR2CFG9_LAEN_Pos                _UINT32_(6)                                          /* (LCDC_OVR2CFG9) Blender Local Alpha Enable Position */
#define LCDC_OVR2CFG9_LAEN_Msk                (_UINT32_(0x1) << LCDC_OVR2CFG9_LAEN_Pos)            /* (LCDC_OVR2CFG9) Blender Local Alpha Enable Mask */
#define LCDC_OVR2CFG9_LAEN(value)             (LCDC_OVR2CFG9_LAEN_Msk & (_UINT32_(value) << LCDC_OVR2CFG9_LAEN_Pos)) /* Assigment of value for LAEN in the LCDC_OVR2CFG9 register */
#define LCDC_OVR2CFG9_OVR_Pos                 _UINT32_(7)                                          /* (LCDC_OVR2CFG9) Blender Overlay Layer Enable Position */
#define LCDC_OVR2CFG9_OVR_Msk                 (_UINT32_(0x1) << LCDC_OVR2CFG9_OVR_Pos)             /* (LCDC_OVR2CFG9) Blender Overlay Layer Enable Mask */
#define LCDC_OVR2CFG9_OVR(value)              (LCDC_OVR2CFG9_OVR_Msk & (_UINT32_(value) << LCDC_OVR2CFG9_OVR_Pos)) /* Assigment of value for OVR in the LCDC_OVR2CFG9 register */
#define LCDC_OVR2CFG9_DMA_Pos                 _UINT32_(8)                                          /* (LCDC_OVR2CFG9) Blender DMA Layer Enable Position */
#define LCDC_OVR2CFG9_DMA_Msk                 (_UINT32_(0x1) << LCDC_OVR2CFG9_DMA_Pos)             /* (LCDC_OVR2CFG9) Blender DMA Layer Enable Mask */
#define LCDC_OVR2CFG9_DMA(value)              (LCDC_OVR2CFG9_DMA_Msk & (_UINT32_(value) << LCDC_OVR2CFG9_DMA_Pos)) /* Assigment of value for DMA in the LCDC_OVR2CFG9 register */
#define LCDC_OVR2CFG9_REP_Pos                 _UINT32_(9)                                          /* (LCDC_OVR2CFG9) Use Replication logic to expand RGB color to 24 bits Position */
#define LCDC_OVR2CFG9_REP_Msk                 (_UINT32_(0x1) << LCDC_OVR2CFG9_REP_Pos)             /* (LCDC_OVR2CFG9) Use Replication logic to expand RGB color to 24 bits Mask */
#define LCDC_OVR2CFG9_REP(value)              (LCDC_OVR2CFG9_REP_Msk & (_UINT32_(value) << LCDC_OVR2CFG9_REP_Pos)) /* Assigment of value for REP in the LCDC_OVR2CFG9 register */
#define LCDC_OVR2CFG9_DSTKEY_Pos              _UINT32_(10)                                         /* (LCDC_OVR2CFG9) Destination Chroma Keying Position */
#define LCDC_OVR2CFG9_DSTKEY_Msk              (_UINT32_(0x1) << LCDC_OVR2CFG9_DSTKEY_Pos)          /* (LCDC_OVR2CFG9) Destination Chroma Keying Mask */
#define LCDC_OVR2CFG9_DSTKEY(value)           (LCDC_OVR2CFG9_DSTKEY_Msk & (_UINT32_(value) << LCDC_OVR2CFG9_DSTKEY_Pos)) /* Assigment of value for DSTKEY in the LCDC_OVR2CFG9 register */
#define LCDC_OVR2CFG9_GA_Pos                  _UINT32_(16)                                         /* (LCDC_OVR2CFG9) Blender Global Alpha Position */
#define LCDC_OVR2CFG9_GA_Msk                  (_UINT32_(0xFF) << LCDC_OVR2CFG9_GA_Pos)             /* (LCDC_OVR2CFG9) Blender Global Alpha Mask */
#define LCDC_OVR2CFG9_GA(value)               (LCDC_OVR2CFG9_GA_Msk & (_UINT32_(value) << LCDC_OVR2CFG9_GA_Pos)) /* Assigment of value for GA in the LCDC_OVR2CFG9 register */
#define LCDC_OVR2CFG9_Msk                     _UINT32_(0x00FF07FF)                                 /* (LCDC_OVR2CFG9) Register Mask  */


/* -------- LCDC_HEOCHER : (LCDC Offset: 0x340) ( /W 32) High-End Overlay Channel Enable Register -------- */
#define LCDC_HEOCHER_CHEN_Pos                 _UINT32_(0)                                          /* (LCDC_HEOCHER) Channel Enable Position */
#define LCDC_HEOCHER_CHEN_Msk                 (_UINT32_(0x1) << LCDC_HEOCHER_CHEN_Pos)             /* (LCDC_HEOCHER) Channel Enable Mask */
#define LCDC_HEOCHER_CHEN(value)              (LCDC_HEOCHER_CHEN_Msk & (_UINT32_(value) << LCDC_HEOCHER_CHEN_Pos)) /* Assigment of value for CHEN in the LCDC_HEOCHER register */
#define LCDC_HEOCHER_UPDATEEN_Pos             _UINT32_(1)                                          /* (LCDC_HEOCHER) Update Overlay Attributes Enable Position */
#define LCDC_HEOCHER_UPDATEEN_Msk             (_UINT32_(0x1) << LCDC_HEOCHER_UPDATEEN_Pos)         /* (LCDC_HEOCHER) Update Overlay Attributes Enable Mask */
#define LCDC_HEOCHER_UPDATEEN(value)          (LCDC_HEOCHER_UPDATEEN_Msk & (_UINT32_(value) << LCDC_HEOCHER_UPDATEEN_Pos)) /* Assigment of value for UPDATEEN in the LCDC_HEOCHER register */
#define LCDC_HEOCHER_A2QEN_Pos                _UINT32_(2)                                          /* (LCDC_HEOCHER) Add To Queue Enable Position */
#define LCDC_HEOCHER_A2QEN_Msk                (_UINT32_(0x1) << LCDC_HEOCHER_A2QEN_Pos)            /* (LCDC_HEOCHER) Add To Queue Enable Mask */
#define LCDC_HEOCHER_A2QEN(value)             (LCDC_HEOCHER_A2QEN_Msk & (_UINT32_(value) << LCDC_HEOCHER_A2QEN_Pos)) /* Assigment of value for A2QEN in the LCDC_HEOCHER register */
#define LCDC_HEOCHER_Msk                      _UINT32_(0x00000007)                                 /* (LCDC_HEOCHER) Register Mask  */


/* -------- LCDC_HEOCHDR : (LCDC Offset: 0x344) ( /W 32) High-End Overlay Channel Disable Register -------- */
#define LCDC_HEOCHDR_CHDIS_Pos                _UINT32_(0)                                          /* (LCDC_HEOCHDR) Channel Disable Position */
#define LCDC_HEOCHDR_CHDIS_Msk                (_UINT32_(0x1) << LCDC_HEOCHDR_CHDIS_Pos)            /* (LCDC_HEOCHDR) Channel Disable Mask */
#define LCDC_HEOCHDR_CHDIS(value)             (LCDC_HEOCHDR_CHDIS_Msk & (_UINT32_(value) << LCDC_HEOCHDR_CHDIS_Pos)) /* Assigment of value for CHDIS in the LCDC_HEOCHDR register */
#define LCDC_HEOCHDR_CHRST_Pos                _UINT32_(8)                                          /* (LCDC_HEOCHDR) Channel Reset Position */
#define LCDC_HEOCHDR_CHRST_Msk                (_UINT32_(0x1) << LCDC_HEOCHDR_CHRST_Pos)            /* (LCDC_HEOCHDR) Channel Reset Mask */
#define LCDC_HEOCHDR_CHRST(value)             (LCDC_HEOCHDR_CHRST_Msk & (_UINT32_(value) << LCDC_HEOCHDR_CHRST_Pos)) /* Assigment of value for CHRST in the LCDC_HEOCHDR register */
#define LCDC_HEOCHDR_Msk                      _UINT32_(0x00000101)                                 /* (LCDC_HEOCHDR) Register Mask  */


/* -------- LCDC_HEOCHSR : (LCDC Offset: 0x348) ( R/ 32) High-End Overlay Channel Status Register -------- */
#define LCDC_HEOCHSR_CHSR_Pos                 _UINT32_(0)                                          /* (LCDC_HEOCHSR) Channel Status Position */
#define LCDC_HEOCHSR_CHSR_Msk                 (_UINT32_(0x1) << LCDC_HEOCHSR_CHSR_Pos)             /* (LCDC_HEOCHSR) Channel Status Mask */
#define LCDC_HEOCHSR_CHSR(value)              (LCDC_HEOCHSR_CHSR_Msk & (_UINT32_(value) << LCDC_HEOCHSR_CHSR_Pos)) /* Assigment of value for CHSR in the LCDC_HEOCHSR register */
#define LCDC_HEOCHSR_UPDATESR_Pos             _UINT32_(1)                                          /* (LCDC_HEOCHSR) Update Overlay Attributes In Progress Status Position */
#define LCDC_HEOCHSR_UPDATESR_Msk             (_UINT32_(0x1) << LCDC_HEOCHSR_UPDATESR_Pos)         /* (LCDC_HEOCHSR) Update Overlay Attributes In Progress Status Mask */
#define LCDC_HEOCHSR_UPDATESR(value)          (LCDC_HEOCHSR_UPDATESR_Msk & (_UINT32_(value) << LCDC_HEOCHSR_UPDATESR_Pos)) /* Assigment of value for UPDATESR in the LCDC_HEOCHSR register */
#define LCDC_HEOCHSR_A2QSR_Pos                _UINT32_(2)                                          /* (LCDC_HEOCHSR) Add To Queue Status Position */
#define LCDC_HEOCHSR_A2QSR_Msk                (_UINT32_(0x1) << LCDC_HEOCHSR_A2QSR_Pos)            /* (LCDC_HEOCHSR) Add To Queue Status Mask */
#define LCDC_HEOCHSR_A2QSR(value)             (LCDC_HEOCHSR_A2QSR_Msk & (_UINT32_(value) << LCDC_HEOCHSR_A2QSR_Pos)) /* Assigment of value for A2QSR in the LCDC_HEOCHSR register */
#define LCDC_HEOCHSR_Msk                      _UINT32_(0x00000007)                                 /* (LCDC_HEOCHSR) Register Mask  */


/* -------- LCDC_HEOIER : (LCDC Offset: 0x34C) ( /W 32) High-End Overlay Interrupt Enable Register -------- */
#define LCDC_HEOIER_DMA_Pos                   _UINT32_(2)                                          /* (LCDC_HEOIER) End of DMA Transfer Interrupt Enable Position */
#define LCDC_HEOIER_DMA_Msk                   (_UINT32_(0x1) << LCDC_HEOIER_DMA_Pos)               /* (LCDC_HEOIER) End of DMA Transfer Interrupt Enable Mask */
#define LCDC_HEOIER_DMA(value)                (LCDC_HEOIER_DMA_Msk & (_UINT32_(value) << LCDC_HEOIER_DMA_Pos)) /* Assigment of value for DMA in the LCDC_HEOIER register */
#define LCDC_HEOIER_DSCR_Pos                  _UINT32_(3)                                          /* (LCDC_HEOIER) Descriptor Loaded Interrupt Enable Position */
#define LCDC_HEOIER_DSCR_Msk                  (_UINT32_(0x1) << LCDC_HEOIER_DSCR_Pos)              /* (LCDC_HEOIER) Descriptor Loaded Interrupt Enable Mask */
#define LCDC_HEOIER_DSCR(value)               (LCDC_HEOIER_DSCR_Msk & (_UINT32_(value) << LCDC_HEOIER_DSCR_Pos)) /* Assigment of value for DSCR in the LCDC_HEOIER register */
#define LCDC_HEOIER_ADD_Pos                   _UINT32_(4)                                          /* (LCDC_HEOIER) Head Descriptor Loaded Interrupt Enable Position */
#define LCDC_HEOIER_ADD_Msk                   (_UINT32_(0x1) << LCDC_HEOIER_ADD_Pos)               /* (LCDC_HEOIER) Head Descriptor Loaded Interrupt Enable Mask */
#define LCDC_HEOIER_ADD(value)                (LCDC_HEOIER_ADD_Msk & (_UINT32_(value) << LCDC_HEOIER_ADD_Pos)) /* Assigment of value for ADD in the LCDC_HEOIER register */
#define LCDC_HEOIER_DONE_Pos                  _UINT32_(5)                                          /* (LCDC_HEOIER) End of List Interrupt Enable Position */
#define LCDC_HEOIER_DONE_Msk                  (_UINT32_(0x1) << LCDC_HEOIER_DONE_Pos)              /* (LCDC_HEOIER) End of List Interrupt Enable Mask */
#define LCDC_HEOIER_DONE(value)               (LCDC_HEOIER_DONE_Msk & (_UINT32_(value) << LCDC_HEOIER_DONE_Pos)) /* Assigment of value for DONE in the LCDC_HEOIER register */
#define LCDC_HEOIER_OVR_Pos                   _UINT32_(6)                                          /* (LCDC_HEOIER) Overflow Interrupt Enable Position */
#define LCDC_HEOIER_OVR_Msk                   (_UINT32_(0x1) << LCDC_HEOIER_OVR_Pos)               /* (LCDC_HEOIER) Overflow Interrupt Enable Mask */
#define LCDC_HEOIER_OVR(value)                (LCDC_HEOIER_OVR_Msk & (_UINT32_(value) << LCDC_HEOIER_OVR_Pos)) /* Assigment of value for OVR in the LCDC_HEOIER register */
#define LCDC_HEOIER_UDMA_Pos                  _UINT32_(10)                                         /* (LCDC_HEOIER) End of DMA Transfer for U or UV Chrominance Interrupt Enable Position */
#define LCDC_HEOIER_UDMA_Msk                  (_UINT32_(0x1) << LCDC_HEOIER_UDMA_Pos)              /* (LCDC_HEOIER) End of DMA Transfer for U or UV Chrominance Interrupt Enable Mask */
#define LCDC_HEOIER_UDMA(value)               (LCDC_HEOIER_UDMA_Msk & (_UINT32_(value) << LCDC_HEOIER_UDMA_Pos)) /* Assigment of value for UDMA in the LCDC_HEOIER register */
#define LCDC_HEOIER_UDSCR_Pos                 _UINT32_(11)                                         /* (LCDC_HEOIER) Descriptor Loaded for U or UV Chrominance Interrupt Enable Position */
#define LCDC_HEOIER_UDSCR_Msk                 (_UINT32_(0x1) << LCDC_HEOIER_UDSCR_Pos)             /* (LCDC_HEOIER) Descriptor Loaded for U or UV Chrominance Interrupt Enable Mask */
#define LCDC_HEOIER_UDSCR(value)              (LCDC_HEOIER_UDSCR_Msk & (_UINT32_(value) << LCDC_HEOIER_UDSCR_Pos)) /* Assigment of value for UDSCR in the LCDC_HEOIER register */
#define LCDC_HEOIER_UADD_Pos                  _UINT32_(12)                                         /* (LCDC_HEOIER) Head Descriptor Loaded for U or UV Chrominance Interrupt Enable Position */
#define LCDC_HEOIER_UADD_Msk                  (_UINT32_(0x1) << LCDC_HEOIER_UADD_Pos)              /* (LCDC_HEOIER) Head Descriptor Loaded for U or UV Chrominance Interrupt Enable Mask */
#define LCDC_HEOIER_UADD(value)               (LCDC_HEOIER_UADD_Msk & (_UINT32_(value) << LCDC_HEOIER_UADD_Pos)) /* Assigment of value for UADD in the LCDC_HEOIER register */
#define LCDC_HEOIER_UDONE_Pos                 _UINT32_(13)                                         /* (LCDC_HEOIER) End of List for U or UV Chrominance Interrupt Enable Position */
#define LCDC_HEOIER_UDONE_Msk                 (_UINT32_(0x1) << LCDC_HEOIER_UDONE_Pos)             /* (LCDC_HEOIER) End of List for U or UV Chrominance Interrupt Enable Mask */
#define LCDC_HEOIER_UDONE(value)              (LCDC_HEOIER_UDONE_Msk & (_UINT32_(value) << LCDC_HEOIER_UDONE_Pos)) /* Assigment of value for UDONE in the LCDC_HEOIER register */
#define LCDC_HEOIER_UOVR_Pos                  _UINT32_(14)                                         /* (LCDC_HEOIER) Overflow for U or UV Chrominance Interrupt Enable Position */
#define LCDC_HEOIER_UOVR_Msk                  (_UINT32_(0x1) << LCDC_HEOIER_UOVR_Pos)              /* (LCDC_HEOIER) Overflow for U or UV Chrominance Interrupt Enable Mask */
#define LCDC_HEOIER_UOVR(value)               (LCDC_HEOIER_UOVR_Msk & (_UINT32_(value) << LCDC_HEOIER_UOVR_Pos)) /* Assigment of value for UOVR in the LCDC_HEOIER register */
#define LCDC_HEOIER_VDMA_Pos                  _UINT32_(18)                                         /* (LCDC_HEOIER) End of DMA for V Chrominance Transfer Interrupt Enable Position */
#define LCDC_HEOIER_VDMA_Msk                  (_UINT32_(0x1) << LCDC_HEOIER_VDMA_Pos)              /* (LCDC_HEOIER) End of DMA for V Chrominance Transfer Interrupt Enable Mask */
#define LCDC_HEOIER_VDMA(value)               (LCDC_HEOIER_VDMA_Msk & (_UINT32_(value) << LCDC_HEOIER_VDMA_Pos)) /* Assigment of value for VDMA in the LCDC_HEOIER register */
#define LCDC_HEOIER_VDSCR_Pos                 _UINT32_(19)                                         /* (LCDC_HEOIER) Descriptor Loaded for V Chrominance Interrupt Enable Position */
#define LCDC_HEOIER_VDSCR_Msk                 (_UINT32_(0x1) << LCDC_HEOIER_VDSCR_Pos)             /* (LCDC_HEOIER) Descriptor Loaded for V Chrominance Interrupt Enable Mask */
#define LCDC_HEOIER_VDSCR(value)              (LCDC_HEOIER_VDSCR_Msk & (_UINT32_(value) << LCDC_HEOIER_VDSCR_Pos)) /* Assigment of value for VDSCR in the LCDC_HEOIER register */
#define LCDC_HEOIER_VADD_Pos                  _UINT32_(20)                                         /* (LCDC_HEOIER) Head Descriptor Loaded for V Chrominance Interrupt Enable Position */
#define LCDC_HEOIER_VADD_Msk                  (_UINT32_(0x1) << LCDC_HEOIER_VADD_Pos)              /* (LCDC_HEOIER) Head Descriptor Loaded for V Chrominance Interrupt Enable Mask */
#define LCDC_HEOIER_VADD(value)               (LCDC_HEOIER_VADD_Msk & (_UINT32_(value) << LCDC_HEOIER_VADD_Pos)) /* Assigment of value for VADD in the LCDC_HEOIER register */
#define LCDC_HEOIER_VDONE_Pos                 _UINT32_(21)                                         /* (LCDC_HEOIER) End of List for V Chrominance Interrupt Enable Position */
#define LCDC_HEOIER_VDONE_Msk                 (_UINT32_(0x1) << LCDC_HEOIER_VDONE_Pos)             /* (LCDC_HEOIER) End of List for V Chrominance Interrupt Enable Mask */
#define LCDC_HEOIER_VDONE(value)              (LCDC_HEOIER_VDONE_Msk & (_UINT32_(value) << LCDC_HEOIER_VDONE_Pos)) /* Assigment of value for VDONE in the LCDC_HEOIER register */
#define LCDC_HEOIER_VOVR_Pos                  _UINT32_(22)                                         /* (LCDC_HEOIER) Overflow for V Chrominance Interrupt Enable Position */
#define LCDC_HEOIER_VOVR_Msk                  (_UINT32_(0x1) << LCDC_HEOIER_VOVR_Pos)              /* (LCDC_HEOIER) Overflow for V Chrominance Interrupt Enable Mask */
#define LCDC_HEOIER_VOVR(value)               (LCDC_HEOIER_VOVR_Msk & (_UINT32_(value) << LCDC_HEOIER_VOVR_Pos)) /* Assigment of value for VOVR in the LCDC_HEOIER register */
#define LCDC_HEOIER_Msk                       _UINT32_(0x007C7C7C)                                 /* (LCDC_HEOIER) Register Mask  */


