Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/test_app/firmware/src/packs/ATSAMA5D29_DFP/component/lcdc.h
/* -------- LCDC_HEOHEAD : (LCDC Offset: 0x35C) (R/W 32) High-End Overlay DMA Head Register -------- */
#define LCDC_HEOHEAD_HEAD_Pos                 _UINT32_(2)                                          /* (LCDC_HEOHEAD) DMA Head Pointer Position */
#define LCDC_HEOHEAD_HEAD_Msk                 (_UINT32_(0x3FFFFFFF) << LCDC_HEOHEAD_HEAD_Pos)      /* (LCDC_HEOHEAD) DMA Head Pointer Mask */
#define LCDC_HEOHEAD_HEAD(value)              (LCDC_HEOHEAD_HEAD_Msk & (_UINT32_(value) << LCDC_HEOHEAD_HEAD_Pos)) /* Assigment of value for HEAD in the LCDC_HEOHEAD register */
#define LCDC_HEOHEAD_Msk                      _UINT32_(0xFFFFFFFC)                                 /* (LCDC_HEOHEAD) Register Mask  */


/* -------- LCDC_HEOADDR : (LCDC Offset: 0x360) (R/W 32) High-End Overlay DMA Address Register -------- */
#define LCDC_HEOADDR_ADDR_Pos                 _UINT32_(0)                                          /* (LCDC_HEOADDR) DMA Transfer Start Address Position */
#define LCDC_HEOADDR_ADDR_Msk                 (_UINT32_(0xFFFFFFFF) << LCDC_HEOADDR_ADDR_Pos)      /* (LCDC_HEOADDR) DMA Transfer Start Address Mask */
#define LCDC_HEOADDR_ADDR(value)              (LCDC_HEOADDR_ADDR_Msk & (_UINT32_(value) << LCDC_HEOADDR_ADDR_Pos)) /* Assigment of value for ADDR in the LCDC_HEOADDR register */
#define LCDC_HEOADDR_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (LCDC_HEOADDR) Register Mask  */


/* -------- LCDC_HEOCTRL : (LCDC Offset: 0x364) (R/W 32) High-End Overlay DMA Control Register -------- */
#define LCDC_HEOCTRL_DFETCH_Pos               _UINT32_(0)                                          /* (LCDC_HEOCTRL) Transfer Descriptor Fetch Enable Position */
#define LCDC_HEOCTRL_DFETCH_Msk               (_UINT32_(0x1) << LCDC_HEOCTRL_DFETCH_Pos)           /* (LCDC_HEOCTRL) Transfer Descriptor Fetch Enable Mask */
#define LCDC_HEOCTRL_DFETCH(value)            (LCDC_HEOCTRL_DFETCH_Msk & (_UINT32_(value) << LCDC_HEOCTRL_DFETCH_Pos)) /* Assigment of value for DFETCH in the LCDC_HEOCTRL register */
#define LCDC_HEOCTRL_LFETCH_Pos               _UINT32_(1)                                          /* (LCDC_HEOCTRL) Lookup Table Fetch Enable Position */
#define LCDC_HEOCTRL_LFETCH_Msk               (_UINT32_(0x1) << LCDC_HEOCTRL_LFETCH_Pos)           /* (LCDC_HEOCTRL) Lookup Table Fetch Enable Mask */
#define LCDC_HEOCTRL_LFETCH(value)            (LCDC_HEOCTRL_LFETCH_Msk & (_UINT32_(value) << LCDC_HEOCTRL_LFETCH_Pos)) /* Assigment of value for LFETCH in the LCDC_HEOCTRL register */
#define LCDC_HEOCTRL_DMAIEN_Pos               _UINT32_(2)                                          /* (LCDC_HEOCTRL) End of DMA Transfer Interrupt Enable Position */
#define LCDC_HEOCTRL_DMAIEN_Msk               (_UINT32_(0x1) << LCDC_HEOCTRL_DMAIEN_Pos)           /* (LCDC_HEOCTRL) End of DMA Transfer Interrupt Enable Mask */
#define LCDC_HEOCTRL_DMAIEN(value)            (LCDC_HEOCTRL_DMAIEN_Msk & (_UINT32_(value) << LCDC_HEOCTRL_DMAIEN_Pos)) /* Assigment of value for DMAIEN in the LCDC_HEOCTRL register */
#define LCDC_HEOCTRL_DSCRIEN_Pos              _UINT32_(3)                                          /* (LCDC_HEOCTRL) Descriptor Loaded Interrupt Enable Position */
#define LCDC_HEOCTRL_DSCRIEN_Msk              (_UINT32_(0x1) << LCDC_HEOCTRL_DSCRIEN_Pos)          /* (LCDC_HEOCTRL) Descriptor Loaded Interrupt Enable Mask */
#define LCDC_HEOCTRL_DSCRIEN(value)           (LCDC_HEOCTRL_DSCRIEN_Msk & (_UINT32_(value) << LCDC_HEOCTRL_DSCRIEN_Pos)) /* Assigment of value for DSCRIEN in the LCDC_HEOCTRL register */
#define LCDC_HEOCTRL_ADDIEN_Pos               _UINT32_(4)                                          /* (LCDC_HEOCTRL) Add Head Descriptor to Queue Interrupt Enable Position */
#define LCDC_HEOCTRL_ADDIEN_Msk               (_UINT32_(0x1) << LCDC_HEOCTRL_ADDIEN_Pos)           /* (LCDC_HEOCTRL) Add Head Descriptor to Queue Interrupt Enable Mask */
#define LCDC_HEOCTRL_ADDIEN(value)            (LCDC_HEOCTRL_ADDIEN_Msk & (_UINT32_(value) << LCDC_HEOCTRL_ADDIEN_Pos)) /* Assigment of value for ADDIEN in the LCDC_HEOCTRL register */
#define LCDC_HEOCTRL_DONEIEN_Pos              _UINT32_(5)                                          /* (LCDC_HEOCTRL) End of List Interrupt Enable Position */
#define LCDC_HEOCTRL_DONEIEN_Msk              (_UINT32_(0x1) << LCDC_HEOCTRL_DONEIEN_Pos)          /* (LCDC_HEOCTRL) End of List Interrupt Enable Mask */
#define LCDC_HEOCTRL_DONEIEN(value)           (LCDC_HEOCTRL_DONEIEN_Msk & (_UINT32_(value) << LCDC_HEOCTRL_DONEIEN_Pos)) /* Assigment of value for DONEIEN in the LCDC_HEOCTRL register */
#define LCDC_HEOCTRL_Msk                      _UINT32_(0x0000003F)                                 /* (LCDC_HEOCTRL) Register Mask  */


/* -------- LCDC_HEONEXT : (LCDC Offset: 0x368) (R/W 32) High-End Overlay DMA Next Register -------- */
#define LCDC_HEONEXT_NEXT_Pos                 _UINT32_(0)                                          /* (LCDC_HEONEXT) DMA Descriptor Next Address Position */
#define LCDC_HEONEXT_NEXT_Msk                 (_UINT32_(0xFFFFFFFF) << LCDC_HEONEXT_NEXT_Pos)      /* (LCDC_HEONEXT) DMA Descriptor Next Address Mask */
#define LCDC_HEONEXT_NEXT(value)              (LCDC_HEONEXT_NEXT_Msk & (_UINT32_(value) << LCDC_HEONEXT_NEXT_Pos)) /* Assigment of value for NEXT in the LCDC_HEONEXT register */
#define LCDC_HEONEXT_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (LCDC_HEONEXT) Register Mask  */


/* -------- LCDC_HEOUHEAD : (LCDC Offset: 0x36C) (R/W 32) High-End Overlay U-UV DMA Head Register -------- */
#define LCDC_HEOUHEAD_UHEAD_Pos               _UINT32_(0)                                          /* (LCDC_HEOUHEAD) DMA Head Pointer Position */
#define LCDC_HEOUHEAD_UHEAD_Msk               (_UINT32_(0xFFFFFFFF) << LCDC_HEOUHEAD_UHEAD_Pos)    /* (LCDC_HEOUHEAD) DMA Head Pointer Mask */
#define LCDC_HEOUHEAD_UHEAD(value)            (LCDC_HEOUHEAD_UHEAD_Msk & (_UINT32_(value) << LCDC_HEOUHEAD_UHEAD_Pos)) /* Assigment of value for UHEAD in the LCDC_HEOUHEAD register */
#define LCDC_HEOUHEAD_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (LCDC_HEOUHEAD) Register Mask  */


