Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/test_app/firmware/src/packs/ATSAMA5D29_DFP/component/lcdc.h
/* -------- LCDC_HEOCFG1 : (LCDC Offset: 0x390) (R/W 32) High-End Overlay Configuration Register 1 -------- */
#define LCDC_HEOCFG1_CLUTEN_Pos               _UINT32_(0)                                          /* (LCDC_HEOCFG1) Color Lookup Table Mode Enable Position */
#define LCDC_HEOCFG1_CLUTEN_Msk               (_UINT32_(0x1) << LCDC_HEOCFG1_CLUTEN_Pos)           /* (LCDC_HEOCFG1) Color Lookup Table Mode Enable Mask */
#define LCDC_HEOCFG1_CLUTEN(value)            (LCDC_HEOCFG1_CLUTEN_Msk & (_UINT32_(value) << LCDC_HEOCFG1_CLUTEN_Pos)) /* Assigment of value for CLUTEN in the LCDC_HEOCFG1 register */
#define LCDC_HEOCFG1_YUVEN_Pos                _UINT32_(1)                                          /* (LCDC_HEOCFG1) YUV Color Space Enable Position */
#define LCDC_HEOCFG1_YUVEN_Msk                (_UINT32_(0x1) << LCDC_HEOCFG1_YUVEN_Pos)            /* (LCDC_HEOCFG1) YUV Color Space Enable Mask */
#define LCDC_HEOCFG1_YUVEN(value)             (LCDC_HEOCFG1_YUVEN_Msk & (_UINT32_(value) << LCDC_HEOCFG1_YUVEN_Pos)) /* Assigment of value for YUVEN in the LCDC_HEOCFG1 register */
#define LCDC_HEOCFG1_RGBMODE_Pos              _UINT32_(4)                                          /* (LCDC_HEOCFG1) RGB Mode Input Selection Position */
#define LCDC_HEOCFG1_RGBMODE_Msk              (_UINT32_(0xF) << LCDC_HEOCFG1_RGBMODE_Pos)          /* (LCDC_HEOCFG1) RGB Mode Input Selection Mask */
#define LCDC_HEOCFG1_RGBMODE(value)           (LCDC_HEOCFG1_RGBMODE_Msk & (_UINT32_(value) << LCDC_HEOCFG1_RGBMODE_Pos)) /* Assigment of value for RGBMODE in the LCDC_HEOCFG1 register */
#define   LCDC_HEOCFG1_RGBMODE_12BPP_RGB_444_Val _UINT32_(0x0)                                        /* (LCDC_HEOCFG1) 12 bpp RGB 444  */
#define   LCDC_HEOCFG1_RGBMODE_16BPP_ARGB_4444_Val _UINT32_(0x1)                                        /* (LCDC_HEOCFG1) 16 bpp ARGB 4444  */
#define   LCDC_HEOCFG1_RGBMODE_16BPP_RGBA_4444_Val _UINT32_(0x2)                                        /* (LCDC_HEOCFG1) 16 bpp RGBA 4444  */
#define   LCDC_HEOCFG1_RGBMODE_16BPP_RGB_565_Val _UINT32_(0x3)                                        /* (LCDC_HEOCFG1) 16 bpp RGB 565  */
#define   LCDC_HEOCFG1_RGBMODE_16BPP_TRGB_1555_Val _UINT32_(0x4)                                        /* (LCDC_HEOCFG1) 16 bpp TRGB 1555  */
#define   LCDC_HEOCFG1_RGBMODE_18BPP_RGB_666_Val _UINT32_(0x5)                                        /* (LCDC_HEOCFG1) 18 bpp RGB 666  */
#define   LCDC_HEOCFG1_RGBMODE_18BPP_RGB_666PACKED_Val _UINT32_(0x6)                                        /* (LCDC_HEOCFG1) 18 bpp RGB 666 PACKED  */
#define   LCDC_HEOCFG1_RGBMODE_19BPP_TRGB_1666_Val _UINT32_(0x7)                                        /* (LCDC_HEOCFG1) 19 bpp TRGB 1666  */
#define   LCDC_HEOCFG1_RGBMODE_19BPP_TRGB_PACKED_Val _UINT32_(0x8)                                        /* (LCDC_HEOCFG1) 19 bpp TRGB 1666 PACKED  */
#define   LCDC_HEOCFG1_RGBMODE_24BPP_RGB_888_Val _UINT32_(0x9)                                        /* (LCDC_HEOCFG1) 24 bpp RGB 888  */
#define   LCDC_HEOCFG1_RGBMODE_24BPP_RGB_888_PACKED_Val _UINT32_(0xA)                                        /* (LCDC_HEOCFG1) 24 bpp RGB 888 PACKED  */
#define   LCDC_HEOCFG1_RGBMODE_25BPP_TRGB_1888_Val _UINT32_(0xB)                                        /* (LCDC_HEOCFG1) 25 bpp TRGB 1888  */
#define   LCDC_HEOCFG1_RGBMODE_32BPP_ARGB_8888_Val _UINT32_(0xC)                                        /* (LCDC_HEOCFG1) 32 bpp ARGB 8888  */
#define   LCDC_HEOCFG1_RGBMODE_32BPP_RGBA_8888_Val _UINT32_(0xD)                                        /* (LCDC_HEOCFG1) 32 bpp RGBA 8888  */
#define LCDC_HEOCFG1_RGBMODE_12BPP_RGB_444    (LCDC_HEOCFG1_RGBMODE_12BPP_RGB_444_Val << LCDC_HEOCFG1_RGBMODE_Pos) /* (LCDC_HEOCFG1) 12 bpp RGB 444 Position  */
#define LCDC_HEOCFG1_RGBMODE_16BPP_ARGB_4444  (LCDC_HEOCFG1_RGBMODE_16BPP_ARGB_4444_Val << LCDC_HEOCFG1_RGBMODE_Pos) /* (LCDC_HEOCFG1) 16 bpp ARGB 4444 Position  */
#define LCDC_HEOCFG1_RGBMODE_16BPP_RGBA_4444  (LCDC_HEOCFG1_RGBMODE_16BPP_RGBA_4444_Val << LCDC_HEOCFG1_RGBMODE_Pos) /* (LCDC_HEOCFG1) 16 bpp RGBA 4444 Position  */
#define LCDC_HEOCFG1_RGBMODE_16BPP_RGB_565    (LCDC_HEOCFG1_RGBMODE_16BPP_RGB_565_Val << LCDC_HEOCFG1_RGBMODE_Pos) /* (LCDC_HEOCFG1) 16 bpp RGB 565 Position  */
#define LCDC_HEOCFG1_RGBMODE_16BPP_TRGB_1555  (LCDC_HEOCFG1_RGBMODE_16BPP_TRGB_1555_Val << LCDC_HEOCFG1_RGBMODE_Pos) /* (LCDC_HEOCFG1) 16 bpp TRGB 1555 Position  */
#define LCDC_HEOCFG1_RGBMODE_18BPP_RGB_666    (LCDC_HEOCFG1_RGBMODE_18BPP_RGB_666_Val << LCDC_HEOCFG1_RGBMODE_Pos) /* (LCDC_HEOCFG1) 18 bpp RGB 666 Position  */
#define LCDC_HEOCFG1_RGBMODE_18BPP_RGB_666PACKED (LCDC_HEOCFG1_RGBMODE_18BPP_RGB_666PACKED_Val << LCDC_HEOCFG1_RGBMODE_Pos) /* (LCDC_HEOCFG1) 18 bpp RGB 666 PACKED Position  */
#define LCDC_HEOCFG1_RGBMODE_19BPP_TRGB_1666  (LCDC_HEOCFG1_RGBMODE_19BPP_TRGB_1666_Val << LCDC_HEOCFG1_RGBMODE_Pos) /* (LCDC_HEOCFG1) 19 bpp TRGB 1666 Position  */
#define LCDC_HEOCFG1_RGBMODE_19BPP_TRGB_PACKED (LCDC_HEOCFG1_RGBMODE_19BPP_TRGB_PACKED_Val << LCDC_HEOCFG1_RGBMODE_Pos) /* (LCDC_HEOCFG1) 19 bpp TRGB 1666 PACKED Position  */
#define LCDC_HEOCFG1_RGBMODE_24BPP_RGB_888    (LCDC_HEOCFG1_RGBMODE_24BPP_RGB_888_Val << LCDC_HEOCFG1_RGBMODE_Pos) /* (LCDC_HEOCFG1) 24 bpp RGB 888 Position  */
#define LCDC_HEOCFG1_RGBMODE_24BPP_RGB_888_PACKED (LCDC_HEOCFG1_RGBMODE_24BPP_RGB_888_PACKED_Val << LCDC_HEOCFG1_RGBMODE_Pos) /* (LCDC_HEOCFG1) 24 bpp RGB 888 PACKED Position  */
#define LCDC_HEOCFG1_RGBMODE_25BPP_TRGB_1888  (LCDC_HEOCFG1_RGBMODE_25BPP_TRGB_1888_Val << LCDC_HEOCFG1_RGBMODE_Pos) /* (LCDC_HEOCFG1) 25 bpp TRGB 1888 Position  */
#define LCDC_HEOCFG1_RGBMODE_32BPP_ARGB_8888  (LCDC_HEOCFG1_RGBMODE_32BPP_ARGB_8888_Val << LCDC_HEOCFG1_RGBMODE_Pos) /* (LCDC_HEOCFG1) 32 bpp ARGB 8888 Position  */
#define LCDC_HEOCFG1_RGBMODE_32BPP_RGBA_8888  (LCDC_HEOCFG1_RGBMODE_32BPP_RGBA_8888_Val << LCDC_HEOCFG1_RGBMODE_Pos) /* (LCDC_HEOCFG1) 32 bpp RGBA 8888 Position  */
#define LCDC_HEOCFG1_CLUTMODE_Pos             _UINT32_(8)                                          /* (LCDC_HEOCFG1) Color Lookup Table Mode Input Selection Position */
#define LCDC_HEOCFG1_CLUTMODE_Msk             (_UINT32_(0x3) << LCDC_HEOCFG1_CLUTMODE_Pos)         /* (LCDC_HEOCFG1) Color Lookup Table Mode Input Selection Mask */
#define LCDC_HEOCFG1_CLUTMODE(value)          (LCDC_HEOCFG1_CLUTMODE_Msk & (_UINT32_(value) << LCDC_HEOCFG1_CLUTMODE_Pos)) /* Assigment of value for CLUTMODE in the LCDC_HEOCFG1 register */
#define   LCDC_HEOCFG1_CLUTMODE_CLUT_1BPP_Val _UINT32_(0x0)                                        /* (LCDC_HEOCFG1) Color Lookup Table mode set to 1 bit per pixel  */
#define   LCDC_HEOCFG1_CLUTMODE_CLUT_2BPP_Val _UINT32_(0x1)                                        /* (LCDC_HEOCFG1) Color Lookup Table mode set to 2 bits per pixel  */
#define   LCDC_HEOCFG1_CLUTMODE_CLUT_4BPP_Val _UINT32_(0x2)                                        /* (LCDC_HEOCFG1) Color Lookup Table mode set to 4 bits per pixel  */
#define   LCDC_HEOCFG1_CLUTMODE_CLUT_8BPP_Val _UINT32_(0x3)                                        /* (LCDC_HEOCFG1) Color Lookup Table mode set to 8 bits per pixel  */
#define LCDC_HEOCFG1_CLUTMODE_CLUT_1BPP       (LCDC_HEOCFG1_CLUTMODE_CLUT_1BPP_Val << LCDC_HEOCFG1_CLUTMODE_Pos) /* (LCDC_HEOCFG1) Color Lookup Table mode set to 1 bit per pixel Position  */
#define LCDC_HEOCFG1_CLUTMODE_CLUT_2BPP       (LCDC_HEOCFG1_CLUTMODE_CLUT_2BPP_Val << LCDC_HEOCFG1_CLUTMODE_Pos) /* (LCDC_HEOCFG1) Color Lookup Table mode set to 2 bits per pixel Position  */
#define LCDC_HEOCFG1_CLUTMODE_CLUT_4BPP       (LCDC_HEOCFG1_CLUTMODE_CLUT_4BPP_Val << LCDC_HEOCFG1_CLUTMODE_Pos) /* (LCDC_HEOCFG1) Color Lookup Table mode set to 4 bits per pixel Position  */
#define LCDC_HEOCFG1_CLUTMODE_CLUT_8BPP       (LCDC_HEOCFG1_CLUTMODE_CLUT_8BPP_Val << LCDC_HEOCFG1_CLUTMODE_Pos) /* (LCDC_HEOCFG1) Color Lookup Table mode set to 8 bits per pixel Position  */
#define LCDC_HEOCFG1_YUVMODE_Pos              _UINT32_(12)                                         /* (LCDC_HEOCFG1) YUV Mode Input Selection Position */
#define LCDC_HEOCFG1_YUVMODE_Msk              (_UINT32_(0xF) << LCDC_HEOCFG1_YUVMODE_Pos)          /* (LCDC_HEOCFG1) YUV Mode Input Selection Mask */
#define LCDC_HEOCFG1_YUVMODE(value)           (LCDC_HEOCFG1_YUVMODE_Msk & (_UINT32_(value) << LCDC_HEOCFG1_YUVMODE_Pos)) /* Assigment of value for YUVMODE in the LCDC_HEOCFG1 register */
#define LCDC_HEOCFG1_YUV422ROT_Pos            _UINT32_(16)                                         /* (LCDC_HEOCFG1) YUV 4:2:2 Rotation Position */
#define LCDC_HEOCFG1_YUV422ROT_Msk            (_UINT32_(0x1) << LCDC_HEOCFG1_YUV422ROT_Pos)        /* (LCDC_HEOCFG1) YUV 4:2:2 Rotation Mask */
#define LCDC_HEOCFG1_YUV422ROT(value)         (LCDC_HEOCFG1_YUV422ROT_Msk & (_UINT32_(value) << LCDC_HEOCFG1_YUV422ROT_Pos)) /* Assigment of value for YUV422ROT in the LCDC_HEOCFG1 register */
#define LCDC_HEOCFG1_YUV422SWP_Pos            _UINT32_(17)                                         /* (LCDC_HEOCFG1) YUV 4:2:2 Swap Position */
#define LCDC_HEOCFG1_YUV422SWP_Msk            (_UINT32_(0x1) << LCDC_HEOCFG1_YUV422SWP_Pos)        /* (LCDC_HEOCFG1) YUV 4:2:2 Swap Mask */
#define LCDC_HEOCFG1_YUV422SWP(value)         (LCDC_HEOCFG1_YUV422SWP_Msk & (_UINT32_(value) << LCDC_HEOCFG1_YUV422SWP_Pos)) /* Assigment of value for YUV422SWP in the LCDC_HEOCFG1 register */
#define LCDC_HEOCFG1_DSCALEOPT_Pos            _UINT32_(20)                                         /* (LCDC_HEOCFG1) Down Scaling Bandwidth Optimization Position */
#define LCDC_HEOCFG1_DSCALEOPT_Msk            (_UINT32_(0x1) << LCDC_HEOCFG1_DSCALEOPT_Pos)        /* (LCDC_HEOCFG1) Down Scaling Bandwidth Optimization Mask */
#define LCDC_HEOCFG1_DSCALEOPT(value)         (LCDC_HEOCFG1_DSCALEOPT_Msk & (_UINT32_(value) << LCDC_HEOCFG1_DSCALEOPT_Pos)) /* Assigment of value for DSCALEOPT in the LCDC_HEOCFG1 register */
#define LCDC_HEOCFG1_Msk                      _UINT32_(0x0013F3F3)                                 /* (LCDC_HEOCFG1) Register Mask  */


/* -------- LCDC_HEOCFG2 : (LCDC Offset: 0x394) (R/W 32) High-End Overlay Configuration Register 2 -------- */
#define LCDC_HEOCFG2_XPOS_Pos                 _UINT32_(0)                                          /* (LCDC_HEOCFG2) Horizontal Window Position Position */
#define LCDC_HEOCFG2_XPOS_Msk                 (_UINT32_(0x7FF) << LCDC_HEOCFG2_XPOS_Pos)           /* (LCDC_HEOCFG2) Horizontal Window Position Mask */
#define LCDC_HEOCFG2_XPOS(value)              (LCDC_HEOCFG2_XPOS_Msk & (_UINT32_(value) << LCDC_HEOCFG2_XPOS_Pos)) /* Assigment of value for XPOS in the LCDC_HEOCFG2 register */
#define LCDC_HEOCFG2_YPOS_Pos                 _UINT32_(16)                                         /* (LCDC_HEOCFG2) Vertical Window Position Position */
#define LCDC_HEOCFG2_YPOS_Msk                 (_UINT32_(0x7FF) << LCDC_HEOCFG2_YPOS_Pos)           /* (LCDC_HEOCFG2) Vertical Window Position Mask */
#define LCDC_HEOCFG2_YPOS(value)              (LCDC_HEOCFG2_YPOS_Msk & (_UINT32_(value) << LCDC_HEOCFG2_YPOS_Pos)) /* Assigment of value for YPOS in the LCDC_HEOCFG2 register */
#define LCDC_HEOCFG2_Msk                      _UINT32_(0x07FF07FF)                                 /* (LCDC_HEOCFG2) Register Mask  */


/* -------- LCDC_HEOCFG3 : (LCDC Offset: 0x398) (R/W 32) High-End Overlay Configuration Register 3 -------- */
#define LCDC_HEOCFG3_XSIZE_Pos                _UINT32_(0)                                          /* (LCDC_HEOCFG3) Horizontal Window Size Position */
#define LCDC_HEOCFG3_XSIZE_Msk                (_UINT32_(0x7FF) << LCDC_HEOCFG3_XSIZE_Pos)          /* (LCDC_HEOCFG3) Horizontal Window Size Mask */
#define LCDC_HEOCFG3_XSIZE(value)             (LCDC_HEOCFG3_XSIZE_Msk & (_UINT32_(value) << LCDC_HEOCFG3_XSIZE_Pos)) /* Assigment of value for XSIZE in the LCDC_HEOCFG3 register */
#define LCDC_HEOCFG3_YSIZE_Pos                _UINT32_(16)                                         /* (LCDC_HEOCFG3) Vertical Window Size Position */
#define LCDC_HEOCFG3_YSIZE_Msk                (_UINT32_(0x7FF) << LCDC_HEOCFG3_YSIZE_Pos)          /* (LCDC_HEOCFG3) Vertical Window Size Mask */
#define LCDC_HEOCFG3_YSIZE(value)             (LCDC_HEOCFG3_YSIZE_Msk & (_UINT32_(value) << LCDC_HEOCFG3_YSIZE_Pos)) /* Assigment of value for YSIZE in the LCDC_HEOCFG3 register */
#define LCDC_HEOCFG3_Msk                      _UINT32_(0x07FF07FF)                                 /* (LCDC_HEOCFG3) Register Mask  */


/* -------- LCDC_HEOCFG4 : (LCDC Offset: 0x39C) (R/W 32) High-End Overlay Configuration Register 4 -------- */
#define LCDC_HEOCFG4_XMEMSIZE_Pos             _UINT32_(0)                                          /* (LCDC_HEOCFG4) Horizontal image Size in Memory Position */
#define LCDC_HEOCFG4_XMEMSIZE_Msk             (_UINT32_(0x7FF) << LCDC_HEOCFG4_XMEMSIZE_Pos)       /* (LCDC_HEOCFG4) Horizontal image Size in Memory Mask */
#define LCDC_HEOCFG4_XMEMSIZE(value)          (LCDC_HEOCFG4_XMEMSIZE_Msk & (_UINT32_(value) << LCDC_HEOCFG4_XMEMSIZE_Pos)) /* Assigment of value for XMEMSIZE in the LCDC_HEOCFG4 register */
#define LCDC_HEOCFG4_YMEMSIZE_Pos             _UINT32_(16)                                         /* (LCDC_HEOCFG4) Vertical image Size in Memory Position */
#define LCDC_HEOCFG4_YMEMSIZE_Msk             (_UINT32_(0x7FF) << LCDC_HEOCFG4_YMEMSIZE_Pos)       /* (LCDC_HEOCFG4) Vertical image Size in Memory Mask */
#define LCDC_HEOCFG4_YMEMSIZE(value)          (LCDC_HEOCFG4_YMEMSIZE_Msk & (_UINT32_(value) << LCDC_HEOCFG4_YMEMSIZE_Pos)) /* Assigment of value for YMEMSIZE in the LCDC_HEOCFG4 register */
#define LCDC_HEOCFG4_Msk                      _UINT32_(0x07FF07FF)                                 /* (LCDC_HEOCFG4) Register Mask  */


/* -------- LCDC_HEOCFG5 : (LCDC Offset: 0x3A0) (R/W 32) High-End Overlay Configuration Register 5 -------- */
#define LCDC_HEOCFG5_XSTRIDE_Pos              _UINT32_(0)                                          /* (LCDC_HEOCFG5) Horizontal Stride Position */
#define LCDC_HEOCFG5_XSTRIDE_Msk              (_UINT32_(0xFFFFFFFF) << LCDC_HEOCFG5_XSTRIDE_Pos)   /* (LCDC_HEOCFG5) Horizontal Stride Mask */
#define LCDC_HEOCFG5_XSTRIDE(value)           (LCDC_HEOCFG5_XSTRIDE_Msk & (_UINT32_(value) << LCDC_HEOCFG5_XSTRIDE_Pos)) /* Assigment of value for XSTRIDE in the LCDC_HEOCFG5 register */
#define LCDC_HEOCFG5_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (LCDC_HEOCFG5) Register Mask  */


/* -------- LCDC_HEOCFG6 : (LCDC Offset: 0x3A4) (R/W 32) High-End Overlay Configuration Register 6 -------- */
#define LCDC_HEOCFG6_PSTRIDE_Pos              _UINT32_(0)                                          /* (LCDC_HEOCFG6) Pixel Stride Position */
#define LCDC_HEOCFG6_PSTRIDE_Msk              (_UINT32_(0xFFFFFFFF) << LCDC_HEOCFG6_PSTRIDE_Pos)   /* (LCDC_HEOCFG6) Pixel Stride Mask */
#define LCDC_HEOCFG6_PSTRIDE(value)           (LCDC_HEOCFG6_PSTRIDE_Msk & (_UINT32_(value) << LCDC_HEOCFG6_PSTRIDE_Pos)) /* Assigment of value for PSTRIDE in the LCDC_HEOCFG6 register */
#define LCDC_HEOCFG6_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (LCDC_HEOCFG6) Register Mask  */


/* -------- LCDC_HEOCFG7 : (LCDC Offset: 0x3A8) (R/W 32) High-End Overlay Configuration Register 7 -------- */
#define LCDC_HEOCFG7_UVXSTRIDE_Pos            _UINT32_(0)                                          /* (LCDC_HEOCFG7) UV Horizontal Stride Position */
#define LCDC_HEOCFG7_UVXSTRIDE_Msk            (_UINT32_(0xFFFFFFFF) << LCDC_HEOCFG7_UVXSTRIDE_Pos) /* (LCDC_HEOCFG7) UV Horizontal Stride Mask */
#define LCDC_HEOCFG7_UVXSTRIDE(value)         (LCDC_HEOCFG7_UVXSTRIDE_Msk & (_UINT32_(value) << LCDC_HEOCFG7_UVXSTRIDE_Pos)) /* Assigment of value for UVXSTRIDE in the LCDC_HEOCFG7 register */
#define LCDC_HEOCFG7_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (LCDC_HEOCFG7) Register Mask  */


