Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/test_app/firmware/src/packs/ATSAMA5D29_DFP/component/lcdc.h
/* -------- LCDC_HEOCFG8 : (LCDC Offset: 0x3AC) (R/W 32) High-End Overlay Configuration Register 8 -------- */
#define LCDC_HEOCFG8_UVPSTRIDE_Pos            _UINT32_(0)                                          /* (LCDC_HEOCFG8) UV Pixel Stride Position */
#define LCDC_HEOCFG8_UVPSTRIDE_Msk            (_UINT32_(0xFFFFFFFF) << LCDC_HEOCFG8_UVPSTRIDE_Pos) /* (LCDC_HEOCFG8) UV Pixel Stride Mask */
#define LCDC_HEOCFG8_UVPSTRIDE(value)         (LCDC_HEOCFG8_UVPSTRIDE_Msk & (_UINT32_(value) << LCDC_HEOCFG8_UVPSTRIDE_Pos)) /* Assigment of value for UVPSTRIDE in the LCDC_HEOCFG8 register */
#define LCDC_HEOCFG8_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (LCDC_HEOCFG8) Register Mask  */


/* -------- LCDC_HEOCFG9 : (LCDC Offset: 0x3B0) (R/W 32) High-End Overlay Configuration Register 9 -------- */
#define LCDC_HEOCFG9_BDEF_Pos                 _UINT32_(0)                                          /* (LCDC_HEOCFG9) Blue Default Position */
#define LCDC_HEOCFG9_BDEF_Msk                 (_UINT32_(0xFF) << LCDC_HEOCFG9_BDEF_Pos)            /* (LCDC_HEOCFG9) Blue Default Mask */
#define LCDC_HEOCFG9_BDEF(value)              (LCDC_HEOCFG9_BDEF_Msk & (_UINT32_(value) << LCDC_HEOCFG9_BDEF_Pos)) /* Assigment of value for BDEF in the LCDC_HEOCFG9 register */
#define LCDC_HEOCFG9_GDEF_Pos                 _UINT32_(8)                                          /* (LCDC_HEOCFG9) Green Default Position */
#define LCDC_HEOCFG9_GDEF_Msk                 (_UINT32_(0xFF) << LCDC_HEOCFG9_GDEF_Pos)            /* (LCDC_HEOCFG9) Green Default Mask */
#define LCDC_HEOCFG9_GDEF(value)              (LCDC_HEOCFG9_GDEF_Msk & (_UINT32_(value) << LCDC_HEOCFG9_GDEF_Pos)) /* Assigment of value for GDEF in the LCDC_HEOCFG9 register */
#define LCDC_HEOCFG9_RDEF_Pos                 _UINT32_(16)                                         /* (LCDC_HEOCFG9) Red Default Position */
#define LCDC_HEOCFG9_RDEF_Msk                 (_UINT32_(0xFF) << LCDC_HEOCFG9_RDEF_Pos)            /* (LCDC_HEOCFG9) Red Default Mask */
#define LCDC_HEOCFG9_RDEF(value)              (LCDC_HEOCFG9_RDEF_Msk & (_UINT32_(value) << LCDC_HEOCFG9_RDEF_Pos)) /* Assigment of value for RDEF in the LCDC_HEOCFG9 register */
#define LCDC_HEOCFG9_Msk                      _UINT32_(0x00FFFFFF)                                 /* (LCDC_HEOCFG9) Register Mask  */


/* -------- LCDC_HEOCFG10 : (LCDC Offset: 0x3B4) (R/W 32) High-End Overlay Configuration Register 10 -------- */
#define LCDC_HEOCFG10_BKEY_Pos                _UINT32_(0)                                          /* (LCDC_HEOCFG10) Blue Color Component Chroma Key Position */
#define LCDC_HEOCFG10_BKEY_Msk                (_UINT32_(0xFF) << LCDC_HEOCFG10_BKEY_Pos)           /* (LCDC_HEOCFG10) Blue Color Component Chroma Key Mask */
#define LCDC_HEOCFG10_BKEY(value)             (LCDC_HEOCFG10_BKEY_Msk & (_UINT32_(value) << LCDC_HEOCFG10_BKEY_Pos)) /* Assigment of value for BKEY in the LCDC_HEOCFG10 register */
#define LCDC_HEOCFG10_GKEY_Pos                _UINT32_(8)                                          /* (LCDC_HEOCFG10) Green Color Component Chroma Key Position */
#define LCDC_HEOCFG10_GKEY_Msk                (_UINT32_(0xFF) << LCDC_HEOCFG10_GKEY_Pos)           /* (LCDC_HEOCFG10) Green Color Component Chroma Key Mask */
#define LCDC_HEOCFG10_GKEY(value)             (LCDC_HEOCFG10_GKEY_Msk & (_UINT32_(value) << LCDC_HEOCFG10_GKEY_Pos)) /* Assigment of value for GKEY in the LCDC_HEOCFG10 register */
#define LCDC_HEOCFG10_RKEY_Pos                _UINT32_(16)                                         /* (LCDC_HEOCFG10) Red Color Component Chroma Key Position */
#define LCDC_HEOCFG10_RKEY_Msk                (_UINT32_(0xFF) << LCDC_HEOCFG10_RKEY_Pos)           /* (LCDC_HEOCFG10) Red Color Component Chroma Key Mask */
#define LCDC_HEOCFG10_RKEY(value)             (LCDC_HEOCFG10_RKEY_Msk & (_UINT32_(value) << LCDC_HEOCFG10_RKEY_Pos)) /* Assigment of value for RKEY in the LCDC_HEOCFG10 register */
#define LCDC_HEOCFG10_Msk                     _UINT32_(0x00FFFFFF)                                 /* (LCDC_HEOCFG10) Register Mask  */


/* -------- LCDC_HEOCFG11 : (LCDC Offset: 0x3B8) (R/W 32) High-End Overlay Configuration Register 11 -------- */
#define LCDC_HEOCFG11_BMASK_Pos               _UINT32_(0)                                          /* (LCDC_HEOCFG11) Blue Color Component Chroma Key Mask Position */
#define LCDC_HEOCFG11_BMASK_Msk               (_UINT32_(0xFF) << LCDC_HEOCFG11_BMASK_Pos)          /* (LCDC_HEOCFG11) Blue Color Component Chroma Key Mask Mask */
#define LCDC_HEOCFG11_BMASK(value)            (LCDC_HEOCFG11_BMASK_Msk & (_UINT32_(value) << LCDC_HEOCFG11_BMASK_Pos)) /* Assigment of value for BMASK in the LCDC_HEOCFG11 register */
#define LCDC_HEOCFG11_GMASK_Pos               _UINT32_(8)                                          /* (LCDC_HEOCFG11) Green Color Component Chroma Key Mask Position */
#define LCDC_HEOCFG11_GMASK_Msk               (_UINT32_(0xFF) << LCDC_HEOCFG11_GMASK_Pos)          /* (LCDC_HEOCFG11) Green Color Component Chroma Key Mask Mask */
#define LCDC_HEOCFG11_GMASK(value)            (LCDC_HEOCFG11_GMASK_Msk & (_UINT32_(value) << LCDC_HEOCFG11_GMASK_Pos)) /* Assigment of value for GMASK in the LCDC_HEOCFG11 register */
#define LCDC_HEOCFG11_RMASK_Pos               _UINT32_(16)                                         /* (LCDC_HEOCFG11) Red Color Component Chroma Key Mask Position */
#define LCDC_HEOCFG11_RMASK_Msk               (_UINT32_(0xFF) << LCDC_HEOCFG11_RMASK_Pos)          /* (LCDC_HEOCFG11) Red Color Component Chroma Key Mask Mask */
#define LCDC_HEOCFG11_RMASK(value)            (LCDC_HEOCFG11_RMASK_Msk & (_UINT32_(value) << LCDC_HEOCFG11_RMASK_Pos)) /* Assigment of value for RMASK in the LCDC_HEOCFG11 register */
#define LCDC_HEOCFG11_Msk                     _UINT32_(0x00FFFFFF)                                 /* (LCDC_HEOCFG11) Register Mask  */


/* -------- LCDC_HEOCFG12 : (LCDC Offset: 0x3BC) (R/W 32) High-End Overlay Configuration Register 12 -------- */
#define LCDC_HEOCFG12_CRKEY_Pos               _UINT32_(0)                                          /* (LCDC_HEOCFG12) Blender Chroma Key Enable Position */
#define LCDC_HEOCFG12_CRKEY_Msk               (_UINT32_(0x1) << LCDC_HEOCFG12_CRKEY_Pos)           /* (LCDC_HEOCFG12) Blender Chroma Key Enable Mask */
#define LCDC_HEOCFG12_CRKEY(value)            (LCDC_HEOCFG12_CRKEY_Msk & (_UINT32_(value) << LCDC_HEOCFG12_CRKEY_Pos)) /* Assigment of value for CRKEY in the LCDC_HEOCFG12 register */
#define LCDC_HEOCFG12_INV_Pos                 _UINT32_(1)                                          /* (LCDC_HEOCFG12) Blender Inverted Blender Output Enable Position */
#define LCDC_HEOCFG12_INV_Msk                 (_UINT32_(0x1) << LCDC_HEOCFG12_INV_Pos)             /* (LCDC_HEOCFG12) Blender Inverted Blender Output Enable Mask */
#define LCDC_HEOCFG12_INV(value)              (LCDC_HEOCFG12_INV_Msk & (_UINT32_(value) << LCDC_HEOCFG12_INV_Pos)) /* Assigment of value for INV in the LCDC_HEOCFG12 register */
#define LCDC_HEOCFG12_ITER2BL_Pos             _UINT32_(2)                                          /* (LCDC_HEOCFG12) Blender Iterated Color Enable Position */
#define LCDC_HEOCFG12_ITER2BL_Msk             (_UINT32_(0x1) << LCDC_HEOCFG12_ITER2BL_Pos)         /* (LCDC_HEOCFG12) Blender Iterated Color Enable Mask */
#define LCDC_HEOCFG12_ITER2BL(value)          (LCDC_HEOCFG12_ITER2BL_Msk & (_UINT32_(value) << LCDC_HEOCFG12_ITER2BL_Pos)) /* Assigment of value for ITER2BL in the LCDC_HEOCFG12 register */
#define LCDC_HEOCFG12_ITER_Pos                _UINT32_(3)                                          /* (LCDC_HEOCFG12) Blender Use Iterated Color Position */
#define LCDC_HEOCFG12_ITER_Msk                (_UINT32_(0x1) << LCDC_HEOCFG12_ITER_Pos)            /* (LCDC_HEOCFG12) Blender Use Iterated Color Mask */
#define LCDC_HEOCFG12_ITER(value)             (LCDC_HEOCFG12_ITER_Msk & (_UINT32_(value) << LCDC_HEOCFG12_ITER_Pos)) /* Assigment of value for ITER in the LCDC_HEOCFG12 register */
#define LCDC_HEOCFG12_REVALPHA_Pos            _UINT32_(4)                                          /* (LCDC_HEOCFG12) Blender Reverse Alpha Position */
#define LCDC_HEOCFG12_REVALPHA_Msk            (_UINT32_(0x1) << LCDC_HEOCFG12_REVALPHA_Pos)        /* (LCDC_HEOCFG12) Blender Reverse Alpha Mask */
#define LCDC_HEOCFG12_REVALPHA(value)         (LCDC_HEOCFG12_REVALPHA_Msk & (_UINT32_(value) << LCDC_HEOCFG12_REVALPHA_Pos)) /* Assigment of value for REVALPHA in the LCDC_HEOCFG12 register */
#define LCDC_HEOCFG12_GAEN_Pos                _UINT32_(5)                                          /* (LCDC_HEOCFG12) Blender Global Alpha Enable Position */
#define LCDC_HEOCFG12_GAEN_Msk                (_UINT32_(0x1) << LCDC_HEOCFG12_GAEN_Pos)            /* (LCDC_HEOCFG12) Blender Global Alpha Enable Mask */
#define LCDC_HEOCFG12_GAEN(value)             (LCDC_HEOCFG12_GAEN_Msk & (_UINT32_(value) << LCDC_HEOCFG12_GAEN_Pos)) /* Assigment of value for GAEN in the LCDC_HEOCFG12 register */
#define LCDC_HEOCFG12_LAEN_Pos                _UINT32_(6)                                          /* (LCDC_HEOCFG12) Blender Local Alpha Enable Position */
#define LCDC_HEOCFG12_LAEN_Msk                (_UINT32_(0x1) << LCDC_HEOCFG12_LAEN_Pos)            /* (LCDC_HEOCFG12) Blender Local Alpha Enable Mask */
#define LCDC_HEOCFG12_LAEN(value)             (LCDC_HEOCFG12_LAEN_Msk & (_UINT32_(value) << LCDC_HEOCFG12_LAEN_Pos)) /* Assigment of value for LAEN in the LCDC_HEOCFG12 register */
#define LCDC_HEOCFG12_OVR_Pos                 _UINT32_(7)                                          /* (LCDC_HEOCFG12) Blender Overlay Layer Enable Position */
#define LCDC_HEOCFG12_OVR_Msk                 (_UINT32_(0x1) << LCDC_HEOCFG12_OVR_Pos)             /* (LCDC_HEOCFG12) Blender Overlay Layer Enable Mask */
#define LCDC_HEOCFG12_OVR(value)              (LCDC_HEOCFG12_OVR_Msk & (_UINT32_(value) << LCDC_HEOCFG12_OVR_Pos)) /* Assigment of value for OVR in the LCDC_HEOCFG12 register */
#define LCDC_HEOCFG12_DMA_Pos                 _UINT32_(8)                                          /* (LCDC_HEOCFG12) Blender DMA Layer Enable Position */
#define LCDC_HEOCFG12_DMA_Msk                 (_UINT32_(0x1) << LCDC_HEOCFG12_DMA_Pos)             /* (LCDC_HEOCFG12) Blender DMA Layer Enable Mask */
#define LCDC_HEOCFG12_DMA(value)              (LCDC_HEOCFG12_DMA_Msk & (_UINT32_(value) << LCDC_HEOCFG12_DMA_Pos)) /* Assigment of value for DMA in the LCDC_HEOCFG12 register */
#define LCDC_HEOCFG12_REP_Pos                 _UINT32_(9)                                          /* (LCDC_HEOCFG12) Use Replication logic to expand RGB color to 24 bits Position */
#define LCDC_HEOCFG12_REP_Msk                 (_UINT32_(0x1) << LCDC_HEOCFG12_REP_Pos)             /* (LCDC_HEOCFG12) Use Replication logic to expand RGB color to 24 bits Mask */
#define LCDC_HEOCFG12_REP(value)              (LCDC_HEOCFG12_REP_Msk & (_UINT32_(value) << LCDC_HEOCFG12_REP_Pos)) /* Assigment of value for REP in the LCDC_HEOCFG12 register */
#define LCDC_HEOCFG12_DSTKEY_Pos              _UINT32_(10)                                         /* (LCDC_HEOCFG12) Destination Chroma Keying Position */
#define LCDC_HEOCFG12_DSTKEY_Msk              (_UINT32_(0x1) << LCDC_HEOCFG12_DSTKEY_Pos)          /* (LCDC_HEOCFG12) Destination Chroma Keying Mask */
#define LCDC_HEOCFG12_DSTKEY(value)           (LCDC_HEOCFG12_DSTKEY_Msk & (_UINT32_(value) << LCDC_HEOCFG12_DSTKEY_Pos)) /* Assigment of value for DSTKEY in the LCDC_HEOCFG12 register */
#define LCDC_HEOCFG12_VIDPRI_Pos              _UINT32_(12)                                         /* (LCDC_HEOCFG12) Video Priority Position */
#define LCDC_HEOCFG12_VIDPRI_Msk              (_UINT32_(0x1) << LCDC_HEOCFG12_VIDPRI_Pos)          /* (LCDC_HEOCFG12) Video Priority Mask */
#define LCDC_HEOCFG12_VIDPRI(value)           (LCDC_HEOCFG12_VIDPRI_Msk & (_UINT32_(value) << LCDC_HEOCFG12_VIDPRI_Pos)) /* Assigment of value for VIDPRI in the LCDC_HEOCFG12 register */
#define LCDC_HEOCFG12_GA_Pos                  _UINT32_(16)                                         /* (LCDC_HEOCFG12) Blender Global Alpha Position */
#define LCDC_HEOCFG12_GA_Msk                  (_UINT32_(0xFF) << LCDC_HEOCFG12_GA_Pos)             /* (LCDC_HEOCFG12) Blender Global Alpha Mask */
#define LCDC_HEOCFG12_GA(value)               (LCDC_HEOCFG12_GA_Msk & (_UINT32_(value) << LCDC_HEOCFG12_GA_Pos)) /* Assigment of value for GA in the LCDC_HEOCFG12 register */
#define LCDC_HEOCFG12_Msk                     _UINT32_(0x00FF17FF)                                 /* (LCDC_HEOCFG12) Register Mask  */


/* -------- LCDC_HEOCFG13 : (LCDC Offset: 0x3C0) (R/W 32) High-End Overlay Configuration Register 13 -------- */
#define LCDC_HEOCFG13_XFACTOR_Pos             _UINT32_(0)                                          /* (LCDC_HEOCFG13) Horizontal Scaling Factor Position */
#define LCDC_HEOCFG13_XFACTOR_Msk             (_UINT32_(0x3FFF) << LCDC_HEOCFG13_XFACTOR_Pos)      /* (LCDC_HEOCFG13) Horizontal Scaling Factor Mask */
#define LCDC_HEOCFG13_XFACTOR(value)          (LCDC_HEOCFG13_XFACTOR_Msk & (_UINT32_(value) << LCDC_HEOCFG13_XFACTOR_Pos)) /* Assigment of value for XFACTOR in the LCDC_HEOCFG13 register */
#define LCDC_HEOCFG13_YFACTOR_Pos             _UINT32_(16)                                         /* (LCDC_HEOCFG13) Vertical Scaling Factor Position */
#define LCDC_HEOCFG13_YFACTOR_Msk             (_UINT32_(0x3FFF) << LCDC_HEOCFG13_YFACTOR_Pos)      /* (LCDC_HEOCFG13) Vertical Scaling Factor Mask */
#define LCDC_HEOCFG13_YFACTOR(value)          (LCDC_HEOCFG13_YFACTOR_Msk & (_UINT32_(value) << LCDC_HEOCFG13_YFACTOR_Pos)) /* Assigment of value for YFACTOR in the LCDC_HEOCFG13 register */
#define LCDC_HEOCFG13_SCALEN_Pos              _UINT32_(31)                                         /* (LCDC_HEOCFG13) Hardware Scaler Enable Position */
#define LCDC_HEOCFG13_SCALEN_Msk              (_UINT32_(0x1) << LCDC_HEOCFG13_SCALEN_Pos)          /* (LCDC_HEOCFG13) Hardware Scaler Enable Mask */
#define LCDC_HEOCFG13_SCALEN(value)           (LCDC_HEOCFG13_SCALEN_Msk & (_UINT32_(value) << LCDC_HEOCFG13_SCALEN_Pos)) /* Assigment of value for SCALEN in the LCDC_HEOCFG13 register */
#define LCDC_HEOCFG13_Msk                     _UINT32_(0xBFFF3FFF)                                 /* (LCDC_HEOCFG13) Register Mask  */


/* -------- LCDC_HEOCFG14 : (LCDC Offset: 0x3C4) (R/W 32) High-End Overlay Configuration Register 14 -------- */
#define LCDC_HEOCFG14_CSCRY_Pos               _UINT32_(0)                                          /* (LCDC_HEOCFG14) Color Space Conversion Y coefficient for Red Component 1:2:7 format Position */
#define LCDC_HEOCFG14_CSCRY_Msk               (_UINT32_(0x3FF) << LCDC_HEOCFG14_CSCRY_Pos)         /* (LCDC_HEOCFG14) Color Space Conversion Y coefficient for Red Component 1:2:7 format Mask */
#define LCDC_HEOCFG14_CSCRY(value)            (LCDC_HEOCFG14_CSCRY_Msk & (_UINT32_(value) << LCDC_HEOCFG14_CSCRY_Pos)) /* Assigment of value for CSCRY in the LCDC_HEOCFG14 register */
#define LCDC_HEOCFG14_CSCRU_Pos               _UINT32_(10)                                         /* (LCDC_HEOCFG14) Color Space Conversion U coefficient for Red Component 1:2:7 format Position */
#define LCDC_HEOCFG14_CSCRU_Msk               (_UINT32_(0x3FF) << LCDC_HEOCFG14_CSCRU_Pos)         /* (LCDC_HEOCFG14) Color Space Conversion U coefficient for Red Component 1:2:7 format Mask */
#define LCDC_HEOCFG14_CSCRU(value)            (LCDC_HEOCFG14_CSCRU_Msk & (_UINT32_(value) << LCDC_HEOCFG14_CSCRU_Pos)) /* Assigment of value for CSCRU in the LCDC_HEOCFG14 register */
#define LCDC_HEOCFG14_CSCRV_Pos               _UINT32_(20)                                         /* (LCDC_HEOCFG14) Color Space Conversion V coefficient for Red Component 1:2:7 format Position */
#define LCDC_HEOCFG14_CSCRV_Msk               (_UINT32_(0x3FF) << LCDC_HEOCFG14_CSCRV_Pos)         /* (LCDC_HEOCFG14) Color Space Conversion V coefficient for Red Component 1:2:7 format Mask */
#define LCDC_HEOCFG14_CSCRV(value)            (LCDC_HEOCFG14_CSCRV_Msk & (_UINT32_(value) << LCDC_HEOCFG14_CSCRV_Pos)) /* Assigment of value for CSCRV in the LCDC_HEOCFG14 register */
#define LCDC_HEOCFG14_CSCYOFF_Pos             _UINT32_(30)                                         /* (LCDC_HEOCFG14) Color Space Conversion Offset Position */
#define LCDC_HEOCFG14_CSCYOFF_Msk             (_UINT32_(0x1) << LCDC_HEOCFG14_CSCYOFF_Pos)         /* (LCDC_HEOCFG14) Color Space Conversion Offset Mask */
#define LCDC_HEOCFG14_CSCYOFF(value)          (LCDC_HEOCFG14_CSCYOFF_Msk & (_UINT32_(value) << LCDC_HEOCFG14_CSCYOFF_Pos)) /* Assigment of value for CSCYOFF in the LCDC_HEOCFG14 register */
#define LCDC_HEOCFG14_Msk                     _UINT32_(0x7FFFFFFF)                                 /* (LCDC_HEOCFG14) Register Mask  */


/* -------- LCDC_HEOCFG15 : (LCDC Offset: 0x3C8) (R/W 32) High-End Overlay Configuration Register 15 -------- */
#define LCDC_HEOCFG15_CSCGY_Pos               _UINT32_(0)                                          /* (LCDC_HEOCFG15) Color Space Conversion Y coefficient for Green Component 1:2:7 format Position */
#define LCDC_HEOCFG15_CSCGY_Msk               (_UINT32_(0x3FF) << LCDC_HEOCFG15_CSCGY_Pos)         /* (LCDC_HEOCFG15) Color Space Conversion Y coefficient for Green Component 1:2:7 format Mask */
#define LCDC_HEOCFG15_CSCGY(value)            (LCDC_HEOCFG15_CSCGY_Msk & (_UINT32_(value) << LCDC_HEOCFG15_CSCGY_Pos)) /* Assigment of value for CSCGY in the LCDC_HEOCFG15 register */
#define LCDC_HEOCFG15_CSCGU_Pos               _UINT32_(10)                                         /* (LCDC_HEOCFG15) Color Space Conversion U coefficient for Green Component 1:2:7 format Position */
#define LCDC_HEOCFG15_CSCGU_Msk               (_UINT32_(0x3FF) << LCDC_HEOCFG15_CSCGU_Pos)         /* (LCDC_HEOCFG15) Color Space Conversion U coefficient for Green Component 1:2:7 format Mask */
#define LCDC_HEOCFG15_CSCGU(value)            (LCDC_HEOCFG15_CSCGU_Msk & (_UINT32_(value) << LCDC_HEOCFG15_CSCGU_Pos)) /* Assigment of value for CSCGU in the LCDC_HEOCFG15 register */
#define LCDC_HEOCFG15_CSCGV_Pos               _UINT32_(20)                                         /* (LCDC_HEOCFG15) Color Space Conversion V coefficient for Green Component 1:2:7 format Position */
#define LCDC_HEOCFG15_CSCGV_Msk               (_UINT32_(0x3FF) << LCDC_HEOCFG15_CSCGV_Pos)         /* (LCDC_HEOCFG15) Color Space Conversion V coefficient for Green Component 1:2:7 format Mask */
#define LCDC_HEOCFG15_CSCGV(value)            (LCDC_HEOCFG15_CSCGV_Msk & (_UINT32_(value) << LCDC_HEOCFG15_CSCGV_Pos)) /* Assigment of value for CSCGV in the LCDC_HEOCFG15 register */
#define LCDC_HEOCFG15_CSCUOFF_Pos             _UINT32_(30)                                         /* (LCDC_HEOCFG15) Color Space Conversion Offset Position */
#define LCDC_HEOCFG15_CSCUOFF_Msk             (_UINT32_(0x1) << LCDC_HEOCFG15_CSCUOFF_Pos)         /* (LCDC_HEOCFG15) Color Space Conversion Offset Mask */
#define LCDC_HEOCFG15_CSCUOFF(value)          (LCDC_HEOCFG15_CSCUOFF_Msk & (_UINT32_(value) << LCDC_HEOCFG15_CSCUOFF_Pos)) /* Assigment of value for CSCUOFF in the LCDC_HEOCFG15 register */
#define LCDC_HEOCFG15_Msk                     _UINT32_(0x7FFFFFFF)                                 /* (LCDC_HEOCFG15) Register Mask  */


/* -------- LCDC_HEOCFG16 : (LCDC Offset: 0x3CC) (R/W 32) High-End Overlay Configuration Register 16 -------- */
#define LCDC_HEOCFG16_CSCBY_Pos               _UINT32_(0)                                          /* (LCDC_HEOCFG16) Color Space Conversion Y coefficient for Blue Component 1:2:7 format Position */
#define LCDC_HEOCFG16_CSCBY_Msk               (_UINT32_(0x3FF) << LCDC_HEOCFG16_CSCBY_Pos)         /* (LCDC_HEOCFG16) Color Space Conversion Y coefficient for Blue Component 1:2:7 format Mask */
#define LCDC_HEOCFG16_CSCBY(value)            (LCDC_HEOCFG16_CSCBY_Msk & (_UINT32_(value) << LCDC_HEOCFG16_CSCBY_Pos)) /* Assigment of value for CSCBY in the LCDC_HEOCFG16 register */
#define LCDC_HEOCFG16_CSCBU_Pos               _UINT32_(10)                                         /* (LCDC_HEOCFG16) Color Space Conversion U coefficient for Blue Component 1:2:7 format Position */
#define LCDC_HEOCFG16_CSCBU_Msk               (_UINT32_(0x3FF) << LCDC_HEOCFG16_CSCBU_Pos)         /* (LCDC_HEOCFG16) Color Space Conversion U coefficient for Blue Component 1:2:7 format Mask */
#define LCDC_HEOCFG16_CSCBU(value)            (LCDC_HEOCFG16_CSCBU_Msk & (_UINT32_(value) << LCDC_HEOCFG16_CSCBU_Pos)) /* Assigment of value for CSCBU in the LCDC_HEOCFG16 register */
#define LCDC_HEOCFG16_CSCBV_Pos               _UINT32_(20)                                         /* (LCDC_HEOCFG16) Color Space Conversion V coefficient for Blue Component 1:2:7 format Position */
#define LCDC_HEOCFG16_CSCBV_Msk               (_UINT32_(0x3FF) << LCDC_HEOCFG16_CSCBV_Pos)         /* (LCDC_HEOCFG16) Color Space Conversion V coefficient for Blue Component 1:2:7 format Mask */
#define LCDC_HEOCFG16_CSCBV(value)            (LCDC_HEOCFG16_CSCBV_Msk & (_UINT32_(value) << LCDC_HEOCFG16_CSCBV_Pos)) /* Assigment of value for CSCBV in the LCDC_HEOCFG16 register */
#define LCDC_HEOCFG16_CSCVOFF_Pos             _UINT32_(30)                                         /* (LCDC_HEOCFG16) Color Space Conversion Offset Position */
#define LCDC_HEOCFG16_CSCVOFF_Msk             (_UINT32_(0x1) << LCDC_HEOCFG16_CSCVOFF_Pos)         /* (LCDC_HEOCFG16) Color Space Conversion Offset Mask */
#define LCDC_HEOCFG16_CSCVOFF(value)          (LCDC_HEOCFG16_CSCVOFF_Msk & (_UINT32_(value) << LCDC_HEOCFG16_CSCVOFF_Pos)) /* Assigment of value for CSCVOFF in the LCDC_HEOCFG16 register */
#define LCDC_HEOCFG16_Msk                     _UINT32_(0x7FFFFFFF)                                 /* (LCDC_HEOCFG16) Register Mask  */


