Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/test_app/firmware/src/packs/ATSAMA5D29_DFP/component/lcdc.h
/* -------- LCDC_HEOCFG17 : (LCDC Offset: 0x3D0) (R/W 32) High-End Overlay Configuration Register 17 -------- */
#define LCDC_HEOCFG17_XPHI0COEFF0_Pos         _UINT32_(0)                                          /* (LCDC_HEOCFG17) Horizontal Coefficient for phase 0 tap 0 Position */
#define LCDC_HEOCFG17_XPHI0COEFF0_Msk         (_UINT32_(0xFF) << LCDC_HEOCFG17_XPHI0COEFF0_Pos)    /* (LCDC_HEOCFG17) Horizontal Coefficient for phase 0 tap 0 Mask */
#define LCDC_HEOCFG17_XPHI0COEFF0(value)      (LCDC_HEOCFG17_XPHI0COEFF0_Msk & (_UINT32_(value) << LCDC_HEOCFG17_XPHI0COEFF0_Pos)) /* Assigment of value for XPHI0COEFF0 in the LCDC_HEOCFG17 register */
#define LCDC_HEOCFG17_XPHI0COEFF1_Pos         _UINT32_(8)                                          /* (LCDC_HEOCFG17) Horizontal Coefficient for phase 0 tap 1 Position */
#define LCDC_HEOCFG17_XPHI0COEFF1_Msk         (_UINT32_(0xFF) << LCDC_HEOCFG17_XPHI0COEFF1_Pos)    /* (LCDC_HEOCFG17) Horizontal Coefficient for phase 0 tap 1 Mask */
#define LCDC_HEOCFG17_XPHI0COEFF1(value)      (LCDC_HEOCFG17_XPHI0COEFF1_Msk & (_UINT32_(value) << LCDC_HEOCFG17_XPHI0COEFF1_Pos)) /* Assigment of value for XPHI0COEFF1 in the LCDC_HEOCFG17 register */
#define LCDC_HEOCFG17_XPHI0COEFF2_Pos         _UINT32_(16)                                         /* (LCDC_HEOCFG17) Horizontal Coefficient for phase 0 tap 2 Position */
#define LCDC_HEOCFG17_XPHI0COEFF2_Msk         (_UINT32_(0xFF) << LCDC_HEOCFG17_XPHI0COEFF2_Pos)    /* (LCDC_HEOCFG17) Horizontal Coefficient for phase 0 tap 2 Mask */
#define LCDC_HEOCFG17_XPHI0COEFF2(value)      (LCDC_HEOCFG17_XPHI0COEFF2_Msk & (_UINT32_(value) << LCDC_HEOCFG17_XPHI0COEFF2_Pos)) /* Assigment of value for XPHI0COEFF2 in the LCDC_HEOCFG17 register */
#define LCDC_HEOCFG17_XPHI0COEFF3_Pos         _UINT32_(24)                                         /* (LCDC_HEOCFG17) Horizontal Coefficient for phase 0 tap 3 Position */
#define LCDC_HEOCFG17_XPHI0COEFF3_Msk         (_UINT32_(0xFF) << LCDC_HEOCFG17_XPHI0COEFF3_Pos)    /* (LCDC_HEOCFG17) Horizontal Coefficient for phase 0 tap 3 Mask */
#define LCDC_HEOCFG17_XPHI0COEFF3(value)      (LCDC_HEOCFG17_XPHI0COEFF3_Msk & (_UINT32_(value) << LCDC_HEOCFG17_XPHI0COEFF3_Pos)) /* Assigment of value for XPHI0COEFF3 in the LCDC_HEOCFG17 register */
#define LCDC_HEOCFG17_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (LCDC_HEOCFG17) Register Mask  */


/* -------- LCDC_HEOCFG18 : (LCDC Offset: 0x3D4) (R/W 32) High-End Overlay Configuration Register 18 -------- */
#define LCDC_HEOCFG18_XPHI0COEFF4_Pos         _UINT32_(0)                                          /* (LCDC_HEOCFG18) Horizontal Coefficient for phase 0 tap 4 Position */
#define LCDC_HEOCFG18_XPHI0COEFF4_Msk         (_UINT32_(0xFF) << LCDC_HEOCFG18_XPHI0COEFF4_Pos)    /* (LCDC_HEOCFG18) Horizontal Coefficient for phase 0 tap 4 Mask */
#define LCDC_HEOCFG18_XPHI0COEFF4(value)      (LCDC_HEOCFG18_XPHI0COEFF4_Msk & (_UINT32_(value) << LCDC_HEOCFG18_XPHI0COEFF4_Pos)) /* Assigment of value for XPHI0COEFF4 in the LCDC_HEOCFG18 register */
#define LCDC_HEOCFG18_Msk                     _UINT32_(0x000000FF)                                 /* (LCDC_HEOCFG18) Register Mask  */


/* -------- LCDC_HEOCFG19 : (LCDC Offset: 0x3D8) (R/W 32) High-End Overlay Configuration Register 19 -------- */
#define LCDC_HEOCFG19_XPHI1COEFF0_Pos         _UINT32_(0)                                          /* (LCDC_HEOCFG19) Horizontal Coefficient for phase 1 tap 0 Position */
#define LCDC_HEOCFG19_XPHI1COEFF0_Msk         (_UINT32_(0xFF) << LCDC_HEOCFG19_XPHI1COEFF0_Pos)    /* (LCDC_HEOCFG19) Horizontal Coefficient for phase 1 tap 0 Mask */
#define LCDC_HEOCFG19_XPHI1COEFF0(value)      (LCDC_HEOCFG19_XPHI1COEFF0_Msk & (_UINT32_(value) << LCDC_HEOCFG19_XPHI1COEFF0_Pos)) /* Assigment of value for XPHI1COEFF0 in the LCDC_HEOCFG19 register */
#define LCDC_HEOCFG19_XPHI1COEFF1_Pos         _UINT32_(8)                                          /* (LCDC_HEOCFG19) Horizontal Coefficient for phase 1 tap 1 Position */
#define LCDC_HEOCFG19_XPHI1COEFF1_Msk         (_UINT32_(0xFF) << LCDC_HEOCFG19_XPHI1COEFF1_Pos)    /* (LCDC_HEOCFG19) Horizontal Coefficient for phase 1 tap 1 Mask */
#define LCDC_HEOCFG19_XPHI1COEFF1(value)      (LCDC_HEOCFG19_XPHI1COEFF1_Msk & (_UINT32_(value) << LCDC_HEOCFG19_XPHI1COEFF1_Pos)) /* Assigment of value for XPHI1COEFF1 in the LCDC_HEOCFG19 register */
#define LCDC_HEOCFG19_XPHI1COEFF2_Pos         _UINT32_(16)                                         /* (LCDC_HEOCFG19) Horizontal Coefficient for phase 1 tap 2 Position */
#define LCDC_HEOCFG19_XPHI1COEFF2_Msk         (_UINT32_(0xFF) << LCDC_HEOCFG19_XPHI1COEFF2_Pos)    /* (LCDC_HEOCFG19) Horizontal Coefficient for phase 1 tap 2 Mask */
#define LCDC_HEOCFG19_XPHI1COEFF2(value)      (LCDC_HEOCFG19_XPHI1COEFF2_Msk & (_UINT32_(value) << LCDC_HEOCFG19_XPHI1COEFF2_Pos)) /* Assigment of value for XPHI1COEFF2 in the LCDC_HEOCFG19 register */
#define LCDC_HEOCFG19_XPHI1COEFF3_Pos         _UINT32_(24)                                         /* (LCDC_HEOCFG19) Horizontal Coefficient for phase 1 tap 3 Position */
#define LCDC_HEOCFG19_XPHI1COEFF3_Msk         (_UINT32_(0xFF) << LCDC_HEOCFG19_XPHI1COEFF3_Pos)    /* (LCDC_HEOCFG19) Horizontal Coefficient for phase 1 tap 3 Mask */
#define LCDC_HEOCFG19_XPHI1COEFF3(value)      (LCDC_HEOCFG19_XPHI1COEFF3_Msk & (_UINT32_(value) << LCDC_HEOCFG19_XPHI1COEFF3_Pos)) /* Assigment of value for XPHI1COEFF3 in the LCDC_HEOCFG19 register */
#define LCDC_HEOCFG19_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (LCDC_HEOCFG19) Register Mask  */


/* -------- LCDC_HEOCFG20 : (LCDC Offset: 0x3DC) (R/W 32) High-End Overlay Configuration Register 20 -------- */
#define LCDC_HEOCFG20_XPHI1COEFF4_Pos         _UINT32_(0)                                          /* (LCDC_HEOCFG20) Horizontal Coefficient for phase 1 tap 4 Position */
#define LCDC_HEOCFG20_XPHI1COEFF4_Msk         (_UINT32_(0xFF) << LCDC_HEOCFG20_XPHI1COEFF4_Pos)    /* (LCDC_HEOCFG20) Horizontal Coefficient for phase 1 tap 4 Mask */
#define LCDC_HEOCFG20_XPHI1COEFF4(value)      (LCDC_HEOCFG20_XPHI1COEFF4_Msk & (_UINT32_(value) << LCDC_HEOCFG20_XPHI1COEFF4_Pos)) /* Assigment of value for XPHI1COEFF4 in the LCDC_HEOCFG20 register */
#define LCDC_HEOCFG20_Msk                     _UINT32_(0x000000FF)                                 /* (LCDC_HEOCFG20) Register Mask  */


/* -------- LCDC_HEOCFG21 : (LCDC Offset: 0x3E0) (R/W 32) High-End Overlay Configuration Register 21 -------- */
#define LCDC_HEOCFG21_XPHI2COEFF0_Pos         _UINT32_(0)                                          /* (LCDC_HEOCFG21) Horizontal Coefficient for phase 2 tap 0 Position */
#define LCDC_HEOCFG21_XPHI2COEFF0_Msk         (_UINT32_(0xFF) << LCDC_HEOCFG21_XPHI2COEFF0_Pos)    /* (LCDC_HEOCFG21) Horizontal Coefficient for phase 2 tap 0 Mask */
#define LCDC_HEOCFG21_XPHI2COEFF0(value)      (LCDC_HEOCFG21_XPHI2COEFF0_Msk & (_UINT32_(value) << LCDC_HEOCFG21_XPHI2COEFF0_Pos)) /* Assigment of value for XPHI2COEFF0 in the LCDC_HEOCFG21 register */
#define LCDC_HEOCFG21_XPHI2COEFF1_Pos         _UINT32_(8)                                          /* (LCDC_HEOCFG21) Horizontal Coefficient for phase 2 tap 1 Position */
#define LCDC_HEOCFG21_XPHI2COEFF1_Msk         (_UINT32_(0xFF) << LCDC_HEOCFG21_XPHI2COEFF1_Pos)    /* (LCDC_HEOCFG21) Horizontal Coefficient for phase 2 tap 1 Mask */
#define LCDC_HEOCFG21_XPHI2COEFF1(value)      (LCDC_HEOCFG21_XPHI2COEFF1_Msk & (_UINT32_(value) << LCDC_HEOCFG21_XPHI2COEFF1_Pos)) /* Assigment of value for XPHI2COEFF1 in the LCDC_HEOCFG21 register */
#define LCDC_HEOCFG21_XPHI2COEFF2_Pos         _UINT32_(16)                                         /* (LCDC_HEOCFG21) Horizontal Coefficient for phase 2 tap 2 Position */
#define LCDC_HEOCFG21_XPHI2COEFF2_Msk         (_UINT32_(0xFF) << LCDC_HEOCFG21_XPHI2COEFF2_Pos)    /* (LCDC_HEOCFG21) Horizontal Coefficient for phase 2 tap 2 Mask */
#define LCDC_HEOCFG21_XPHI2COEFF2(value)      (LCDC_HEOCFG21_XPHI2COEFF2_Msk & (_UINT32_(value) << LCDC_HEOCFG21_XPHI2COEFF2_Pos)) /* Assigment of value for XPHI2COEFF2 in the LCDC_HEOCFG21 register */
#define LCDC_HEOCFG21_XPHI2COEFF3_Pos         _UINT32_(24)                                         /* (LCDC_HEOCFG21) Horizontal Coefficient for phase 2 tap 3 Position */
#define LCDC_HEOCFG21_XPHI2COEFF3_Msk         (_UINT32_(0xFF) << LCDC_HEOCFG21_XPHI2COEFF3_Pos)    /* (LCDC_HEOCFG21) Horizontal Coefficient for phase 2 tap 3 Mask */
#define LCDC_HEOCFG21_XPHI2COEFF3(value)      (LCDC_HEOCFG21_XPHI2COEFF3_Msk & (_UINT32_(value) << LCDC_HEOCFG21_XPHI2COEFF3_Pos)) /* Assigment of value for XPHI2COEFF3 in the LCDC_HEOCFG21 register */
#define LCDC_HEOCFG21_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (LCDC_HEOCFG21) Register Mask  */


/* -------- LCDC_HEOCFG22 : (LCDC Offset: 0x3E4) (R/W 32) High-End Overlay Configuration Register 22 -------- */
#define LCDC_HEOCFG22_XPHI2COEFF4_Pos         _UINT32_(0)                                          /* (LCDC_HEOCFG22) Horizontal Coefficient for phase 2 tap 4 Position */
#define LCDC_HEOCFG22_XPHI2COEFF4_Msk         (_UINT32_(0xFF) << LCDC_HEOCFG22_XPHI2COEFF4_Pos)    /* (LCDC_HEOCFG22) Horizontal Coefficient for phase 2 tap 4 Mask */
#define LCDC_HEOCFG22_XPHI2COEFF4(value)      (LCDC_HEOCFG22_XPHI2COEFF4_Msk & (_UINT32_(value) << LCDC_HEOCFG22_XPHI2COEFF4_Pos)) /* Assigment of value for XPHI2COEFF4 in the LCDC_HEOCFG22 register */
#define LCDC_HEOCFG22_Msk                     _UINT32_(0x000000FF)                                 /* (LCDC_HEOCFG22) Register Mask  */


