Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/test_app/firmware/src/packs/ATSAMA5D29_DFP/component/lcdc.h
/* -------- LCDC_HEOCFG23 : (LCDC Offset: 0x3E8) (R/W 32) High-End Overlay Configuration Register 23 -------- */
#define LCDC_HEOCFG23_XPHI3COEFF0_Pos         _UINT32_(0)                                          /* (LCDC_HEOCFG23) Horizontal Coefficient for phase 3 tap 0 Position */
#define LCDC_HEOCFG23_XPHI3COEFF0_Msk         (_UINT32_(0xFF) << LCDC_HEOCFG23_XPHI3COEFF0_Pos)    /* (LCDC_HEOCFG23) Horizontal Coefficient for phase 3 tap 0 Mask */
#define LCDC_HEOCFG23_XPHI3COEFF0(value)      (LCDC_HEOCFG23_XPHI3COEFF0_Msk & (_UINT32_(value) << LCDC_HEOCFG23_XPHI3COEFF0_Pos)) /* Assigment of value for XPHI3COEFF0 in the LCDC_HEOCFG23 register */
#define LCDC_HEOCFG23_XPHI3COEFF1_Pos         _UINT32_(8)                                          /* (LCDC_HEOCFG23) Horizontal Coefficient for phase 3 tap 1 Position */
#define LCDC_HEOCFG23_XPHI3COEFF1_Msk         (_UINT32_(0xFF) << LCDC_HEOCFG23_XPHI3COEFF1_Pos)    /* (LCDC_HEOCFG23) Horizontal Coefficient for phase 3 tap 1 Mask */
#define LCDC_HEOCFG23_XPHI3COEFF1(value)      (LCDC_HEOCFG23_XPHI3COEFF1_Msk & (_UINT32_(value) << LCDC_HEOCFG23_XPHI3COEFF1_Pos)) /* Assigment of value for XPHI3COEFF1 in the LCDC_HEOCFG23 register */
#define LCDC_HEOCFG23_XPHI3COEFF2_Pos         _UINT32_(16)                                         /* (LCDC_HEOCFG23) Horizontal Coefficient for phase 3 tap 2 Position */
#define LCDC_HEOCFG23_XPHI3COEFF2_Msk         (_UINT32_(0xFF) << LCDC_HEOCFG23_XPHI3COEFF2_Pos)    /* (LCDC_HEOCFG23) Horizontal Coefficient for phase 3 tap 2 Mask */
#define LCDC_HEOCFG23_XPHI3COEFF2(value)      (LCDC_HEOCFG23_XPHI3COEFF2_Msk & (_UINT32_(value) << LCDC_HEOCFG23_XPHI3COEFF2_Pos)) /* Assigment of value for XPHI3COEFF2 in the LCDC_HEOCFG23 register */
#define LCDC_HEOCFG23_XPHI3COEFF3_Pos         _UINT32_(24)                                         /* (LCDC_HEOCFG23) Horizontal Coefficient for phase 3 tap 3 Position */
#define LCDC_HEOCFG23_XPHI3COEFF3_Msk         (_UINT32_(0xFF) << LCDC_HEOCFG23_XPHI3COEFF3_Pos)    /* (LCDC_HEOCFG23) Horizontal Coefficient for phase 3 tap 3 Mask */
#define LCDC_HEOCFG23_XPHI3COEFF3(value)      (LCDC_HEOCFG23_XPHI3COEFF3_Msk & (_UINT32_(value) << LCDC_HEOCFG23_XPHI3COEFF3_Pos)) /* Assigment of value for XPHI3COEFF3 in the LCDC_HEOCFG23 register */
#define LCDC_HEOCFG23_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (LCDC_HEOCFG23) Register Mask  */


/* -------- LCDC_HEOCFG24 : (LCDC Offset: 0x3EC) (R/W 32) High-End Overlay Configuration Register 24 -------- */
#define LCDC_HEOCFG24_XPHI3COEFF4_Pos         _UINT32_(0)                                          /* (LCDC_HEOCFG24) Horizontal Coefficient for phase 3 tap 4 Position */
#define LCDC_HEOCFG24_XPHI3COEFF4_Msk         (_UINT32_(0xFF) << LCDC_HEOCFG24_XPHI3COEFF4_Pos)    /* (LCDC_HEOCFG24) Horizontal Coefficient for phase 3 tap 4 Mask */
#define LCDC_HEOCFG24_XPHI3COEFF4(value)      (LCDC_HEOCFG24_XPHI3COEFF4_Msk & (_UINT32_(value) << LCDC_HEOCFG24_XPHI3COEFF4_Pos)) /* Assigment of value for XPHI3COEFF4 in the LCDC_HEOCFG24 register */
#define LCDC_HEOCFG24_Msk                     _UINT32_(0x000000FF)                                 /* (LCDC_HEOCFG24) Register Mask  */


/* -------- LCDC_HEOCFG25 : (LCDC Offset: 0x3F0) (R/W 32) High-End Overlay Configuration Register 25 -------- */
#define LCDC_HEOCFG25_XPHI4COEFF0_Pos         _UINT32_(0)                                          /* (LCDC_HEOCFG25) Horizontal Coefficient for phase 4 tap 0 Position */
#define LCDC_HEOCFG25_XPHI4COEFF0_Msk         (_UINT32_(0xFF) << LCDC_HEOCFG25_XPHI4COEFF0_Pos)    /* (LCDC_HEOCFG25) Horizontal Coefficient for phase 4 tap 0 Mask */
#define LCDC_HEOCFG25_XPHI4COEFF0(value)      (LCDC_HEOCFG25_XPHI4COEFF0_Msk & (_UINT32_(value) << LCDC_HEOCFG25_XPHI4COEFF0_Pos)) /* Assigment of value for XPHI4COEFF0 in the LCDC_HEOCFG25 register */
#define LCDC_HEOCFG25_XPHI4COEFF1_Pos         _UINT32_(8)                                          /* (LCDC_HEOCFG25) Horizontal Coefficient for phase 4 tap 1 Position */
#define LCDC_HEOCFG25_XPHI4COEFF1_Msk         (_UINT32_(0xFF) << LCDC_HEOCFG25_XPHI4COEFF1_Pos)    /* (LCDC_HEOCFG25) Horizontal Coefficient for phase 4 tap 1 Mask */
#define LCDC_HEOCFG25_XPHI4COEFF1(value)      (LCDC_HEOCFG25_XPHI4COEFF1_Msk & (_UINT32_(value) << LCDC_HEOCFG25_XPHI4COEFF1_Pos)) /* Assigment of value for XPHI4COEFF1 in the LCDC_HEOCFG25 register */
#define LCDC_HEOCFG25_XPHI4COEFF2_Pos         _UINT32_(16)                                         /* (LCDC_HEOCFG25) Horizontal Coefficient for phase 4 tap 2 Position */
#define LCDC_HEOCFG25_XPHI4COEFF2_Msk         (_UINT32_(0xFF) << LCDC_HEOCFG25_XPHI4COEFF2_Pos)    /* (LCDC_HEOCFG25) Horizontal Coefficient for phase 4 tap 2 Mask */
#define LCDC_HEOCFG25_XPHI4COEFF2(value)      (LCDC_HEOCFG25_XPHI4COEFF2_Msk & (_UINT32_(value) << LCDC_HEOCFG25_XPHI4COEFF2_Pos)) /* Assigment of value for XPHI4COEFF2 in the LCDC_HEOCFG25 register */
#define LCDC_HEOCFG25_XPHI4COEFF3_Pos         _UINT32_(24)                                         /* (LCDC_HEOCFG25) Horizontal Coefficient for phase 4 tap 3 Position */
#define LCDC_HEOCFG25_XPHI4COEFF3_Msk         (_UINT32_(0xFF) << LCDC_HEOCFG25_XPHI4COEFF3_Pos)    /* (LCDC_HEOCFG25) Horizontal Coefficient for phase 4 tap 3 Mask */
#define LCDC_HEOCFG25_XPHI4COEFF3(value)      (LCDC_HEOCFG25_XPHI4COEFF3_Msk & (_UINT32_(value) << LCDC_HEOCFG25_XPHI4COEFF3_Pos)) /* Assigment of value for XPHI4COEFF3 in the LCDC_HEOCFG25 register */
#define LCDC_HEOCFG25_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (LCDC_HEOCFG25) Register Mask  */


/* -------- LCDC_HEOCFG26 : (LCDC Offset: 0x3F4) (R/W 32) High-End Overlay Configuration Register 26 -------- */
#define LCDC_HEOCFG26_XPHI4COEFF4_Pos         _UINT32_(0)                                          /* (LCDC_HEOCFG26) Horizontal Coefficient for phase 4 tap 4 Position */
#define LCDC_HEOCFG26_XPHI4COEFF4_Msk         (_UINT32_(0xFF) << LCDC_HEOCFG26_XPHI4COEFF4_Pos)    /* (LCDC_HEOCFG26) Horizontal Coefficient for phase 4 tap 4 Mask */
#define LCDC_HEOCFG26_XPHI4COEFF4(value)      (LCDC_HEOCFG26_XPHI4COEFF4_Msk & (_UINT32_(value) << LCDC_HEOCFG26_XPHI4COEFF4_Pos)) /* Assigment of value for XPHI4COEFF4 in the LCDC_HEOCFG26 register */
#define LCDC_HEOCFG26_Msk                     _UINT32_(0x000000FF)                                 /* (LCDC_HEOCFG26) Register Mask  */


/* -------- LCDC_HEOCFG27 : (LCDC Offset: 0x3F8) (R/W 32) High-End Overlay Configuration Register 27 -------- */
#define LCDC_HEOCFG27_XPHI5COEFF0_Pos         _UINT32_(0)                                          /* (LCDC_HEOCFG27) Horizontal Coefficient for phase 5 tap 0 Position */
#define LCDC_HEOCFG27_XPHI5COEFF0_Msk         (_UINT32_(0xFF) << LCDC_HEOCFG27_XPHI5COEFF0_Pos)    /* (LCDC_HEOCFG27) Horizontal Coefficient for phase 5 tap 0 Mask */
#define LCDC_HEOCFG27_XPHI5COEFF0(value)      (LCDC_HEOCFG27_XPHI5COEFF0_Msk & (_UINT32_(value) << LCDC_HEOCFG27_XPHI5COEFF0_Pos)) /* Assigment of value for XPHI5COEFF0 in the LCDC_HEOCFG27 register */
#define LCDC_HEOCFG27_XPHI5COEFF1_Pos         _UINT32_(8)                                          /* (LCDC_HEOCFG27) Horizontal Coefficient for phase 5 tap 1 Position */
#define LCDC_HEOCFG27_XPHI5COEFF1_Msk         (_UINT32_(0xFF) << LCDC_HEOCFG27_XPHI5COEFF1_Pos)    /* (LCDC_HEOCFG27) Horizontal Coefficient for phase 5 tap 1 Mask */
#define LCDC_HEOCFG27_XPHI5COEFF1(value)      (LCDC_HEOCFG27_XPHI5COEFF1_Msk & (_UINT32_(value) << LCDC_HEOCFG27_XPHI5COEFF1_Pos)) /* Assigment of value for XPHI5COEFF1 in the LCDC_HEOCFG27 register */
#define LCDC_HEOCFG27_XPHI5COEFF2_Pos         _UINT32_(16)                                         /* (LCDC_HEOCFG27) Horizontal Coefficient for phase 5 tap 2 Position */
#define LCDC_HEOCFG27_XPHI5COEFF2_Msk         (_UINT32_(0xFF) << LCDC_HEOCFG27_XPHI5COEFF2_Pos)    /* (LCDC_HEOCFG27) Horizontal Coefficient for phase 5 tap 2 Mask */
#define LCDC_HEOCFG27_XPHI5COEFF2(value)      (LCDC_HEOCFG27_XPHI5COEFF2_Msk & (_UINT32_(value) << LCDC_HEOCFG27_XPHI5COEFF2_Pos)) /* Assigment of value for XPHI5COEFF2 in the LCDC_HEOCFG27 register */
#define LCDC_HEOCFG27_XPHI5COEFF3_Pos         _UINT32_(24)                                         /* (LCDC_HEOCFG27) Horizontal Coefficient for phase 5 tap 3 Position */
#define LCDC_HEOCFG27_XPHI5COEFF3_Msk         (_UINT32_(0xFF) << LCDC_HEOCFG27_XPHI5COEFF3_Pos)    /* (LCDC_HEOCFG27) Horizontal Coefficient for phase 5 tap 3 Mask */
#define LCDC_HEOCFG27_XPHI5COEFF3(value)      (LCDC_HEOCFG27_XPHI5COEFF3_Msk & (_UINT32_(value) << LCDC_HEOCFG27_XPHI5COEFF3_Pos)) /* Assigment of value for XPHI5COEFF3 in the LCDC_HEOCFG27 register */
#define LCDC_HEOCFG27_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (LCDC_HEOCFG27) Register Mask  */


/* -------- LCDC_HEOCFG28 : (LCDC Offset: 0x3FC) (R/W 32) High-End Overlay Configuration Register 28 -------- */
#define LCDC_HEOCFG28_XPHI5COEFF4_Pos         _UINT32_(0)                                          /* (LCDC_HEOCFG28) Horizontal Coefficient for phase 5 tap 4 Position */
#define LCDC_HEOCFG28_XPHI5COEFF4_Msk         (_UINT32_(0xFF) << LCDC_HEOCFG28_XPHI5COEFF4_Pos)    /* (LCDC_HEOCFG28) Horizontal Coefficient for phase 5 tap 4 Mask */
#define LCDC_HEOCFG28_XPHI5COEFF4(value)      (LCDC_HEOCFG28_XPHI5COEFF4_Msk & (_UINT32_(value) << LCDC_HEOCFG28_XPHI5COEFF4_Pos)) /* Assigment of value for XPHI5COEFF4 in the LCDC_HEOCFG28 register */
#define LCDC_HEOCFG28_Msk                     _UINT32_(0x000000FF)                                 /* (LCDC_HEOCFG28) Register Mask  */


/* -------- LCDC_HEOCFG29 : (LCDC Offset: 0x400) (R/W 32) High-End Overlay Configuration Register 29 -------- */
#define LCDC_HEOCFG29_XPHI6COEFF0_Pos         _UINT32_(0)                                          /* (LCDC_HEOCFG29) Horizontal Coefficient for phase 6 tap 0 Position */
#define LCDC_HEOCFG29_XPHI6COEFF0_Msk         (_UINT32_(0xFF) << LCDC_HEOCFG29_XPHI6COEFF0_Pos)    /* (LCDC_HEOCFG29) Horizontal Coefficient for phase 6 tap 0 Mask */
#define LCDC_HEOCFG29_XPHI6COEFF0(value)      (LCDC_HEOCFG29_XPHI6COEFF0_Msk & (_UINT32_(value) << LCDC_HEOCFG29_XPHI6COEFF0_Pos)) /* Assigment of value for XPHI6COEFF0 in the LCDC_HEOCFG29 register */
#define LCDC_HEOCFG29_XPHI6COEFF1_Pos         _UINT32_(8)                                          /* (LCDC_HEOCFG29) Horizontal Coefficient for phase 6 tap 1 Position */
#define LCDC_HEOCFG29_XPHI6COEFF1_Msk         (_UINT32_(0xFF) << LCDC_HEOCFG29_XPHI6COEFF1_Pos)    /* (LCDC_HEOCFG29) Horizontal Coefficient for phase 6 tap 1 Mask */
#define LCDC_HEOCFG29_XPHI6COEFF1(value)      (LCDC_HEOCFG29_XPHI6COEFF1_Msk & (_UINT32_(value) << LCDC_HEOCFG29_XPHI6COEFF1_Pos)) /* Assigment of value for XPHI6COEFF1 in the LCDC_HEOCFG29 register */
#define LCDC_HEOCFG29_XPHI6COEFF2_Pos         _UINT32_(16)                                         /* (LCDC_HEOCFG29) Horizontal Coefficient for phase 6 tap 2 Position */
#define LCDC_HEOCFG29_XPHI6COEFF2_Msk         (_UINT32_(0xFF) << LCDC_HEOCFG29_XPHI6COEFF2_Pos)    /* (LCDC_HEOCFG29) Horizontal Coefficient for phase 6 tap 2 Mask */
#define LCDC_HEOCFG29_XPHI6COEFF2(value)      (LCDC_HEOCFG29_XPHI6COEFF2_Msk & (_UINT32_(value) << LCDC_HEOCFG29_XPHI6COEFF2_Pos)) /* Assigment of value for XPHI6COEFF2 in the LCDC_HEOCFG29 register */
#define LCDC_HEOCFG29_XPHI6COEFF3_Pos         _UINT32_(24)                                         /* (LCDC_HEOCFG29) Horizontal Coefficient for phase 6 tap 3 Position */
#define LCDC_HEOCFG29_XPHI6COEFF3_Msk         (_UINT32_(0xFF) << LCDC_HEOCFG29_XPHI6COEFF3_Pos)    /* (LCDC_HEOCFG29) Horizontal Coefficient for phase 6 tap 3 Mask */
#define LCDC_HEOCFG29_XPHI6COEFF3(value)      (LCDC_HEOCFG29_XPHI6COEFF3_Msk & (_UINT32_(value) << LCDC_HEOCFG29_XPHI6COEFF3_Pos)) /* Assigment of value for XPHI6COEFF3 in the LCDC_HEOCFG29 register */
#define LCDC_HEOCFG29_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (LCDC_HEOCFG29) Register Mask  */


