Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/test_app/firmware/src/packs/ATSAMA5D29_DFP/component/lcdc.h
/* -------- LCDC_HEOCFG30 : (LCDC Offset: 0x404) (R/W 32) High-End Overlay Configuration Register 30 -------- */
#define LCDC_HEOCFG30_XPHI6COEFF4_Pos         _UINT32_(0)                                          /* (LCDC_HEOCFG30) Horizontal Coefficient for phase 6 tap 4 Position */
#define LCDC_HEOCFG30_XPHI6COEFF4_Msk         (_UINT32_(0xFF) << LCDC_HEOCFG30_XPHI6COEFF4_Pos)    /* (LCDC_HEOCFG30) Horizontal Coefficient for phase 6 tap 4 Mask */
#define LCDC_HEOCFG30_XPHI6COEFF4(value)      (LCDC_HEOCFG30_XPHI6COEFF4_Msk & (_UINT32_(value) << LCDC_HEOCFG30_XPHI6COEFF4_Pos)) /* Assigment of value for XPHI6COEFF4 in the LCDC_HEOCFG30 register */
#define LCDC_HEOCFG30_Msk                     _UINT32_(0x000000FF)                                 /* (LCDC_HEOCFG30) Register Mask  */


/* -------- LCDC_HEOCFG31 : (LCDC Offset: 0x408) (R/W 32) High-End Overlay Configuration Register 31 -------- */
#define LCDC_HEOCFG31_XPHI7COEFF0_Pos         _UINT32_(0)                                          /* (LCDC_HEOCFG31) Horizontal Coefficient for phase 7 tap 0 Position */
#define LCDC_HEOCFG31_XPHI7COEFF0_Msk         (_UINT32_(0xFF) << LCDC_HEOCFG31_XPHI7COEFF0_Pos)    /* (LCDC_HEOCFG31) Horizontal Coefficient for phase 7 tap 0 Mask */
#define LCDC_HEOCFG31_XPHI7COEFF0(value)      (LCDC_HEOCFG31_XPHI7COEFF0_Msk & (_UINT32_(value) << LCDC_HEOCFG31_XPHI7COEFF0_Pos)) /* Assigment of value for XPHI7COEFF0 in the LCDC_HEOCFG31 register */
#define LCDC_HEOCFG31_XPHI7COEFF1_Pos         _UINT32_(8)                                          /* (LCDC_HEOCFG31) Horizontal Coefficient for phase 7 tap 1 Position */
#define LCDC_HEOCFG31_XPHI7COEFF1_Msk         (_UINT32_(0xFF) << LCDC_HEOCFG31_XPHI7COEFF1_Pos)    /* (LCDC_HEOCFG31) Horizontal Coefficient for phase 7 tap 1 Mask */
#define LCDC_HEOCFG31_XPHI7COEFF1(value)      (LCDC_HEOCFG31_XPHI7COEFF1_Msk & (_UINT32_(value) << LCDC_HEOCFG31_XPHI7COEFF1_Pos)) /* Assigment of value for XPHI7COEFF1 in the LCDC_HEOCFG31 register */
#define LCDC_HEOCFG31_XPHI7COEFF2_Pos         _UINT32_(16)                                         /* (LCDC_HEOCFG31) Horizontal Coefficient for phase 7 tap 2 Position */
#define LCDC_HEOCFG31_XPHI7COEFF2_Msk         (_UINT32_(0xFF) << LCDC_HEOCFG31_XPHI7COEFF2_Pos)    /* (LCDC_HEOCFG31) Horizontal Coefficient for phase 7 tap 2 Mask */
#define LCDC_HEOCFG31_XPHI7COEFF2(value)      (LCDC_HEOCFG31_XPHI7COEFF2_Msk & (_UINT32_(value) << LCDC_HEOCFG31_XPHI7COEFF2_Pos)) /* Assigment of value for XPHI7COEFF2 in the LCDC_HEOCFG31 register */
#define LCDC_HEOCFG31_XPHI7COEFF3_Pos         _UINT32_(24)                                         /* (LCDC_HEOCFG31) Horizontal Coefficient for phase 7 tap 3 Position */
#define LCDC_HEOCFG31_XPHI7COEFF3_Msk         (_UINT32_(0xFF) << LCDC_HEOCFG31_XPHI7COEFF3_Pos)    /* (LCDC_HEOCFG31) Horizontal Coefficient for phase 7 tap 3 Mask */
#define LCDC_HEOCFG31_XPHI7COEFF3(value)      (LCDC_HEOCFG31_XPHI7COEFF3_Msk & (_UINT32_(value) << LCDC_HEOCFG31_XPHI7COEFF3_Pos)) /* Assigment of value for XPHI7COEFF3 in the LCDC_HEOCFG31 register */
#define LCDC_HEOCFG31_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (LCDC_HEOCFG31) Register Mask  */


/* -------- LCDC_HEOCFG32 : (LCDC Offset: 0x40C) (R/W 32) High-End Overlay Configuration Register 32 -------- */
#define LCDC_HEOCFG32_XPHI7COEFF4_Pos         _UINT32_(0)                                          /* (LCDC_HEOCFG32) Horizontal Coefficient for phase 7 tap 4 Position */
#define LCDC_HEOCFG32_XPHI7COEFF4_Msk         (_UINT32_(0xFF) << LCDC_HEOCFG32_XPHI7COEFF4_Pos)    /* (LCDC_HEOCFG32) Horizontal Coefficient for phase 7 tap 4 Mask */
#define LCDC_HEOCFG32_XPHI7COEFF4(value)      (LCDC_HEOCFG32_XPHI7COEFF4_Msk & (_UINT32_(value) << LCDC_HEOCFG32_XPHI7COEFF4_Pos)) /* Assigment of value for XPHI7COEFF4 in the LCDC_HEOCFG32 register */
#define LCDC_HEOCFG32_Msk                     _UINT32_(0x000000FF)                                 /* (LCDC_HEOCFG32) Register Mask  */


/* -------- LCDC_HEOCFG33 : (LCDC Offset: 0x410) (R/W 32) High-End Overlay Configuration Register 33 -------- */
#define LCDC_HEOCFG33_YPHI0COEFF0_Pos         _UINT32_(0)                                          /* (LCDC_HEOCFG33) Vertical Coefficient for phase 0 tap 0 Position */
#define LCDC_HEOCFG33_YPHI0COEFF0_Msk         (_UINT32_(0xFF) << LCDC_HEOCFG33_YPHI0COEFF0_Pos)    /* (LCDC_HEOCFG33) Vertical Coefficient for phase 0 tap 0 Mask */
#define LCDC_HEOCFG33_YPHI0COEFF0(value)      (LCDC_HEOCFG33_YPHI0COEFF0_Msk & (_UINT32_(value) << LCDC_HEOCFG33_YPHI0COEFF0_Pos)) /* Assigment of value for YPHI0COEFF0 in the LCDC_HEOCFG33 register */
#define LCDC_HEOCFG33_YPHI0COEFF1_Pos         _UINT32_(8)                                          /* (LCDC_HEOCFG33) Vertical Coefficient for phase 0 tap 1 Position */
#define LCDC_HEOCFG33_YPHI0COEFF1_Msk         (_UINT32_(0xFF) << LCDC_HEOCFG33_YPHI0COEFF1_Pos)    /* (LCDC_HEOCFG33) Vertical Coefficient for phase 0 tap 1 Mask */
#define LCDC_HEOCFG33_YPHI0COEFF1(value)      (LCDC_HEOCFG33_YPHI0COEFF1_Msk & (_UINT32_(value) << LCDC_HEOCFG33_YPHI0COEFF1_Pos)) /* Assigment of value for YPHI0COEFF1 in the LCDC_HEOCFG33 register */
#define LCDC_HEOCFG33_YPHI0COEFF2_Pos         _UINT32_(16)                                         /* (LCDC_HEOCFG33) Vertical Coefficient for phase 0 tap 2 Position */
#define LCDC_HEOCFG33_YPHI0COEFF2_Msk         (_UINT32_(0xFF) << LCDC_HEOCFG33_YPHI0COEFF2_Pos)    /* (LCDC_HEOCFG33) Vertical Coefficient for phase 0 tap 2 Mask */
#define LCDC_HEOCFG33_YPHI0COEFF2(value)      (LCDC_HEOCFG33_YPHI0COEFF2_Msk & (_UINT32_(value) << LCDC_HEOCFG33_YPHI0COEFF2_Pos)) /* Assigment of value for YPHI0COEFF2 in the LCDC_HEOCFG33 register */
#define LCDC_HEOCFG33_Msk                     _UINT32_(0x00FFFFFF)                                 /* (LCDC_HEOCFG33) Register Mask  */


/* -------- LCDC_HEOCFG34 : (LCDC Offset: 0x414) (R/W 32) High-End Overlay Configuration Register 34 -------- */
#define LCDC_HEOCFG34_YPHI1COEFF0_Pos         _UINT32_(0)                                          /* (LCDC_HEOCFG34) Vertical Coefficient for phase 1 tap 0 Position */
#define LCDC_HEOCFG34_YPHI1COEFF0_Msk         (_UINT32_(0xFF) << LCDC_HEOCFG34_YPHI1COEFF0_Pos)    /* (LCDC_HEOCFG34) Vertical Coefficient for phase 1 tap 0 Mask */
#define LCDC_HEOCFG34_YPHI1COEFF0(value)      (LCDC_HEOCFG34_YPHI1COEFF0_Msk & (_UINT32_(value) << LCDC_HEOCFG34_YPHI1COEFF0_Pos)) /* Assigment of value for YPHI1COEFF0 in the LCDC_HEOCFG34 register */
#define LCDC_HEOCFG34_YPHI1COEFF1_Pos         _UINT32_(8)                                          /* (LCDC_HEOCFG34) Vertical Coefficient for phase 1 tap 1 Position */
#define LCDC_HEOCFG34_YPHI1COEFF1_Msk         (_UINT32_(0xFF) << LCDC_HEOCFG34_YPHI1COEFF1_Pos)    /* (LCDC_HEOCFG34) Vertical Coefficient for phase 1 tap 1 Mask */
#define LCDC_HEOCFG34_YPHI1COEFF1(value)      (LCDC_HEOCFG34_YPHI1COEFF1_Msk & (_UINT32_(value) << LCDC_HEOCFG34_YPHI1COEFF1_Pos)) /* Assigment of value for YPHI1COEFF1 in the LCDC_HEOCFG34 register */
#define LCDC_HEOCFG34_YPHI1COEFF2_Pos         _UINT32_(16)                                         /* (LCDC_HEOCFG34) Vertical Coefficient for phase 1 tap 2 Position */
#define LCDC_HEOCFG34_YPHI1COEFF2_Msk         (_UINT32_(0xFF) << LCDC_HEOCFG34_YPHI1COEFF2_Pos)    /* (LCDC_HEOCFG34) Vertical Coefficient for phase 1 tap 2 Mask */
#define LCDC_HEOCFG34_YPHI1COEFF2(value)      (LCDC_HEOCFG34_YPHI1COEFF2_Msk & (_UINT32_(value) << LCDC_HEOCFG34_YPHI1COEFF2_Pos)) /* Assigment of value for YPHI1COEFF2 in the LCDC_HEOCFG34 register */
#define LCDC_HEOCFG34_Msk                     _UINT32_(0x00FFFFFF)                                 /* (LCDC_HEOCFG34) Register Mask  */


/* -------- LCDC_HEOCFG35 : (LCDC Offset: 0x418) (R/W 32) High-End Overlay Configuration Register 35 -------- */
#define LCDC_HEOCFG35_YPHI2COEFF0_Pos         _UINT32_(0)                                          /* (LCDC_HEOCFG35) Vertical Coefficient for phase 2 tap 0 Position */
#define LCDC_HEOCFG35_YPHI2COEFF0_Msk         (_UINT32_(0xFF) << LCDC_HEOCFG35_YPHI2COEFF0_Pos)    /* (LCDC_HEOCFG35) Vertical Coefficient for phase 2 tap 0 Mask */
#define LCDC_HEOCFG35_YPHI2COEFF0(value)      (LCDC_HEOCFG35_YPHI2COEFF0_Msk & (_UINT32_(value) << LCDC_HEOCFG35_YPHI2COEFF0_Pos)) /* Assigment of value for YPHI2COEFF0 in the LCDC_HEOCFG35 register */
#define LCDC_HEOCFG35_YPHI2COEFF1_Pos         _UINT32_(8)                                          /* (LCDC_HEOCFG35) Vertical Coefficient for phase 2 tap 1 Position */
#define LCDC_HEOCFG35_YPHI2COEFF1_Msk         (_UINT32_(0xFF) << LCDC_HEOCFG35_YPHI2COEFF1_Pos)    /* (LCDC_HEOCFG35) Vertical Coefficient for phase 2 tap 1 Mask */
#define LCDC_HEOCFG35_YPHI2COEFF1(value)      (LCDC_HEOCFG35_YPHI2COEFF1_Msk & (_UINT32_(value) << LCDC_HEOCFG35_YPHI2COEFF1_Pos)) /* Assigment of value for YPHI2COEFF1 in the LCDC_HEOCFG35 register */
#define LCDC_HEOCFG35_YPHI2COEFF2_Pos         _UINT32_(16)                                         /* (LCDC_HEOCFG35) Vertical Coefficient for phase 2 tap 2 Position */
#define LCDC_HEOCFG35_YPHI2COEFF2_Msk         (_UINT32_(0xFF) << LCDC_HEOCFG35_YPHI2COEFF2_Pos)    /* (LCDC_HEOCFG35) Vertical Coefficient for phase 2 tap 2 Mask */
#define LCDC_HEOCFG35_YPHI2COEFF2(value)      (LCDC_HEOCFG35_YPHI2COEFF2_Msk & (_UINT32_(value) << LCDC_HEOCFG35_YPHI2COEFF2_Pos)) /* Assigment of value for YPHI2COEFF2 in the LCDC_HEOCFG35 register */
#define LCDC_HEOCFG35_Msk                     _UINT32_(0x00FFFFFF)                                 /* (LCDC_HEOCFG35) Register Mask  */


/* -------- LCDC_HEOCFG36 : (LCDC Offset: 0x41C) (R/W 32) High-End Overlay Configuration Register 36 -------- */
#define LCDC_HEOCFG36_YPHI3COEFF0_Pos         _UINT32_(0)                                          /* (LCDC_HEOCFG36) Vertical Coefficient for phase 3 tap 0 Position */
#define LCDC_HEOCFG36_YPHI3COEFF0_Msk         (_UINT32_(0xFF) << LCDC_HEOCFG36_YPHI3COEFF0_Pos)    /* (LCDC_HEOCFG36) Vertical Coefficient for phase 3 tap 0 Mask */
#define LCDC_HEOCFG36_YPHI3COEFF0(value)      (LCDC_HEOCFG36_YPHI3COEFF0_Msk & (_UINT32_(value) << LCDC_HEOCFG36_YPHI3COEFF0_Pos)) /* Assigment of value for YPHI3COEFF0 in the LCDC_HEOCFG36 register */
#define LCDC_HEOCFG36_YPHI3COEFF1_Pos         _UINT32_(8)                                          /* (LCDC_HEOCFG36) Vertical Coefficient for phase 3 tap 1 Position */
#define LCDC_HEOCFG36_YPHI3COEFF1_Msk         (_UINT32_(0xFF) << LCDC_HEOCFG36_YPHI3COEFF1_Pos)    /* (LCDC_HEOCFG36) Vertical Coefficient for phase 3 tap 1 Mask */
#define LCDC_HEOCFG36_YPHI3COEFF1(value)      (LCDC_HEOCFG36_YPHI3COEFF1_Msk & (_UINT32_(value) << LCDC_HEOCFG36_YPHI3COEFF1_Pos)) /* Assigment of value for YPHI3COEFF1 in the LCDC_HEOCFG36 register */
#define LCDC_HEOCFG36_YPHI3COEFF2_Pos         _UINT32_(16)                                         /* (LCDC_HEOCFG36) Vertical Coefficient for phase 3 tap 2 Position */
#define LCDC_HEOCFG36_YPHI3COEFF2_Msk         (_UINT32_(0xFF) << LCDC_HEOCFG36_YPHI3COEFF2_Pos)    /* (LCDC_HEOCFG36) Vertical Coefficient for phase 3 tap 2 Mask */
#define LCDC_HEOCFG36_YPHI3COEFF2(value)      (LCDC_HEOCFG36_YPHI3COEFF2_Msk & (_UINT32_(value) << LCDC_HEOCFG36_YPHI3COEFF2_Pos)) /* Assigment of value for YPHI3COEFF2 in the LCDC_HEOCFG36 register */
#define LCDC_HEOCFG36_Msk                     _UINT32_(0x00FFFFFF)                                 /* (LCDC_HEOCFG36) Register Mask  */


/* -------- LCDC_HEOCFG37 : (LCDC Offset: 0x420) (R/W 32) High-End Overlay Configuration Register 37 -------- */
#define LCDC_HEOCFG37_YPHI4COEFF0_Pos         _UINT32_(0)                                          /* (LCDC_HEOCFG37) Vertical Coefficient for phase 4 tap 0 Position */
#define LCDC_HEOCFG37_YPHI4COEFF0_Msk         (_UINT32_(0xFF) << LCDC_HEOCFG37_YPHI4COEFF0_Pos)    /* (LCDC_HEOCFG37) Vertical Coefficient for phase 4 tap 0 Mask */
#define LCDC_HEOCFG37_YPHI4COEFF0(value)      (LCDC_HEOCFG37_YPHI4COEFF0_Msk & (_UINT32_(value) << LCDC_HEOCFG37_YPHI4COEFF0_Pos)) /* Assigment of value for YPHI4COEFF0 in the LCDC_HEOCFG37 register */
#define LCDC_HEOCFG37_YPHI4COEFF1_Pos         _UINT32_(8)                                          /* (LCDC_HEOCFG37) Vertical Coefficient for phase 4 tap 1 Position */
#define LCDC_HEOCFG37_YPHI4COEFF1_Msk         (_UINT32_(0xFF) << LCDC_HEOCFG37_YPHI4COEFF1_Pos)    /* (LCDC_HEOCFG37) Vertical Coefficient for phase 4 tap 1 Mask */
#define LCDC_HEOCFG37_YPHI4COEFF1(value)      (LCDC_HEOCFG37_YPHI4COEFF1_Msk & (_UINT32_(value) << LCDC_HEOCFG37_YPHI4COEFF1_Pos)) /* Assigment of value for YPHI4COEFF1 in the LCDC_HEOCFG37 register */
#define LCDC_HEOCFG37_YPHI4COEFF2_Pos         _UINT32_(16)                                         /* (LCDC_HEOCFG37) Vertical Coefficient for phase 4 tap 2 Position */
#define LCDC_HEOCFG37_YPHI4COEFF2_Msk         (_UINT32_(0xFF) << LCDC_HEOCFG37_YPHI4COEFF2_Pos)    /* (LCDC_HEOCFG37) Vertical Coefficient for phase 4 tap 2 Mask */
#define LCDC_HEOCFG37_YPHI4COEFF2(value)      (LCDC_HEOCFG37_YPHI4COEFF2_Msk & (_UINT32_(value) << LCDC_HEOCFG37_YPHI4COEFF2_Pos)) /* Assigment of value for YPHI4COEFF2 in the LCDC_HEOCFG37 register */
#define LCDC_HEOCFG37_Msk                     _UINT32_(0x00FFFFFF)                                 /* (LCDC_HEOCFG37) Register Mask  */


/* -------- LCDC_HEOCFG38 : (LCDC Offset: 0x424) (R/W 32) High-End Overlay Configuration Register 38 -------- */
#define LCDC_HEOCFG38_YPHI5COEFF0_Pos         _UINT32_(0)                                          /* (LCDC_HEOCFG38) Vertical Coefficient for phase 5 tap 0 Position */
#define LCDC_HEOCFG38_YPHI5COEFF0_Msk         (_UINT32_(0xFF) << LCDC_HEOCFG38_YPHI5COEFF0_Pos)    /* (LCDC_HEOCFG38) Vertical Coefficient for phase 5 tap 0 Mask */
#define LCDC_HEOCFG38_YPHI5COEFF0(value)      (LCDC_HEOCFG38_YPHI5COEFF0_Msk & (_UINT32_(value) << LCDC_HEOCFG38_YPHI5COEFF0_Pos)) /* Assigment of value for YPHI5COEFF0 in the LCDC_HEOCFG38 register */
#define LCDC_HEOCFG38_YPHI5COEFF1_Pos         _UINT32_(8)                                          /* (LCDC_HEOCFG38) Vertical Coefficient for phase 5 tap 1 Position */
#define LCDC_HEOCFG38_YPHI5COEFF1_Msk         (_UINT32_(0xFF) << LCDC_HEOCFG38_YPHI5COEFF1_Pos)    /* (LCDC_HEOCFG38) Vertical Coefficient for phase 5 tap 1 Mask */
#define LCDC_HEOCFG38_YPHI5COEFF1(value)      (LCDC_HEOCFG38_YPHI5COEFF1_Msk & (_UINT32_(value) << LCDC_HEOCFG38_YPHI5COEFF1_Pos)) /* Assigment of value for YPHI5COEFF1 in the LCDC_HEOCFG38 register */
#define LCDC_HEOCFG38_YPHI5COEFF2_Pos         _UINT32_(16)                                         /* (LCDC_HEOCFG38) Vertical Coefficient for phase 5 tap 2 Position */
#define LCDC_HEOCFG38_YPHI5COEFF2_Msk         (_UINT32_(0xFF) << LCDC_HEOCFG38_YPHI5COEFF2_Pos)    /* (LCDC_HEOCFG38) Vertical Coefficient for phase 5 tap 2 Mask */
#define LCDC_HEOCFG38_YPHI5COEFF2(value)      (LCDC_HEOCFG38_YPHI5COEFF2_Msk & (_UINT32_(value) << LCDC_HEOCFG38_YPHI5COEFF2_Pos)) /* Assigment of value for YPHI5COEFF2 in the LCDC_HEOCFG38 register */
#define LCDC_HEOCFG38_Msk                     _UINT32_(0x00FFFFFF)                                 /* (LCDC_HEOCFG38) Register Mask  */


/* -------- LCDC_HEOCFG39 : (LCDC Offset: 0x428) (R/W 32) High-End Overlay Configuration Register 39 -------- */
#define LCDC_HEOCFG39_YPHI6COEFF0_Pos         _UINT32_(0)                                          /* (LCDC_HEOCFG39) Vertical Coefficient for phase 6 tap 0 Position */
#define LCDC_HEOCFG39_YPHI6COEFF0_Msk         (_UINT32_(0xFF) << LCDC_HEOCFG39_YPHI6COEFF0_Pos)    /* (LCDC_HEOCFG39) Vertical Coefficient for phase 6 tap 0 Mask */
#define LCDC_HEOCFG39_YPHI6COEFF0(value)      (LCDC_HEOCFG39_YPHI6COEFF0_Msk & (_UINT32_(value) << LCDC_HEOCFG39_YPHI6COEFF0_Pos)) /* Assigment of value for YPHI6COEFF0 in the LCDC_HEOCFG39 register */
#define LCDC_HEOCFG39_YPHI6COEFF1_Pos         _UINT32_(8)                                          /* (LCDC_HEOCFG39) Vertical Coefficient for phase 6 tap 1 Position */
#define LCDC_HEOCFG39_YPHI6COEFF1_Msk         (_UINT32_(0xFF) << LCDC_HEOCFG39_YPHI6COEFF1_Pos)    /* (LCDC_HEOCFG39) Vertical Coefficient for phase 6 tap 1 Mask */
#define LCDC_HEOCFG39_YPHI6COEFF1(value)      (LCDC_HEOCFG39_YPHI6COEFF1_Msk & (_UINT32_(value) << LCDC_HEOCFG39_YPHI6COEFF1_Pos)) /* Assigment of value for YPHI6COEFF1 in the LCDC_HEOCFG39 register */
#define LCDC_HEOCFG39_YPHI6COEFF2_Pos         _UINT32_(16)                                         /* (LCDC_HEOCFG39) Vertical Coefficient for phase 6 tap 2 Position */
#define LCDC_HEOCFG39_YPHI6COEFF2_Msk         (_UINT32_(0xFF) << LCDC_HEOCFG39_YPHI6COEFF2_Pos)    /* (LCDC_HEOCFG39) Vertical Coefficient for phase 6 tap 2 Mask */
#define LCDC_HEOCFG39_YPHI6COEFF2(value)      (LCDC_HEOCFG39_YPHI6COEFF2_Msk & (_UINT32_(value) << LCDC_HEOCFG39_YPHI6COEFF2_Pos)) /* Assigment of value for YPHI6COEFF2 in the LCDC_HEOCFG39 register */
#define LCDC_HEOCFG39_Msk                     _UINT32_(0x00FFFFFF)                                 /* (LCDC_HEOCFG39) Register Mask  */


/* -------- LCDC_HEOCFG40 : (LCDC Offset: 0x42C) (R/W 32) High-End Overlay Configuration Register 40 -------- */
#define LCDC_HEOCFG40_YPHI7COEFF0_Pos         _UINT32_(0)                                          /* (LCDC_HEOCFG40) Vertical Coefficient for phase 7 tap 0 Position */
#define LCDC_HEOCFG40_YPHI7COEFF0_Msk         (_UINT32_(0xFF) << LCDC_HEOCFG40_YPHI7COEFF0_Pos)    /* (LCDC_HEOCFG40) Vertical Coefficient for phase 7 tap 0 Mask */
#define LCDC_HEOCFG40_YPHI7COEFF0(value)      (LCDC_HEOCFG40_YPHI7COEFF0_Msk & (_UINT32_(value) << LCDC_HEOCFG40_YPHI7COEFF0_Pos)) /* Assigment of value for YPHI7COEFF0 in the LCDC_HEOCFG40 register */
#define LCDC_HEOCFG40_YPHI7COEFF1_Pos         _UINT32_(8)                                          /* (LCDC_HEOCFG40) Vertical Coefficient for phase 7 tap 1 Position */
#define LCDC_HEOCFG40_YPHI7COEFF1_Msk         (_UINT32_(0xFF) << LCDC_HEOCFG40_YPHI7COEFF1_Pos)    /* (LCDC_HEOCFG40) Vertical Coefficient for phase 7 tap 1 Mask */
#define LCDC_HEOCFG40_YPHI7COEFF1(value)      (LCDC_HEOCFG40_YPHI7COEFF1_Msk & (_UINT32_(value) << LCDC_HEOCFG40_YPHI7COEFF1_Pos)) /* Assigment of value for YPHI7COEFF1 in the LCDC_HEOCFG40 register */
#define LCDC_HEOCFG40_YPHI7COEFF2_Pos         _UINT32_(16)                                         /* (LCDC_HEOCFG40) Vertical Coefficient for phase 7 tap 2 Position */
#define LCDC_HEOCFG40_YPHI7COEFF2_Msk         (_UINT32_(0xFF) << LCDC_HEOCFG40_YPHI7COEFF2_Pos)    /* (LCDC_HEOCFG40) Vertical Coefficient for phase 7 tap 2 Mask */
#define LCDC_HEOCFG40_YPHI7COEFF2(value)      (LCDC_HEOCFG40_YPHI7COEFF2_Msk & (_UINT32_(value) << LCDC_HEOCFG40_YPHI7COEFF2_Pos)) /* Assigment of value for YPHI7COEFF2 in the LCDC_HEOCFG40 register */
#define LCDC_HEOCFG40_Msk                     _UINT32_(0x00FFFFFF)                                 /* (LCDC_HEOCFG40) Register Mask  */


/* -------- LCDC_HEOCFG41 : (LCDC Offset: 0x430) (R/W 32) High-End Overlay Configuration Register 41 -------- */
#define LCDC_HEOCFG41_XPHIDEF_Pos             _UINT32_(0)                                          /* (LCDC_HEOCFG41) Horizontal Filter Phase Offset Position */
#define LCDC_HEOCFG41_XPHIDEF_Msk             (_UINT32_(0x7) << LCDC_HEOCFG41_XPHIDEF_Pos)         /* (LCDC_HEOCFG41) Horizontal Filter Phase Offset Mask */
#define LCDC_HEOCFG41_XPHIDEF(value)          (LCDC_HEOCFG41_XPHIDEF_Msk & (_UINT32_(value) << LCDC_HEOCFG41_XPHIDEF_Pos)) /* Assigment of value for XPHIDEF in the LCDC_HEOCFG41 register */
#define LCDC_HEOCFG41_YPHIDEF_Pos             _UINT32_(16)                                         /* (LCDC_HEOCFG41) Vertical Filter Phase Offset Position */
#define LCDC_HEOCFG41_YPHIDEF_Msk             (_UINT32_(0x7) << LCDC_HEOCFG41_YPHIDEF_Pos)         /* (LCDC_HEOCFG41) Vertical Filter Phase Offset Mask */
#define LCDC_HEOCFG41_YPHIDEF(value)          (LCDC_HEOCFG41_YPHIDEF_Msk & (_UINT32_(value) << LCDC_HEOCFG41_YPHIDEF_Pos)) /* Assigment of value for YPHIDEF in the LCDC_HEOCFG41 register */
#define LCDC_HEOCFG41_Msk                     _UINT32_(0x00070007)                                 /* (LCDC_HEOCFG41) Register Mask  */


