Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/test_app/firmware/src/packs/ATSAMA5D29_DFP/component/lcdc.h
/* -------- LCDC_PPCHER : (LCDC Offset: 0x540) ( /W 32) Post Processing Channel Enable Register -------- */
#define LCDC_PPCHER_CHEN_Pos                  _UINT32_(0)                                          /* (LCDC_PPCHER) Channel Enable Position */
#define LCDC_PPCHER_CHEN_Msk                  (_UINT32_(0x1) << LCDC_PPCHER_CHEN_Pos)              /* (LCDC_PPCHER) Channel Enable Mask */
#define LCDC_PPCHER_CHEN(value)               (LCDC_PPCHER_CHEN_Msk & (_UINT32_(value) << LCDC_PPCHER_CHEN_Pos)) /* Assigment of value for CHEN in the LCDC_PPCHER register */
#define LCDC_PPCHER_UPDATEEN_Pos              _UINT32_(1)                                          /* (LCDC_PPCHER) Update Overlay Attributes Enable Position */
#define LCDC_PPCHER_UPDATEEN_Msk              (_UINT32_(0x1) << LCDC_PPCHER_UPDATEEN_Pos)          /* (LCDC_PPCHER) Update Overlay Attributes Enable Mask */
#define LCDC_PPCHER_UPDATEEN(value)           (LCDC_PPCHER_UPDATEEN_Msk & (_UINT32_(value) << LCDC_PPCHER_UPDATEEN_Pos)) /* Assigment of value for UPDATEEN in the LCDC_PPCHER register */
#define LCDC_PPCHER_A2QEN_Pos                 _UINT32_(2)                                          /* (LCDC_PPCHER) Add To Queue Enable Position */
#define LCDC_PPCHER_A2QEN_Msk                 (_UINT32_(0x1) << LCDC_PPCHER_A2QEN_Pos)             /* (LCDC_PPCHER) Add To Queue Enable Mask */
#define LCDC_PPCHER_A2QEN(value)              (LCDC_PPCHER_A2QEN_Msk & (_UINT32_(value) << LCDC_PPCHER_A2QEN_Pos)) /* Assigment of value for A2QEN in the LCDC_PPCHER register */
#define LCDC_PPCHER_Msk                       _UINT32_(0x00000007)                                 /* (LCDC_PPCHER) Register Mask  */


/* -------- LCDC_PPCHDR : (LCDC Offset: 0x544) ( /W 32) Post Processing Channel Disable Register -------- */
#define LCDC_PPCHDR_CHDIS_Pos                 _UINT32_(0)                                          /* (LCDC_PPCHDR) Channel Disable Position */
#define LCDC_PPCHDR_CHDIS_Msk                 (_UINT32_(0x1) << LCDC_PPCHDR_CHDIS_Pos)             /* (LCDC_PPCHDR) Channel Disable Mask */
#define LCDC_PPCHDR_CHDIS(value)              (LCDC_PPCHDR_CHDIS_Msk & (_UINT32_(value) << LCDC_PPCHDR_CHDIS_Pos)) /* Assigment of value for CHDIS in the LCDC_PPCHDR register */
#define LCDC_PPCHDR_CHRST_Pos                 _UINT32_(8)                                          /* (LCDC_PPCHDR) Channel Reset Position */
#define LCDC_PPCHDR_CHRST_Msk                 (_UINT32_(0x1) << LCDC_PPCHDR_CHRST_Pos)             /* (LCDC_PPCHDR) Channel Reset Mask */
#define LCDC_PPCHDR_CHRST(value)              (LCDC_PPCHDR_CHRST_Msk & (_UINT32_(value) << LCDC_PPCHDR_CHRST_Pos)) /* Assigment of value for CHRST in the LCDC_PPCHDR register */
#define LCDC_PPCHDR_Msk                       _UINT32_(0x00000101)                                 /* (LCDC_PPCHDR) Register Mask  */


/* -------- LCDC_PPCHSR : (LCDC Offset: 0x548) ( R/ 32) Post Processing Channel Status Register -------- */
#define LCDC_PPCHSR_CHSR_Pos                  _UINT32_(0)                                          /* (LCDC_PPCHSR) Channel Status Position */
#define LCDC_PPCHSR_CHSR_Msk                  (_UINT32_(0x1) << LCDC_PPCHSR_CHSR_Pos)              /* (LCDC_PPCHSR) Channel Status Mask */
#define LCDC_PPCHSR_CHSR(value)               (LCDC_PPCHSR_CHSR_Msk & (_UINT32_(value) << LCDC_PPCHSR_CHSR_Pos)) /* Assigment of value for CHSR in the LCDC_PPCHSR register */
#define LCDC_PPCHSR_UPDATESR_Pos              _UINT32_(1)                                          /* (LCDC_PPCHSR) Update Overlay Attributes In Progress Status Position */
#define LCDC_PPCHSR_UPDATESR_Msk              (_UINT32_(0x1) << LCDC_PPCHSR_UPDATESR_Pos)          /* (LCDC_PPCHSR) Update Overlay Attributes In Progress Status Mask */
#define LCDC_PPCHSR_UPDATESR(value)           (LCDC_PPCHSR_UPDATESR_Msk & (_UINT32_(value) << LCDC_PPCHSR_UPDATESR_Pos)) /* Assigment of value for UPDATESR in the LCDC_PPCHSR register */
#define LCDC_PPCHSR_A2QSR_Pos                 _UINT32_(2)                                          /* (LCDC_PPCHSR) Add To Queue Status Position */
#define LCDC_PPCHSR_A2QSR_Msk                 (_UINT32_(0x1) << LCDC_PPCHSR_A2QSR_Pos)             /* (LCDC_PPCHSR) Add To Queue Status Mask */
#define LCDC_PPCHSR_A2QSR(value)              (LCDC_PPCHSR_A2QSR_Msk & (_UINT32_(value) << LCDC_PPCHSR_A2QSR_Pos)) /* Assigment of value for A2QSR in the LCDC_PPCHSR register */
#define LCDC_PPCHSR_Msk                       _UINT32_(0x00000007)                                 /* (LCDC_PPCHSR) Register Mask  */


/* -------- LCDC_PPIER : (LCDC Offset: 0x54C) ( /W 32) Post Processing Interrupt Enable Register -------- */
#define LCDC_PPIER_DMA_Pos                    _UINT32_(2)                                          /* (LCDC_PPIER) End of DMA Transfer Interrupt Enable Position */
#define LCDC_PPIER_DMA_Msk                    (_UINT32_(0x1) << LCDC_PPIER_DMA_Pos)                /* (LCDC_PPIER) End of DMA Transfer Interrupt Enable Mask */
#define LCDC_PPIER_DMA(value)                 (LCDC_PPIER_DMA_Msk & (_UINT32_(value) << LCDC_PPIER_DMA_Pos)) /* Assigment of value for DMA in the LCDC_PPIER register */
#define LCDC_PPIER_DSCR_Pos                   _UINT32_(3)                                          /* (LCDC_PPIER) Descriptor Loaded Interrupt Enable Position */
#define LCDC_PPIER_DSCR_Msk                   (_UINT32_(0x1) << LCDC_PPIER_DSCR_Pos)               /* (LCDC_PPIER) Descriptor Loaded Interrupt Enable Mask */
#define LCDC_PPIER_DSCR(value)                (LCDC_PPIER_DSCR_Msk & (_UINT32_(value) << LCDC_PPIER_DSCR_Pos)) /* Assigment of value for DSCR in the LCDC_PPIER register */
#define LCDC_PPIER_ADD_Pos                    _UINT32_(4)                                          /* (LCDC_PPIER) Head Descriptor Loaded Interrupt Enable Position */
#define LCDC_PPIER_ADD_Msk                    (_UINT32_(0x1) << LCDC_PPIER_ADD_Pos)                /* (LCDC_PPIER) Head Descriptor Loaded Interrupt Enable Mask */
#define LCDC_PPIER_ADD(value)                 (LCDC_PPIER_ADD_Msk & (_UINT32_(value) << LCDC_PPIER_ADD_Pos)) /* Assigment of value for ADD in the LCDC_PPIER register */
#define LCDC_PPIER_DONE_Pos                   _UINT32_(5)                                          /* (LCDC_PPIER) End of List Interrupt Enable Position */
#define LCDC_PPIER_DONE_Msk                   (_UINT32_(0x1) << LCDC_PPIER_DONE_Pos)               /* (LCDC_PPIER) End of List Interrupt Enable Mask */
#define LCDC_PPIER_DONE(value)                (LCDC_PPIER_DONE_Msk & (_UINT32_(value) << LCDC_PPIER_DONE_Pos)) /* Assigment of value for DONE in the LCDC_PPIER register */
#define LCDC_PPIER_Msk                        _UINT32_(0x0000003C)                                 /* (LCDC_PPIER) Register Mask  */


