Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/test_app/firmware/src/packs/ATSAMA5D29_DFP/component/lcdc.h
/* -------- LCDC_PPIDR : (LCDC Offset: 0x550) ( /W 32) Post Processing Interrupt Disable Register -------- */
#define LCDC_PPIDR_DMA_Pos                    _UINT32_(2)                                          /* (LCDC_PPIDR) End of DMA Transfer Interrupt Disable Position */
#define LCDC_PPIDR_DMA_Msk                    (_UINT32_(0x1) << LCDC_PPIDR_DMA_Pos)                /* (LCDC_PPIDR) End of DMA Transfer Interrupt Disable Mask */
#define LCDC_PPIDR_DMA(value)                 (LCDC_PPIDR_DMA_Msk & (_UINT32_(value) << LCDC_PPIDR_DMA_Pos)) /* Assigment of value for DMA in the LCDC_PPIDR register */
#define LCDC_PPIDR_DSCR_Pos                   _UINT32_(3)                                          /* (LCDC_PPIDR) Descriptor Loaded Interrupt Disable Position */
#define LCDC_PPIDR_DSCR_Msk                   (_UINT32_(0x1) << LCDC_PPIDR_DSCR_Pos)               /* (LCDC_PPIDR) Descriptor Loaded Interrupt Disable Mask */
#define LCDC_PPIDR_DSCR(value)                (LCDC_PPIDR_DSCR_Msk & (_UINT32_(value) << LCDC_PPIDR_DSCR_Pos)) /* Assigment of value for DSCR in the LCDC_PPIDR register */
#define LCDC_PPIDR_ADD_Pos                    _UINT32_(4)                                          /* (LCDC_PPIDR) Head Descriptor Loaded Interrupt Disable Position */
#define LCDC_PPIDR_ADD_Msk                    (_UINT32_(0x1) << LCDC_PPIDR_ADD_Pos)                /* (LCDC_PPIDR) Head Descriptor Loaded Interrupt Disable Mask */
#define LCDC_PPIDR_ADD(value)                 (LCDC_PPIDR_ADD_Msk & (_UINT32_(value) << LCDC_PPIDR_ADD_Pos)) /* Assigment of value for ADD in the LCDC_PPIDR register */
#define LCDC_PPIDR_DONE_Pos                   _UINT32_(5)                                          /* (LCDC_PPIDR) End of List Interrupt Disable Position */
#define LCDC_PPIDR_DONE_Msk                   (_UINT32_(0x1) << LCDC_PPIDR_DONE_Pos)               /* (LCDC_PPIDR) End of List Interrupt Disable Mask */
#define LCDC_PPIDR_DONE(value)                (LCDC_PPIDR_DONE_Msk & (_UINT32_(value) << LCDC_PPIDR_DONE_Pos)) /* Assigment of value for DONE in the LCDC_PPIDR register */
#define LCDC_PPIDR_Msk                        _UINT32_(0x0000003C)                                 /* (LCDC_PPIDR) Register Mask  */


/* -------- LCDC_PPIMR : (LCDC Offset: 0x554) ( R/ 32) Post Processing Interrupt Mask Register -------- */
#define LCDC_PPIMR_DMA_Pos                    _UINT32_(2)                                          /* (LCDC_PPIMR) End of DMA Transfer Interrupt Mask Position */
#define LCDC_PPIMR_DMA_Msk                    (_UINT32_(0x1) << LCDC_PPIMR_DMA_Pos)                /* (LCDC_PPIMR) End of DMA Transfer Interrupt Mask Mask */
#define LCDC_PPIMR_DMA(value)                 (LCDC_PPIMR_DMA_Msk & (_UINT32_(value) << LCDC_PPIMR_DMA_Pos)) /* Assigment of value for DMA in the LCDC_PPIMR register */
#define LCDC_PPIMR_DSCR_Pos                   _UINT32_(3)                                          /* (LCDC_PPIMR) Descriptor Loaded Interrupt Mask Position */
#define LCDC_PPIMR_DSCR_Msk                   (_UINT32_(0x1) << LCDC_PPIMR_DSCR_Pos)               /* (LCDC_PPIMR) Descriptor Loaded Interrupt Mask Mask */
#define LCDC_PPIMR_DSCR(value)                (LCDC_PPIMR_DSCR_Msk & (_UINT32_(value) << LCDC_PPIMR_DSCR_Pos)) /* Assigment of value for DSCR in the LCDC_PPIMR register */
#define LCDC_PPIMR_ADD_Pos                    _UINT32_(4)                                          /* (LCDC_PPIMR) Head Descriptor Loaded Interrupt Mask Position */
#define LCDC_PPIMR_ADD_Msk                    (_UINT32_(0x1) << LCDC_PPIMR_ADD_Pos)                /* (LCDC_PPIMR) Head Descriptor Loaded Interrupt Mask Mask */
#define LCDC_PPIMR_ADD(value)                 (LCDC_PPIMR_ADD_Msk & (_UINT32_(value) << LCDC_PPIMR_ADD_Pos)) /* Assigment of value for ADD in the LCDC_PPIMR register */
#define LCDC_PPIMR_DONE_Pos                   _UINT32_(5)                                          /* (LCDC_PPIMR) End of List Interrupt Mask Position */
#define LCDC_PPIMR_DONE_Msk                   (_UINT32_(0x1) << LCDC_PPIMR_DONE_Pos)               /* (LCDC_PPIMR) End of List Interrupt Mask Mask */
#define LCDC_PPIMR_DONE(value)                (LCDC_PPIMR_DONE_Msk & (_UINT32_(value) << LCDC_PPIMR_DONE_Pos)) /* Assigment of value for DONE in the LCDC_PPIMR register */
#define LCDC_PPIMR_Msk                        _UINT32_(0x0000003C)                                 /* (LCDC_PPIMR) Register Mask  */


/* -------- LCDC_PPISR : (LCDC Offset: 0x558) ( R/ 32) Post Processing Interrupt Status Register -------- */
#define LCDC_PPISR_DMA_Pos                    _UINT32_(2)                                          /* (LCDC_PPISR) End of DMA Transfer Position */
#define LCDC_PPISR_DMA_Msk                    (_UINT32_(0x1) << LCDC_PPISR_DMA_Pos)                /* (LCDC_PPISR) End of DMA Transfer Mask */
#define LCDC_PPISR_DMA(value)                 (LCDC_PPISR_DMA_Msk & (_UINT32_(value) << LCDC_PPISR_DMA_Pos)) /* Assigment of value for DMA in the LCDC_PPISR register */
#define LCDC_PPISR_DSCR_Pos                   _UINT32_(3)                                          /* (LCDC_PPISR) DMA Descriptor Loaded Position */
#define LCDC_PPISR_DSCR_Msk                   (_UINT32_(0x1) << LCDC_PPISR_DSCR_Pos)               /* (LCDC_PPISR) DMA Descriptor Loaded Mask */
#define LCDC_PPISR_DSCR(value)                (LCDC_PPISR_DSCR_Msk & (_UINT32_(value) << LCDC_PPISR_DSCR_Pos)) /* Assigment of value for DSCR in the LCDC_PPISR register */
#define LCDC_PPISR_ADD_Pos                    _UINT32_(4)                                          /* (LCDC_PPISR) Head Descriptor Loaded Position */
#define LCDC_PPISR_ADD_Msk                    (_UINT32_(0x1) << LCDC_PPISR_ADD_Pos)                /* (LCDC_PPISR) Head Descriptor Loaded Mask */
#define LCDC_PPISR_ADD(value)                 (LCDC_PPISR_ADD_Msk & (_UINT32_(value) << LCDC_PPISR_ADD_Pos)) /* Assigment of value for ADD in the LCDC_PPISR register */
#define LCDC_PPISR_DONE_Pos                   _UINT32_(5)                                          /* (LCDC_PPISR) End of List Detected Position */
#define LCDC_PPISR_DONE_Msk                   (_UINT32_(0x1) << LCDC_PPISR_DONE_Pos)               /* (LCDC_PPISR) End of List Detected Mask */
#define LCDC_PPISR_DONE(value)                (LCDC_PPISR_DONE_Msk & (_UINT32_(value) << LCDC_PPISR_DONE_Pos)) /* Assigment of value for DONE in the LCDC_PPISR register */
#define LCDC_PPISR_Msk                        _UINT32_(0x0000003C)                                 /* (LCDC_PPISR) Register Mask  */


/* -------- LCDC_PPHEAD : (LCDC Offset: 0x55C) (R/W 32) Post Processing Head Register -------- */
#define LCDC_PPHEAD_HEAD_Pos                  _UINT32_(2)                                          /* (LCDC_PPHEAD) DMA Head Pointer Position */
#define LCDC_PPHEAD_HEAD_Msk                  (_UINT32_(0x3FFFFFFF) << LCDC_PPHEAD_HEAD_Pos)       /* (LCDC_PPHEAD) DMA Head Pointer Mask */
#define LCDC_PPHEAD_HEAD(value)               (LCDC_PPHEAD_HEAD_Msk & (_UINT32_(value) << LCDC_PPHEAD_HEAD_Pos)) /* Assigment of value for HEAD in the LCDC_PPHEAD register */
#define LCDC_PPHEAD_Msk                       _UINT32_(0xFFFFFFFC)                                 /* (LCDC_PPHEAD) Register Mask  */


/* -------- LCDC_PPADDR : (LCDC Offset: 0x560) (R/W 32) Post Processing Address Register -------- */
#define LCDC_PPADDR_ADDR_Pos                  _UINT32_(0)                                          /* (LCDC_PPADDR) DMA Transfer Start Address Position */
#define LCDC_PPADDR_ADDR_Msk                  (_UINT32_(0xFFFFFFFF) << LCDC_PPADDR_ADDR_Pos)       /* (LCDC_PPADDR) DMA Transfer Start Address Mask */
#define LCDC_PPADDR_ADDR(value)               (LCDC_PPADDR_ADDR_Msk & (_UINT32_(value) << LCDC_PPADDR_ADDR_Pos)) /* Assigment of value for ADDR in the LCDC_PPADDR register */
#define LCDC_PPADDR_Msk                       _UINT32_(0xFFFFFFFF)                                 /* (LCDC_PPADDR) Register Mask  */


