Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/test_app/firmware/src/packs/ATSAMA5D29_DFP/component/lcdc.h
/* -------- LCDC_PPCTRL : (LCDC Offset: 0x564) (R/W 32) Post Processing Control Register -------- */
#define LCDC_PPCTRL_DFETCH_Pos                _UINT32_(0)                                          /* (LCDC_PPCTRL) Transfer Descriptor Fetch Enable Position */
#define LCDC_PPCTRL_DFETCH_Msk                (_UINT32_(0x1) << LCDC_PPCTRL_DFETCH_Pos)            /* (LCDC_PPCTRL) Transfer Descriptor Fetch Enable Mask */
#define LCDC_PPCTRL_DFETCH(value)             (LCDC_PPCTRL_DFETCH_Msk & (_UINT32_(value) << LCDC_PPCTRL_DFETCH_Pos)) /* Assigment of value for DFETCH in the LCDC_PPCTRL register */
#define LCDC_PPCTRL_DMAIEN_Pos                _UINT32_(2)                                          /* (LCDC_PPCTRL) End of DMA Transfer Interrupt Enable Position */
#define LCDC_PPCTRL_DMAIEN_Msk                (_UINT32_(0x1) << LCDC_PPCTRL_DMAIEN_Pos)            /* (LCDC_PPCTRL) End of DMA Transfer Interrupt Enable Mask */
#define LCDC_PPCTRL_DMAIEN(value)             (LCDC_PPCTRL_DMAIEN_Msk & (_UINT32_(value) << LCDC_PPCTRL_DMAIEN_Pos)) /* Assigment of value for DMAIEN in the LCDC_PPCTRL register */
#define LCDC_PPCTRL_DSCRIEN_Pos               _UINT32_(3)                                          /* (LCDC_PPCTRL) Descriptor Loaded Interrupt Enable Position */
#define LCDC_PPCTRL_DSCRIEN_Msk               (_UINT32_(0x1) << LCDC_PPCTRL_DSCRIEN_Pos)           /* (LCDC_PPCTRL) Descriptor Loaded Interrupt Enable Mask */
#define LCDC_PPCTRL_DSCRIEN(value)            (LCDC_PPCTRL_DSCRIEN_Msk & (_UINT32_(value) << LCDC_PPCTRL_DSCRIEN_Pos)) /* Assigment of value for DSCRIEN in the LCDC_PPCTRL register */
#define LCDC_PPCTRL_ADDIEN_Pos                _UINT32_(4)                                          /* (LCDC_PPCTRL) Add Head Descriptor to Queue Interrupt Enable Position */
#define LCDC_PPCTRL_ADDIEN_Msk                (_UINT32_(0x1) << LCDC_PPCTRL_ADDIEN_Pos)            /* (LCDC_PPCTRL) Add Head Descriptor to Queue Interrupt Enable Mask */
#define LCDC_PPCTRL_ADDIEN(value)             (LCDC_PPCTRL_ADDIEN_Msk & (_UINT32_(value) << LCDC_PPCTRL_ADDIEN_Pos)) /* Assigment of value for ADDIEN in the LCDC_PPCTRL register */
#define LCDC_PPCTRL_DONEIEN_Pos               _UINT32_(5)                                          /* (LCDC_PPCTRL) End of List Interrupt Enable Position */
#define LCDC_PPCTRL_DONEIEN_Msk               (_UINT32_(0x1) << LCDC_PPCTRL_DONEIEN_Pos)           /* (LCDC_PPCTRL) End of List Interrupt Enable Mask */
#define LCDC_PPCTRL_DONEIEN(value)            (LCDC_PPCTRL_DONEIEN_Msk & (_UINT32_(value) << LCDC_PPCTRL_DONEIEN_Pos)) /* Assigment of value for DONEIEN in the LCDC_PPCTRL register */
#define LCDC_PPCTRL_Msk                       _UINT32_(0x0000003D)                                 /* (LCDC_PPCTRL) Register Mask  */


/* -------- LCDC_PPNEXT : (LCDC Offset: 0x568) (R/W 32) Post Processing Next Register -------- */
#define LCDC_PPNEXT_NEXT_Pos                  _UINT32_(0)                                          /* (LCDC_PPNEXT) DMA Descriptor Next Address Position */
#define LCDC_PPNEXT_NEXT_Msk                  (_UINT32_(0xFFFFFFFF) << LCDC_PPNEXT_NEXT_Pos)       /* (LCDC_PPNEXT) DMA Descriptor Next Address Mask */
#define LCDC_PPNEXT_NEXT(value)               (LCDC_PPNEXT_NEXT_Msk & (_UINT32_(value) << LCDC_PPNEXT_NEXT_Pos)) /* Assigment of value for NEXT in the LCDC_PPNEXT register */
#define LCDC_PPNEXT_Msk                       _UINT32_(0xFFFFFFFF)                                 /* (LCDC_PPNEXT) Register Mask  */


/* -------- LCDC_PPCFG0 : (LCDC Offset: 0x56C) (R/W 32) Post Processing Configuration Register 0 -------- */
#define LCDC_PPCFG0_SIF_Pos                   _UINT32_(0)                                          /* (LCDC_PPCFG0) Source Interface Position */
#define LCDC_PPCFG0_SIF_Msk                   (_UINT32_(0x1) << LCDC_PPCFG0_SIF_Pos)               /* (LCDC_PPCFG0) Source Interface Mask */
#define LCDC_PPCFG0_SIF(value)                (LCDC_PPCFG0_SIF_Msk & (_UINT32_(value) << LCDC_PPCFG0_SIF_Pos)) /* Assigment of value for SIF in the LCDC_PPCFG0 register */
#define LCDC_PPCFG0_BLEN_Pos                  _UINT32_(4)                                          /* (LCDC_PPCFG0) AHB Burst Length Position */
#define LCDC_PPCFG0_BLEN_Msk                  (_UINT32_(0x3) << LCDC_PPCFG0_BLEN_Pos)              /* (LCDC_PPCFG0) AHB Burst Length Mask */
#define LCDC_PPCFG0_BLEN(value)               (LCDC_PPCFG0_BLEN_Msk & (_UINT32_(value) << LCDC_PPCFG0_BLEN_Pos)) /* Assigment of value for BLEN in the LCDC_PPCFG0 register */
#define LCDC_PPCFG0_DLBO_Pos                  _UINT32_(8)                                          /* (LCDC_PPCFG0) Defined Length Burst Only For Channel Bus Transaction Position */
#define LCDC_PPCFG0_DLBO_Msk                  (_UINT32_(0x1) << LCDC_PPCFG0_DLBO_Pos)              /* (LCDC_PPCFG0) Defined Length Burst Only For Channel Bus Transaction Mask */
#define LCDC_PPCFG0_DLBO(value)               (LCDC_PPCFG0_DLBO_Msk & (_UINT32_(value) << LCDC_PPCFG0_DLBO_Pos)) /* Assigment of value for DLBO in the LCDC_PPCFG0 register */
#define LCDC_PPCFG0_Msk                       _UINT32_(0x00000131)                                 /* (LCDC_PPCFG0) Register Mask  */


/* -------- LCDC_PPCFG1 : (LCDC Offset: 0x570) (R/W 32) Post Processing Configuration Register 1 -------- */
#define LCDC_PPCFG1_PPMODE_Pos                _UINT32_(0)                                          /* (LCDC_PPCFG1) Post Processing Output Format Selection Position */
#define LCDC_PPCFG1_PPMODE_Msk                (_UINT32_(0x7) << LCDC_PPCFG1_PPMODE_Pos)            /* (LCDC_PPCFG1) Post Processing Output Format Selection Mask */
#define LCDC_PPCFG1_PPMODE(value)             (LCDC_PPCFG1_PPMODE_Msk & (_UINT32_(value) << LCDC_PPCFG1_PPMODE_Pos)) /* Assigment of value for PPMODE in the LCDC_PPCFG1 register */
#define   LCDC_PPCFG1_PPMODE_PPMODE_RGB_16BPP_Val _UINT32_(0x0)                                        /* (LCDC_PPCFG1) RGB 16 bpp  */
#define   LCDC_PPCFG1_PPMODE_PPMODE_RGB_24BPP_PACKED_Val _UINT32_(0x1)                                        /* (LCDC_PPCFG1) RGB 24 bpp PACKED  */
#define   LCDC_PPCFG1_PPMODE_PPMODE_RGB_24BPP_UNPACKED_Val _UINT32_(0x2)                                        /* (LCDC_PPCFG1) RGB 24 bpp UNPACKED  */
#define   LCDC_PPCFG1_PPMODE_PPMODE_YCBCR_422_MODE0_Val _UINT32_(0x3)                                        /* (LCDC_PPCFG1) YCbCr 422 16 bpp (Mode 0)  */
#define   LCDC_PPCFG1_PPMODE_PPMODE_YCBCR_422_MODE1_Val _UINT32_(0x4)                                        /* (LCDC_PPCFG1) YCbCr 422 16 bpp (Mode 1)  */
#define   LCDC_PPCFG1_PPMODE_PPMODE_YCBCR_422_MODE2_Val _UINT32_(0x5)                                        /* (LCDC_PPCFG1) YCbCr 422 16 bpp (Mode 2)  */
#define   LCDC_PPCFG1_PPMODE_PPMODE_YCBCR_422_MODE3_Val _UINT32_(0x6)                                        /* (LCDC_PPCFG1) YCbCr 422 16 bpp (Mode 3)  */
#define LCDC_PPCFG1_PPMODE_PPMODE_RGB_16BPP   (LCDC_PPCFG1_PPMODE_PPMODE_RGB_16BPP_Val << LCDC_PPCFG1_PPMODE_Pos) /* (LCDC_PPCFG1) RGB 16 bpp Position  */
#define LCDC_PPCFG1_PPMODE_PPMODE_RGB_24BPP_PACKED (LCDC_PPCFG1_PPMODE_PPMODE_RGB_24BPP_PACKED_Val << LCDC_PPCFG1_PPMODE_Pos) /* (LCDC_PPCFG1) RGB 24 bpp PACKED Position  */
#define LCDC_PPCFG1_PPMODE_PPMODE_RGB_24BPP_UNPACKED (LCDC_PPCFG1_PPMODE_PPMODE_RGB_24BPP_UNPACKED_Val << LCDC_PPCFG1_PPMODE_Pos) /* (LCDC_PPCFG1) RGB 24 bpp UNPACKED Position  */
#define LCDC_PPCFG1_PPMODE_PPMODE_YCBCR_422_MODE0 (LCDC_PPCFG1_PPMODE_PPMODE_YCBCR_422_MODE0_Val << LCDC_PPCFG1_PPMODE_Pos) /* (LCDC_PPCFG1) YCbCr 422 16 bpp (Mode 0) Position  */
#define LCDC_PPCFG1_PPMODE_PPMODE_YCBCR_422_MODE1 (LCDC_PPCFG1_PPMODE_PPMODE_YCBCR_422_MODE1_Val << LCDC_PPCFG1_PPMODE_Pos) /* (LCDC_PPCFG1) YCbCr 422 16 bpp (Mode 1) Position  */
#define LCDC_PPCFG1_PPMODE_PPMODE_YCBCR_422_MODE2 (LCDC_PPCFG1_PPMODE_PPMODE_YCBCR_422_MODE2_Val << LCDC_PPCFG1_PPMODE_Pos) /* (LCDC_PPCFG1) YCbCr 422 16 bpp (Mode 2) Position  */
#define LCDC_PPCFG1_PPMODE_PPMODE_YCBCR_422_MODE3 (LCDC_PPCFG1_PPMODE_PPMODE_YCBCR_422_MODE3_Val << LCDC_PPCFG1_PPMODE_Pos) /* (LCDC_PPCFG1) YCbCr 422 16 bpp (Mode 3) Position  */
#define LCDC_PPCFG1_ITUBT601_Pos              _UINT32_(4)                                          /* (LCDC_PPCFG1) Color Space Conversion Luminance Position */
#define LCDC_PPCFG1_ITUBT601_Msk              (_UINT32_(0x1) << LCDC_PPCFG1_ITUBT601_Pos)          /* (LCDC_PPCFG1) Color Space Conversion Luminance Mask */
#define LCDC_PPCFG1_ITUBT601(value)           (LCDC_PPCFG1_ITUBT601_Msk & (_UINT32_(value) << LCDC_PPCFG1_ITUBT601_Pos)) /* Assigment of value for ITUBT601 in the LCDC_PPCFG1 register */
#define LCDC_PPCFG1_Msk                       _UINT32_(0x00000017)                                 /* (LCDC_PPCFG1) Register Mask  */

#define LCDC_PPCFG1_ITUBT_Pos                 _UINT32_(4)                                          /* (LCDC_PPCFG1 Position) Color Space Conversion Luminance */
#define LCDC_PPCFG1_ITUBT_Msk                 (_UINT32_(0x1) << LCDC_PPCFG1_ITUBT_Pos)             /* (LCDC_PPCFG1 Mask) ITUBT */
#define LCDC_PPCFG1_ITUBT(value)              (LCDC_PPCFG1_ITUBT_Msk & (_UINT32_(value) << LCDC_PPCFG1_ITUBT_Pos)) 

/* -------- LCDC_PPCFG2 : (LCDC Offset: 0x574) (R/W 32) Post Processing Configuration Register 2 -------- */
#define LCDC_PPCFG2_XSTRIDE_Pos               _UINT32_(0)                                          /* (LCDC_PPCFG2) Horizontal Stride Position */
#define LCDC_PPCFG2_XSTRIDE_Msk               (_UINT32_(0xFFFFFFFF) << LCDC_PPCFG2_XSTRIDE_Pos)    /* (LCDC_PPCFG2) Horizontal Stride Mask */
#define LCDC_PPCFG2_XSTRIDE(value)            (LCDC_PPCFG2_XSTRIDE_Msk & (_UINT32_(value) << LCDC_PPCFG2_XSTRIDE_Pos)) /* Assigment of value for XSTRIDE in the LCDC_PPCFG2 register */
#define LCDC_PPCFG2_Msk                       _UINT32_(0xFFFFFFFF)                                 /* (LCDC_PPCFG2) Register Mask  */


/* -------- LCDC_PPCFG3 : (LCDC Offset: 0x578) (R/W 32) Post Processing Configuration Register 3 -------- */
#define LCDC_PPCFG3_CSCYR_Pos                 _UINT32_(0)                                          /* (LCDC_PPCFG3) Color Space Conversion R coefficient for Luminance component, signed format, step set to 1/1024 Position */
#define LCDC_PPCFG3_CSCYR_Msk                 (_UINT32_(0x3FF) << LCDC_PPCFG3_CSCYR_Pos)           /* (LCDC_PPCFG3) Color Space Conversion R coefficient for Luminance component, signed format, step set to 1/1024 Mask */
#define LCDC_PPCFG3_CSCYR(value)              (LCDC_PPCFG3_CSCYR_Msk & (_UINT32_(value) << LCDC_PPCFG3_CSCYR_Pos)) /* Assigment of value for CSCYR in the LCDC_PPCFG3 register */
#define LCDC_PPCFG3_CSCYG_Pos                 _UINT32_(10)                                         /* (LCDC_PPCFG3) Color Space Conversion G coefficient for Luminance component, signed format, step set to 1/512 Position */
#define LCDC_PPCFG3_CSCYG_Msk                 (_UINT32_(0x3FF) << LCDC_PPCFG3_CSCYG_Pos)           /* (LCDC_PPCFG3) Color Space Conversion G coefficient for Luminance component, signed format, step set to 1/512 Mask */
#define LCDC_PPCFG3_CSCYG(value)              (LCDC_PPCFG3_CSCYG_Msk & (_UINT32_(value) << LCDC_PPCFG3_CSCYG_Pos)) /* Assigment of value for CSCYG in the LCDC_PPCFG3 register */
#define LCDC_PPCFG3_CSCYB_Pos                 _UINT32_(20)                                         /* (LCDC_PPCFG3) Color Space Conversion B coefficient for Luminance component, signed format, step set to 1/1024 Position */
#define LCDC_PPCFG3_CSCYB_Msk                 (_UINT32_(0x3FF) << LCDC_PPCFG3_CSCYB_Pos)           /* (LCDC_PPCFG3) Color Space Conversion B coefficient for Luminance component, signed format, step set to 1/1024 Mask */
#define LCDC_PPCFG3_CSCYB(value)              (LCDC_PPCFG3_CSCYB_Msk & (_UINT32_(value) << LCDC_PPCFG3_CSCYB_Pos)) /* Assigment of value for CSCYB in the LCDC_PPCFG3 register */
#define LCDC_PPCFG3_CSCYOFF_Pos               _UINT32_(30)                                         /* (LCDC_PPCFG3) Color Space Conversion Luminance Offset Position */
#define LCDC_PPCFG3_CSCYOFF_Msk               (_UINT32_(0x1) << LCDC_PPCFG3_CSCYOFF_Pos)           /* (LCDC_PPCFG3) Color Space Conversion Luminance Offset Mask */
#define LCDC_PPCFG3_CSCYOFF(value)            (LCDC_PPCFG3_CSCYOFF_Msk & (_UINT32_(value) << LCDC_PPCFG3_CSCYOFF_Pos)) /* Assigment of value for CSCYOFF in the LCDC_PPCFG3 register */
#define LCDC_PPCFG3_Msk                       _UINT32_(0x7FFFFFFF)                                 /* (LCDC_PPCFG3) Register Mask  */


/* -------- LCDC_PPCFG4 : (LCDC Offset: 0x57C) (R/W 32) Post Processing Configuration Register 4 -------- */
#define LCDC_PPCFG4_CSCUR_Pos                 _UINT32_(0)                                          /* (LCDC_PPCFG4) Color Space Conversion R coefficient for Chrominance B component, signed format. (step 1/1024) Position */
#define LCDC_PPCFG4_CSCUR_Msk                 (_UINT32_(0x3FF) << LCDC_PPCFG4_CSCUR_Pos)           /* (LCDC_PPCFG4) Color Space Conversion R coefficient for Chrominance B component, signed format. (step 1/1024) Mask */
#define LCDC_PPCFG4_CSCUR(value)              (LCDC_PPCFG4_CSCUR_Msk & (_UINT32_(value) << LCDC_PPCFG4_CSCUR_Pos)) /* Assigment of value for CSCUR in the LCDC_PPCFG4 register */
#define LCDC_PPCFG4_CSCUG_Pos                 _UINT32_(10)                                         /* (LCDC_PPCFG4) Color Space Conversion G coefficient for Chrominance B component, signed format. (step 1/512) Position */
#define LCDC_PPCFG4_CSCUG_Msk                 (_UINT32_(0x3FF) << LCDC_PPCFG4_CSCUG_Pos)           /* (LCDC_PPCFG4) Color Space Conversion G coefficient for Chrominance B component, signed format. (step 1/512) Mask */
#define LCDC_PPCFG4_CSCUG(value)              (LCDC_PPCFG4_CSCUG_Msk & (_UINT32_(value) << LCDC_PPCFG4_CSCUG_Pos)) /* Assigment of value for CSCUG in the LCDC_PPCFG4 register */
#define LCDC_PPCFG4_CSCUB_Pos                 _UINT32_(20)                                         /* (LCDC_PPCFG4) Color Space Conversion B coefficient for Chrominance B component, signed format. (step 1/512) Position */
#define LCDC_PPCFG4_CSCUB_Msk                 (_UINT32_(0x3FF) << LCDC_PPCFG4_CSCUB_Pos)           /* (LCDC_PPCFG4) Color Space Conversion B coefficient for Chrominance B component, signed format. (step 1/512) Mask */
#define LCDC_PPCFG4_CSCUB(value)              (LCDC_PPCFG4_CSCUB_Msk & (_UINT32_(value) << LCDC_PPCFG4_CSCUB_Pos)) /* Assigment of value for CSCUB in the LCDC_PPCFG4 register */
#define LCDC_PPCFG4_CSCUOFF_Pos               _UINT32_(30)                                         /* (LCDC_PPCFG4) Color Space Conversion Chrominance B Offset Position */
#define LCDC_PPCFG4_CSCUOFF_Msk               (_UINT32_(0x1) << LCDC_PPCFG4_CSCUOFF_Pos)           /* (LCDC_PPCFG4) Color Space Conversion Chrominance B Offset Mask */
#define LCDC_PPCFG4_CSCUOFF(value)            (LCDC_PPCFG4_CSCUOFF_Msk & (_UINT32_(value) << LCDC_PPCFG4_CSCUOFF_Pos)) /* Assigment of value for CSCUOFF in the LCDC_PPCFG4 register */
#define LCDC_PPCFG4_Msk                       _UINT32_(0x7FFFFFFF)                                 /* (LCDC_PPCFG4) Register Mask  */


