Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/test_app/firmware/src/packs/ATSAMA5D29_DFP/component/lcdc.h
/* -------- LCDC_PPCFG5 : (LCDC Offset: 0x580) (R/W 32) Post Processing Configuration Register 5 -------- */
#define LCDC_PPCFG5_CSCVR_Pos                 _UINT32_(0)                                          /* (LCDC_PPCFG5) Color Space Conversion R coefficient for Chrominance R component, signed format. (step 1/1024) Position */
#define LCDC_PPCFG5_CSCVR_Msk                 (_UINT32_(0x3FF) << LCDC_PPCFG5_CSCVR_Pos)           /* (LCDC_PPCFG5) Color Space Conversion R coefficient for Chrominance R component, signed format. (step 1/1024) Mask */
#define LCDC_PPCFG5_CSCVR(value)              (LCDC_PPCFG5_CSCVR_Msk & (_UINT32_(value) << LCDC_PPCFG5_CSCVR_Pos)) /* Assigment of value for CSCVR in the LCDC_PPCFG5 register */
#define LCDC_PPCFG5_CSCVG_Pos                 _UINT32_(10)                                         /* (LCDC_PPCFG5) Color Space Conversion G coefficient for Chrominance R component, signed format. (step 1/512) Position */
#define LCDC_PPCFG5_CSCVG_Msk                 (_UINT32_(0x3FF) << LCDC_PPCFG5_CSCVG_Pos)           /* (LCDC_PPCFG5) Color Space Conversion G coefficient for Chrominance R component, signed format. (step 1/512) Mask */
#define LCDC_PPCFG5_CSCVG(value)              (LCDC_PPCFG5_CSCVG_Msk & (_UINT32_(value) << LCDC_PPCFG5_CSCVG_Pos)) /* Assigment of value for CSCVG in the LCDC_PPCFG5 register */
#define LCDC_PPCFG5_CSCVB_Pos                 _UINT32_(20)                                         /* (LCDC_PPCFG5) Color Space Conversion B coefficient for Chrominance R component, signed format. (step 1/1024) Position */
#define LCDC_PPCFG5_CSCVB_Msk                 (_UINT32_(0x3FF) << LCDC_PPCFG5_CSCVB_Pos)           /* (LCDC_PPCFG5) Color Space Conversion B coefficient for Chrominance R component, signed format. (step 1/1024) Mask */
#define LCDC_PPCFG5_CSCVB(value)              (LCDC_PPCFG5_CSCVB_Msk & (_UINT32_(value) << LCDC_PPCFG5_CSCVB_Pos)) /* Assigment of value for CSCVB in the LCDC_PPCFG5 register */
#define LCDC_PPCFG5_CSCVOFF_Pos               _UINT32_(30)                                         /* (LCDC_PPCFG5) Color Space Conversion Chrominance R Offset Position */
#define LCDC_PPCFG5_CSCVOFF_Msk               (_UINT32_(0x1) << LCDC_PPCFG5_CSCVOFF_Pos)           /* (LCDC_PPCFG5) Color Space Conversion Chrominance R Offset Mask */
#define LCDC_PPCFG5_CSCVOFF(value)            (LCDC_PPCFG5_CSCVOFF_Msk & (_UINT32_(value) << LCDC_PPCFG5_CSCVOFF_Pos)) /* Assigment of value for CSCVOFF in the LCDC_PPCFG5 register */
#define LCDC_PPCFG5_Msk                       _UINT32_(0x7FFFFFFF)                                 /* (LCDC_PPCFG5) Register Mask  */


/* -------- LCDC_BASECLUT : (LCDC Offset: 0x600) (R/W 32) Base CLUT Register -------- */
#define LCDC_BASECLUT_BCLUT_Pos               _UINT32_(0)                                          /* (LCDC_BASECLUT) Blue Color Entry Position */
#define LCDC_BASECLUT_BCLUT_Msk               (_UINT32_(0xFF) << LCDC_BASECLUT_BCLUT_Pos)          /* (LCDC_BASECLUT) Blue Color Entry Mask */
#define LCDC_BASECLUT_BCLUT(value)            (LCDC_BASECLUT_BCLUT_Msk & (_UINT32_(value) << LCDC_BASECLUT_BCLUT_Pos)) /* Assigment of value for BCLUT in the LCDC_BASECLUT register */
#define LCDC_BASECLUT_GCLUT_Pos               _UINT32_(8)                                          /* (LCDC_BASECLUT) Green Color Entry Position */
#define LCDC_BASECLUT_GCLUT_Msk               (_UINT32_(0xFF) << LCDC_BASECLUT_GCLUT_Pos)          /* (LCDC_BASECLUT) Green Color Entry Mask */
#define LCDC_BASECLUT_GCLUT(value)            (LCDC_BASECLUT_GCLUT_Msk & (_UINT32_(value) << LCDC_BASECLUT_GCLUT_Pos)) /* Assigment of value for GCLUT in the LCDC_BASECLUT register */
#define LCDC_BASECLUT_RCLUT_Pos               _UINT32_(16)                                         /* (LCDC_BASECLUT) Red Color Entry Position */
#define LCDC_BASECLUT_RCLUT_Msk               (_UINT32_(0xFF) << LCDC_BASECLUT_RCLUT_Pos)          /* (LCDC_BASECLUT) Red Color Entry Mask */
#define LCDC_BASECLUT_RCLUT(value)            (LCDC_BASECLUT_RCLUT_Msk & (_UINT32_(value) << LCDC_BASECLUT_RCLUT_Pos)) /* Assigment of value for RCLUT in the LCDC_BASECLUT register */
#define LCDC_BASECLUT_Msk                     _UINT32_(0x00FFFFFF)                                 /* (LCDC_BASECLUT) Register Mask  */


/* -------- LCDC_OVR1CLUT : (LCDC Offset: 0xA00) (R/W 32) Overlay 1 CLUT Register -------- */
#define LCDC_OVR1CLUT_BCLUT_Pos               _UINT32_(0)                                          /* (LCDC_OVR1CLUT) Blue Color Entry Position */
#define LCDC_OVR1CLUT_BCLUT_Msk               (_UINT32_(0xFF) << LCDC_OVR1CLUT_BCLUT_Pos)          /* (LCDC_OVR1CLUT) Blue Color Entry Mask */
#define LCDC_OVR1CLUT_BCLUT(value)            (LCDC_OVR1CLUT_BCLUT_Msk & (_UINT32_(value) << LCDC_OVR1CLUT_BCLUT_Pos)) /* Assigment of value for BCLUT in the LCDC_OVR1CLUT register */
#define LCDC_OVR1CLUT_GCLUT_Pos               _UINT32_(8)                                          /* (LCDC_OVR1CLUT) Green Color Entry Position */
#define LCDC_OVR1CLUT_GCLUT_Msk               (_UINT32_(0xFF) << LCDC_OVR1CLUT_GCLUT_Pos)          /* (LCDC_OVR1CLUT) Green Color Entry Mask */
#define LCDC_OVR1CLUT_GCLUT(value)            (LCDC_OVR1CLUT_GCLUT_Msk & (_UINT32_(value) << LCDC_OVR1CLUT_GCLUT_Pos)) /* Assigment of value for GCLUT in the LCDC_OVR1CLUT register */
#define LCDC_OVR1CLUT_RCLUT_Pos               _UINT32_(16)                                         /* (LCDC_OVR1CLUT) Red Color Entry Position */
#define LCDC_OVR1CLUT_RCLUT_Msk               (_UINT32_(0xFF) << LCDC_OVR1CLUT_RCLUT_Pos)          /* (LCDC_OVR1CLUT) Red Color Entry Mask */
#define LCDC_OVR1CLUT_RCLUT(value)            (LCDC_OVR1CLUT_RCLUT_Msk & (_UINT32_(value) << LCDC_OVR1CLUT_RCLUT_Pos)) /* Assigment of value for RCLUT in the LCDC_OVR1CLUT register */
#define LCDC_OVR1CLUT_ACLUT_Pos               _UINT32_(24)                                         /* (LCDC_OVR1CLUT) Alpha Color Entry Position */
#define LCDC_OVR1CLUT_ACLUT_Msk               (_UINT32_(0xFF) << LCDC_OVR1CLUT_ACLUT_Pos)          /* (LCDC_OVR1CLUT) Alpha Color Entry Mask */
#define LCDC_OVR1CLUT_ACLUT(value)            (LCDC_OVR1CLUT_ACLUT_Msk & (_UINT32_(value) << LCDC_OVR1CLUT_ACLUT_Pos)) /* Assigment of value for ACLUT in the LCDC_OVR1CLUT register */
#define LCDC_OVR1CLUT_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (LCDC_OVR1CLUT) Register Mask  */


