Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/test_app/firmware/src/packs/ATSAMA5D29_DFP/component/lcdc.h
#define LCDC_HEOCLUT76_REG_OFST        _UINT32_(0x1330)    /* (LCDC_HEOCLUT76) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT77_REG_OFST        _UINT32_(0x1334)    /* (LCDC_HEOCLUT77) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT78_REG_OFST        _UINT32_(0x1338)    /* (LCDC_HEOCLUT78) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT79_REG_OFST        _UINT32_(0x133C)    /* (LCDC_HEOCLUT79) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT80_REG_OFST        _UINT32_(0x1340)    /* (LCDC_HEOCLUT80) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT81_REG_OFST        _UINT32_(0x1344)    /* (LCDC_HEOCLUT81) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT82_REG_OFST        _UINT32_(0x1348)    /* (LCDC_HEOCLUT82) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT83_REG_OFST        _UINT32_(0x134C)    /* (LCDC_HEOCLUT83) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT84_REG_OFST        _UINT32_(0x1350)    /* (LCDC_HEOCLUT84) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT85_REG_OFST        _UINT32_(0x1354)    /* (LCDC_HEOCLUT85) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT86_REG_OFST        _UINT32_(0x1358)    /* (LCDC_HEOCLUT86) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT87_REG_OFST        _UINT32_(0x135C)    /* (LCDC_HEOCLUT87) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT88_REG_OFST        _UINT32_(0x1360)    /* (LCDC_HEOCLUT88) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT89_REG_OFST        _UINT32_(0x1364)    /* (LCDC_HEOCLUT89) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT90_REG_OFST        _UINT32_(0x1368)    /* (LCDC_HEOCLUT90) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT91_REG_OFST        _UINT32_(0x136C)    /* (LCDC_HEOCLUT91) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT92_REG_OFST        _UINT32_(0x1370)    /* (LCDC_HEOCLUT92) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT93_REG_OFST        _UINT32_(0x1374)    /* (LCDC_HEOCLUT93) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT94_REG_OFST        _UINT32_(0x1378)    /* (LCDC_HEOCLUT94) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT95_REG_OFST        _UINT32_(0x137C)    /* (LCDC_HEOCLUT95) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT96_REG_OFST        _UINT32_(0x1380)    /* (LCDC_HEOCLUT96) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT97_REG_OFST        _UINT32_(0x1384)    /* (LCDC_HEOCLUT97) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT98_REG_OFST        _UINT32_(0x1388)    /* (LCDC_HEOCLUT98) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT99_REG_OFST        _UINT32_(0x138C)    /* (LCDC_HEOCLUT99) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT100_REG_OFST       _UINT32_(0x1390)    /* (LCDC_HEOCLUT100) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT101_REG_OFST       _UINT32_(0x1394)    /* (LCDC_HEOCLUT101) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT102_REG_OFST       _UINT32_(0x1398)    /* (LCDC_HEOCLUT102) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT103_REG_OFST       _UINT32_(0x139C)    /* (LCDC_HEOCLUT103) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT104_REG_OFST       _UINT32_(0x13A0)    /* (LCDC_HEOCLUT104) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT105_REG_OFST       _UINT32_(0x13A4)    /* (LCDC_HEOCLUT105) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT106_REG_OFST       _UINT32_(0x13A8)    /* (LCDC_HEOCLUT106) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT107_REG_OFST       _UINT32_(0x13AC)    /* (LCDC_HEOCLUT107) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT108_REG_OFST       _UINT32_(0x13B0)    /* (LCDC_HEOCLUT108) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT109_REG_OFST       _UINT32_(0x13B4)    /* (LCDC_HEOCLUT109) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT110_REG_OFST       _UINT32_(0x13B8)    /* (LCDC_HEOCLUT110) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT111_REG_OFST       _UINT32_(0x13BC)    /* (LCDC_HEOCLUT111) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT112_REG_OFST       _UINT32_(0x13C0)    /* (LCDC_HEOCLUT112) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT113_REG_OFST       _UINT32_(0x13C4)    /* (LCDC_HEOCLUT113) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT114_REG_OFST       _UINT32_(0x13C8)    /* (LCDC_HEOCLUT114) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT115_REG_OFST       _UINT32_(0x13CC)    /* (LCDC_HEOCLUT115) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT116_REG_OFST       _UINT32_(0x13D0)    /* (LCDC_HEOCLUT116) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT117_REG_OFST       _UINT32_(0x13D4)    /* (LCDC_HEOCLUT117) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT118_REG_OFST       _UINT32_(0x13D8)    /* (LCDC_HEOCLUT118) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT119_REG_OFST       _UINT32_(0x13DC)    /* (LCDC_HEOCLUT119) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT120_REG_OFST       _UINT32_(0x13E0)    /* (LCDC_HEOCLUT120) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT121_REG_OFST       _UINT32_(0x13E4)    /* (LCDC_HEOCLUT121) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT122_REG_OFST       _UINT32_(0x13E8)    /* (LCDC_HEOCLUT122) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT123_REG_OFST       _UINT32_(0x13EC)    /* (LCDC_HEOCLUT123) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT124_REG_OFST       _UINT32_(0x13F0)    /* (LCDC_HEOCLUT124) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT125_REG_OFST       _UINT32_(0x13F4)    /* (LCDC_HEOCLUT125) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT126_REG_OFST       _UINT32_(0x13F8)    /* (LCDC_HEOCLUT126) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT127_REG_OFST       _UINT32_(0x13FC)    /* (LCDC_HEOCLUT127) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT128_REG_OFST       _UINT32_(0x1400)    /* (LCDC_HEOCLUT128) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT129_REG_OFST       _UINT32_(0x1404)    /* (LCDC_HEOCLUT129) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT130_REG_OFST       _UINT32_(0x1408)    /* (LCDC_HEOCLUT130) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT131_REG_OFST       _UINT32_(0x140C)    /* (LCDC_HEOCLUT131) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT132_REG_OFST       _UINT32_(0x1410)    /* (LCDC_HEOCLUT132) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT133_REG_OFST       _UINT32_(0x1414)    /* (LCDC_HEOCLUT133) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT134_REG_OFST       _UINT32_(0x1418)    /* (LCDC_HEOCLUT134) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT135_REG_OFST       _UINT32_(0x141C)    /* (LCDC_HEOCLUT135) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT136_REG_OFST       _UINT32_(0x1420)    /* (LCDC_HEOCLUT136) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT137_REG_OFST       _UINT32_(0x1424)    /* (LCDC_HEOCLUT137) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT138_REG_OFST       _UINT32_(0x1428)    /* (LCDC_HEOCLUT138) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT139_REG_OFST       _UINT32_(0x142C)    /* (LCDC_HEOCLUT139) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT140_REG_OFST       _UINT32_(0x1430)    /* (LCDC_HEOCLUT140) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT141_REG_OFST       _UINT32_(0x1434)    /* (LCDC_HEOCLUT141) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT142_REG_OFST       _UINT32_(0x1438)    /* (LCDC_HEOCLUT142) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT143_REG_OFST       _UINT32_(0x143C)    /* (LCDC_HEOCLUT143) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT144_REG_OFST       _UINT32_(0x1440)    /* (LCDC_HEOCLUT144) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT145_REG_OFST       _UINT32_(0x1444)    /* (LCDC_HEOCLUT145) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT146_REG_OFST       _UINT32_(0x1448)    /* (LCDC_HEOCLUT146) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT147_REG_OFST       _UINT32_(0x144C)    /* (LCDC_HEOCLUT147) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT148_REG_OFST       _UINT32_(0x1450)    /* (LCDC_HEOCLUT148) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT149_REG_OFST       _UINT32_(0x1454)    /* (LCDC_HEOCLUT149) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT150_REG_OFST       _UINT32_(0x1458)    /* (LCDC_HEOCLUT150) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT151_REG_OFST       _UINT32_(0x145C)    /* (LCDC_HEOCLUT151) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT152_REG_OFST       _UINT32_(0x1460)    /* (LCDC_HEOCLUT152) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT153_REG_OFST       _UINT32_(0x1464)    /* (LCDC_HEOCLUT153) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT154_REG_OFST       _UINT32_(0x1468)    /* (LCDC_HEOCLUT154) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT155_REG_OFST       _UINT32_(0x146C)    /* (LCDC_HEOCLUT155) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT156_REG_OFST       _UINT32_(0x1470)    /* (LCDC_HEOCLUT156) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT157_REG_OFST       _UINT32_(0x1474)    /* (LCDC_HEOCLUT157) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT158_REG_OFST       _UINT32_(0x1478)    /* (LCDC_HEOCLUT158) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT159_REG_OFST       _UINT32_(0x147C)    /* (LCDC_HEOCLUT159) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT160_REG_OFST       _UINT32_(0x1480)    /* (LCDC_HEOCLUT160) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT161_REG_OFST       _UINT32_(0x1484)    /* (LCDC_HEOCLUT161) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT162_REG_OFST       _UINT32_(0x1488)    /* (LCDC_HEOCLUT162) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT163_REG_OFST       _UINT32_(0x148C)    /* (LCDC_HEOCLUT163) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT164_REG_OFST       _UINT32_(0x1490)    /* (LCDC_HEOCLUT164) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT165_REG_OFST       _UINT32_(0x1494)    /* (LCDC_HEOCLUT165) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT166_REG_OFST       _UINT32_(0x1498)    /* (LCDC_HEOCLUT166) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT167_REG_OFST       _UINT32_(0x149C)    /* (LCDC_HEOCLUT167) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT168_REG_OFST       _UINT32_(0x14A0)    /* (LCDC_HEOCLUT168) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT169_REG_OFST       _UINT32_(0x14A4)    /* (LCDC_HEOCLUT169) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT170_REG_OFST       _UINT32_(0x14A8)    /* (LCDC_HEOCLUT170) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT171_REG_OFST       _UINT32_(0x14AC)    /* (LCDC_HEOCLUT171) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT172_REG_OFST       _UINT32_(0x14B0)    /* (LCDC_HEOCLUT172) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT173_REG_OFST       _UINT32_(0x14B4)    /* (LCDC_HEOCLUT173) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT174_REG_OFST       _UINT32_(0x14B8)    /* (LCDC_HEOCLUT174) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT175_REG_OFST       _UINT32_(0x14BC)    /* (LCDC_HEOCLUT175) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT176_REG_OFST       _UINT32_(0x14C0)    /* (LCDC_HEOCLUT176) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT177_REG_OFST       _UINT32_(0x14C4)    /* (LCDC_HEOCLUT177) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT178_REG_OFST       _UINT32_(0x14C8)    /* (LCDC_HEOCLUT178) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT179_REG_OFST       _UINT32_(0x14CC)    /* (LCDC_HEOCLUT179) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT180_REG_OFST       _UINT32_(0x14D0)    /* (LCDC_HEOCLUT180) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT181_REG_OFST       _UINT32_(0x14D4)    /* (LCDC_HEOCLUT181) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT182_REG_OFST       _UINT32_(0x14D8)    /* (LCDC_HEOCLUT182) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT183_REG_OFST       _UINT32_(0x14DC)    /* (LCDC_HEOCLUT183) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT184_REG_OFST       _UINT32_(0x14E0)    /* (LCDC_HEOCLUT184) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT185_REG_OFST       _UINT32_(0x14E4)    /* (LCDC_HEOCLUT185) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT186_REG_OFST       _UINT32_(0x14E8)    /* (LCDC_HEOCLUT186) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT187_REG_OFST       _UINT32_(0x14EC)    /* (LCDC_HEOCLUT187) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT188_REG_OFST       _UINT32_(0x14F0)    /* (LCDC_HEOCLUT188) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT189_REG_OFST       _UINT32_(0x14F4)    /* (LCDC_HEOCLUT189) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT190_REG_OFST       _UINT32_(0x14F8)    /* (LCDC_HEOCLUT190) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT191_REG_OFST       _UINT32_(0x14FC)    /* (LCDC_HEOCLUT191) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT192_REG_OFST       _UINT32_(0x1500)    /* (LCDC_HEOCLUT192) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT193_REG_OFST       _UINT32_(0x1504)    /* (LCDC_HEOCLUT193) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT194_REG_OFST       _UINT32_(0x1508)    /* (LCDC_HEOCLUT194) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT195_REG_OFST       _UINT32_(0x150C)    /* (LCDC_HEOCLUT195) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT196_REG_OFST       _UINT32_(0x1510)    /* (LCDC_HEOCLUT196) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT197_REG_OFST       _UINT32_(0x1514)    /* (LCDC_HEOCLUT197) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT198_REG_OFST       _UINT32_(0x1518)    /* (LCDC_HEOCLUT198) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT199_REG_OFST       _UINT32_(0x151C)    /* (LCDC_HEOCLUT199) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT200_REG_OFST       _UINT32_(0x1520)    /* (LCDC_HEOCLUT200) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT201_REG_OFST       _UINT32_(0x1524)    /* (LCDC_HEOCLUT201) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT202_REG_OFST       _UINT32_(0x1528)    /* (LCDC_HEOCLUT202) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT203_REG_OFST       _UINT32_(0x152C)    /* (LCDC_HEOCLUT203) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT204_REG_OFST       _UINT32_(0x1530)    /* (LCDC_HEOCLUT204) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT205_REG_OFST       _UINT32_(0x1534)    /* (LCDC_HEOCLUT205) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT206_REG_OFST       _UINT32_(0x1538)    /* (LCDC_HEOCLUT206) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT207_REG_OFST       _UINT32_(0x153C)    /* (LCDC_HEOCLUT207) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT208_REG_OFST       _UINT32_(0x1540)    /* (LCDC_HEOCLUT208) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT209_REG_OFST       _UINT32_(0x1544)    /* (LCDC_HEOCLUT209) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT210_REG_OFST       _UINT32_(0x1548)    /* (LCDC_HEOCLUT210) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT211_REG_OFST       _UINT32_(0x154C)    /* (LCDC_HEOCLUT211) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT212_REG_OFST       _UINT32_(0x1550)    /* (LCDC_HEOCLUT212) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT213_REG_OFST       _UINT32_(0x1554)    /* (LCDC_HEOCLUT213) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT214_REG_OFST       _UINT32_(0x1558)    /* (LCDC_HEOCLUT214) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT215_REG_OFST       _UINT32_(0x155C)    /* (LCDC_HEOCLUT215) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT216_REG_OFST       _UINT32_(0x1560)    /* (LCDC_HEOCLUT216) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT217_REG_OFST       _UINT32_(0x1564)    /* (LCDC_HEOCLUT217) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT218_REG_OFST       _UINT32_(0x1568)    /* (LCDC_HEOCLUT218) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT219_REG_OFST       _UINT32_(0x156C)    /* (LCDC_HEOCLUT219) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT220_REG_OFST       _UINT32_(0x1570)    /* (LCDC_HEOCLUT220) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT221_REG_OFST       _UINT32_(0x1574)    /* (LCDC_HEOCLUT221) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT222_REG_OFST       _UINT32_(0x1578)    /* (LCDC_HEOCLUT222) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT223_REG_OFST       _UINT32_(0x157C)    /* (LCDC_HEOCLUT223) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT224_REG_OFST       _UINT32_(0x1580)    /* (LCDC_HEOCLUT224) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT225_REG_OFST       _UINT32_(0x1584)    /* (LCDC_HEOCLUT225) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT226_REG_OFST       _UINT32_(0x1588)    /* (LCDC_HEOCLUT226) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT227_REG_OFST       _UINT32_(0x158C)    /* (LCDC_HEOCLUT227) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT228_REG_OFST       _UINT32_(0x1590)    /* (LCDC_HEOCLUT228) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT229_REG_OFST       _UINT32_(0x1594)    /* (LCDC_HEOCLUT229) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT230_REG_OFST       _UINT32_(0x1598)    /* (LCDC_HEOCLUT230) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT231_REG_OFST       _UINT32_(0x159C)    /* (LCDC_HEOCLUT231) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT232_REG_OFST       _UINT32_(0x15A0)    /* (LCDC_HEOCLUT232) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT233_REG_OFST       _UINT32_(0x15A4)    /* (LCDC_HEOCLUT233) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT234_REG_OFST       _UINT32_(0x15A8)    /* (LCDC_HEOCLUT234) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT235_REG_OFST       _UINT32_(0x15AC)    /* (LCDC_HEOCLUT235) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT236_REG_OFST       _UINT32_(0x15B0)    /* (LCDC_HEOCLUT236) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT237_REG_OFST       _UINT32_(0x15B4)    /* (LCDC_HEOCLUT237) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT238_REG_OFST       _UINT32_(0x15B8)    /* (LCDC_HEOCLUT238) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT239_REG_OFST       _UINT32_(0x15BC)    /* (LCDC_HEOCLUT239) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT240_REG_OFST       _UINT32_(0x15C0)    /* (LCDC_HEOCLUT240) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT241_REG_OFST       _UINT32_(0x15C4)    /* (LCDC_HEOCLUT241) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT242_REG_OFST       _UINT32_(0x15C8)    /* (LCDC_HEOCLUT242) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT243_REG_OFST       _UINT32_(0x15CC)    /* (LCDC_HEOCLUT243) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT244_REG_OFST       _UINT32_(0x15D0)    /* (LCDC_HEOCLUT244) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT245_REG_OFST       _UINT32_(0x15D4)    /* (LCDC_HEOCLUT245) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT246_REG_OFST       _UINT32_(0x15D8)    /* (LCDC_HEOCLUT246) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT247_REG_OFST       _UINT32_(0x15DC)    /* (LCDC_HEOCLUT247) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT248_REG_OFST       _UINT32_(0x15E0)    /* (LCDC_HEOCLUT248) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT249_REG_OFST       _UINT32_(0x15E4)    /* (LCDC_HEOCLUT249) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT250_REG_OFST       _UINT32_(0x15E8)    /* (LCDC_HEOCLUT250) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT251_REG_OFST       _UINT32_(0x15EC)    /* (LCDC_HEOCLUT251) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT252_REG_OFST       _UINT32_(0x15F0)    /* (LCDC_HEOCLUT252) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT253_REG_OFST       _UINT32_(0x15F4)    /* (LCDC_HEOCLUT253) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT254_REG_OFST       _UINT32_(0x15F8)    /* (LCDC_HEOCLUT254) High-End Overlay CLUT Register Offset */
#define LCDC_HEOCLUT255_REG_OFST       _UINT32_(0x15FC)    /* (LCDC_HEOCLUT255) High-End Overlay CLUT Register Offset */

