Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/test_app/firmware/src/packs/ATSAMA5D29_DFP/component/lcdc.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief LCDC register API structure */
typedef struct
{
  __IO  uint32_t                       LCDC_LCDCFG0;       /**< Offset: 0x00 (R/W  32) LCD Controller Configuration Register 0 */
  __IO  uint32_t                       LCDC_LCDCFG1;       /**< Offset: 0x04 (R/W  32) LCD Controller Configuration Register 1 */
  __IO  uint32_t                       LCDC_LCDCFG2;       /**< Offset: 0x08 (R/W  32) LCD Controller Configuration Register 2 */
  __IO  uint32_t                       LCDC_LCDCFG3;       /**< Offset: 0x0C (R/W  32) LCD Controller Configuration Register 3 */
  __IO  uint32_t                       LCDC_LCDCFG4;       /**< Offset: 0x10 (R/W  32) LCD Controller Configuration Register 4 */
  __IO  uint32_t                       LCDC_LCDCFG5;       /**< Offset: 0x14 (R/W  32) LCD Controller Configuration Register 5 */
  __IO  uint32_t                       LCDC_LCDCFG6;       /**< Offset: 0x18 (R/W  32) LCD Controller Configuration Register 6 */
  __I   uint8_t                        Reserved1[0x04];
  __O   uint32_t                       LCDC_LCDEN;         /**< Offset: 0x20 ( /W  32) LCD Controller Enable Register */
  __O   uint32_t                       LCDC_LCDDIS;        /**< Offset: 0x24 ( /W  32) LCD Controller Disable Register */
  __I   uint32_t                       LCDC_LCDSR;         /**< Offset: 0x28 (R/   32) LCD Controller Status Register */
  __O   uint32_t                       LCDC_LCDIER;        /**< Offset: 0x2C ( /W  32) LCD Controller Interrupt Enable Register */
  __O   uint32_t                       LCDC_LCDIDR;        /**< Offset: 0x30 ( /W  32) LCD Controller Interrupt Disable Register */
  __I   uint32_t                       LCDC_LCDIMR;        /**< Offset: 0x34 (R/   32) LCD Controller Interrupt Mask Register */
  __I   uint32_t                       LCDC_LCDISR;        /**< Offset: 0x38 (R/   32) LCD Controller Interrupt Status Register */
  __O   uint32_t                       LCDC_ATTR;          /**< Offset: 0x3C ( /W  32) LCD Controller Attribute Register */
  __O   uint32_t                       LCDC_BASECHER;      /**< Offset: 0x40 ( /W  32) Base Layer Channel Enable Register */
  __O   uint32_t                       LCDC_BASECHDR;      /**< Offset: 0x44 ( /W  32) Base Layer Channel Disable Register */
  __I   uint32_t                       LCDC_BASECHSR;      /**< Offset: 0x48 (R/   32) Base Layer Channel Status Register */
  __O   uint32_t                       LCDC_BASEIER;       /**< Offset: 0x4C ( /W  32) Base Layer Interrupt Enable Register */
  __O   uint32_t                       LCDC_BASEIDR;       /**< Offset: 0x50 ( /W  32) Base Layer Interrupt Disabled Register */
  __I   uint32_t                       LCDC_BASEIMR;       /**< Offset: 0x54 (R/   32) Base Layer Interrupt Mask Register */
  __I   uint32_t                       LCDC_BASEISR;       /**< Offset: 0x58 (R/   32) Base Layer Interrupt Status Register */
  __IO  uint32_t                       LCDC_BASEHEAD;      /**< Offset: 0x5C (R/W  32) Base DMA Head Register */
  __IO  uint32_t                       LCDC_BASEADDR;      /**< Offset: 0x60 (R/W  32) Base DMA Address Register */
  __IO  uint32_t                       LCDC_BASECTRL;      /**< Offset: 0x64 (R/W  32) Base DMA Control Register */
  __IO  uint32_t                       LCDC_BASENEXT;      /**< Offset: 0x68 (R/W  32) Base DMA Next Register */
  __IO  uint32_t                       LCDC_BASECFG0;      /**< Offset: 0x6C (R/W  32) Base Layer Configuration Register 0 */
  __IO  uint32_t                       LCDC_BASECFG1;      /**< Offset: 0x70 (R/W  32) Base Layer Configuration Register 1 */
  __IO  uint32_t                       LCDC_BASECFG2;      /**< Offset: 0x74 (R/W  32) Base Layer Configuration Register 2 */
  __IO  uint32_t                       LCDC_BASECFG3;      /**< Offset: 0x78 (R/W  32) Base Layer Configuration Register 3 */
  __IO  uint32_t                       LCDC_BASECFG4;      /**< Offset: 0x7C (R/W  32) Base Layer Configuration Register 4 */
  __IO  uint32_t                       LCDC_BASECFG5;      /**< Offset: 0x80 (R/W  32) Base Layer Configuration Register 5 */
  __IO  uint32_t                       LCDC_BASECFG6;      /**< Offset: 0x84 (R/W  32) Base Layer Configuration Register 6 */
  __I   uint8_t                        Reserved2[0xB8];
  __O   uint32_t                       LCDC_OVR1CHER;      /**< Offset: 0x140 ( /W  32) Overlay 1 Channel Enable Register */
  __O   uint32_t                       LCDC_OVR1CHDR;      /**< Offset: 0x144 ( /W  32) Overlay 1 Channel Disable Register */
  __I   uint32_t                       LCDC_OVR1CHSR;      /**< Offset: 0x148 (R/   32) Overlay 1 Channel Status Register */
  __O   uint32_t                       LCDC_OVR1IER;       /**< Offset: 0x14C ( /W  32) Overlay 1 Interrupt Enable Register */
  __O   uint32_t                       LCDC_OVR1IDR;       /**< Offset: 0x150 ( /W  32) Overlay 1 Interrupt Disable Register */
  __I   uint32_t                       LCDC_OVR1IMR;       /**< Offset: 0x154 (R/   32) Overlay 1 Interrupt Mask Register */
  __I   uint32_t                       LCDC_OVR1ISR;       /**< Offset: 0x158 (R/   32) Overlay 1 Interrupt Status Register */
  __IO  uint32_t                       LCDC_OVR1HEAD;      /**< Offset: 0x15C (R/W  32) Overlay 1 DMA Head Register */
  __IO  uint32_t                       LCDC_OVR1ADDR;      /**< Offset: 0x160 (R/W  32) Overlay 1 DMA Address Register */
  __IO  uint32_t                       LCDC_OVR1CTRL;      /**< Offset: 0x164 (R/W  32) Overlay 1 DMA Control Register */
  __IO  uint32_t                       LCDC_OVR1NEXT;      /**< Offset: 0x168 (R/W  32) Overlay 1 DMA Next Register */
  __IO  uint32_t                       LCDC_OVR1CFG0;      /**< Offset: 0x16C (R/W  32) Overlay 1 Configuration Register 0 */
  __IO  uint32_t                       LCDC_OVR1CFG1;      /**< Offset: 0x170 (R/W  32) Overlay 1 Configuration Register 1 */
  __IO  uint32_t                       LCDC_OVR1CFG2;      /**< Offset: 0x174 (R/W  32) Overlay 1 Configuration Register 2 */
  __IO  uint32_t                       LCDC_OVR1CFG3;      /**< Offset: 0x178 (R/W  32) Overlay 1 Configuration Register 3 */
  __IO  uint32_t                       LCDC_OVR1CFG4;      /**< Offset: 0x17C (R/W  32) Overlay 1 Configuration Register 4 */
  __IO  uint32_t                       LCDC_OVR1CFG5;      /**< Offset: 0x180 (R/W  32) Overlay 1 Configuration Register 5 */
  __IO  uint32_t                       LCDC_OVR1CFG6;      /**< Offset: 0x184 (R/W  32) Overlay 1 Configuration Register 6 */
  __IO  uint32_t                       LCDC_OVR1CFG7;      /**< Offset: 0x188 (R/W  32) Overlay 1 Configuration Register 7 */
  __IO  uint32_t                       LCDC_OVR1CFG8;      /**< Offset: 0x18C (R/W  32) Overlay 1 Configuration Register 8 */
  __IO  uint32_t                       LCDC_OVR1CFG9;      /**< Offset: 0x190 (R/W  32) Overlay 1 Configuration Register 9 */
  __I   uint8_t                        Reserved3[0xAC];
  __O   uint32_t                       LCDC_OVR2CHER;      /**< Offset: 0x240 ( /W  32) Overlay 2 Channel Enable Register */
  __O   uint32_t                       LCDC_OVR2CHDR;      /**< Offset: 0x244 ( /W  32) Overlay 2 Channel Disable Register */
  __I   uint32_t                       LCDC_OVR2CHSR;      /**< Offset: 0x248 (R/   32) Overlay 2 Channel Status Register */
  __O   uint32_t                       LCDC_OVR2IER;       /**< Offset: 0x24C ( /W  32) Overlay 2 Interrupt Enable Register */
  __O   uint32_t                       LCDC_OVR2IDR;       /**< Offset: 0x250 ( /W  32) Overlay 2 Interrupt Disable Register */
  __I   uint32_t                       LCDC_OVR2IMR;       /**< Offset: 0x254 (R/   32) Overlay 2 Interrupt Mask Register */
  __I   uint32_t                       LCDC_OVR2ISR;       /**< Offset: 0x258 (R/   32) Overlay 2 Interrupt Status Register */
  __IO  uint32_t                       LCDC_OVR2HEAD;      /**< Offset: 0x25C (R/W  32) Overlay 2 DMA Head Register */
  __IO  uint32_t                       LCDC_OVR2ADDR;      /**< Offset: 0x260 (R/W  32) Overlay 2 DMA Address Register */
  __IO  uint32_t                       LCDC_OVR2CTRL;      /**< Offset: 0x264 (R/W  32) Overlay 2 DMA Control Register */
  __IO  uint32_t                       LCDC_OVR2NEXT;      /**< Offset: 0x268 (R/W  32) Overlay 2 DMA Next Register */
  __IO  uint32_t                       LCDC_OVR2CFG0;      /**< Offset: 0x26C (R/W  32) Overlay 2 Configuration Register 0 */
  __IO  uint32_t                       LCDC_OVR2CFG1;      /**< Offset: 0x270 (R/W  32) Overlay 2 Configuration Register 1 */
  __IO  uint32_t                       LCDC_OVR2CFG2;      /**< Offset: 0x274 (R/W  32) Overlay 2 Configuration Register 2 */
  __IO  uint32_t                       LCDC_OVR2CFG3;      /**< Offset: 0x278 (R/W  32) Overlay 2 Configuration Register 3 */
  __IO  uint32_t                       LCDC_OVR2CFG4;      /**< Offset: 0x27C (R/W  32) Overlay 2 Configuration Register 4 */
  __IO  uint32_t                       LCDC_OVR2CFG5;      /**< Offset: 0x280 (R/W  32) Overlay 2 Configuration Register 5 */
  __IO  uint32_t                       LCDC_OVR2CFG6;      /**< Offset: 0x284 (R/W  32) Overlay 2 Configuration Register 6 */
  __IO  uint32_t                       LCDC_OVR2CFG7;      /**< Offset: 0x288 (R/W  32) Overlay 2 Configuration Register 7 */
  __IO  uint32_t                       LCDC_OVR2CFG8;      /**< Offset: 0x28C (R/W  32) Overlay 2 Configuration Register 8 */
  __IO  uint32_t                       LCDC_OVR2CFG9;      /**< Offset: 0x290 (R/W  32) Overlay 2 Configuration Register 9 */
  __I   uint8_t                        Reserved4[0xAC];
  __O   uint32_t                       LCDC_HEOCHER;       /**< Offset: 0x340 ( /W  32) High-End Overlay Channel Enable Register */
  __O   uint32_t                       LCDC_HEOCHDR;       /**< Offset: 0x344 ( /W  32) High-End Overlay Channel Disable Register */
  __I   uint32_t                       LCDC_HEOCHSR;       /**< Offset: 0x348 (R/   32) High-End Overlay Channel Status Register */
  __O   uint32_t                       LCDC_HEOIER;        /**< Offset: 0x34C ( /W  32) High-End Overlay Interrupt Enable Register */
  __O   uint32_t                       LCDC_HEOIDR;        /**< Offset: 0x350 ( /W  32) High-End Overlay Interrupt Disable Register */
  __I   uint32_t                       LCDC_HEOIMR;        /**< Offset: 0x354 (R/   32) High-End Overlay Interrupt Mask Register */
  __I   uint32_t                       LCDC_HEOISR;        /**< Offset: 0x358 (R/   32) High-End Overlay Interrupt Status Register */
  __IO  uint32_t                       LCDC_HEOHEAD;       /**< Offset: 0x35C (R/W  32) High-End Overlay DMA Head Register */
  __IO  uint32_t                       LCDC_HEOADDR;       /**< Offset: 0x360 (R/W  32) High-End Overlay DMA Address Register */
  __IO  uint32_t                       LCDC_HEOCTRL;       /**< Offset: 0x364 (R/W  32) High-End Overlay DMA Control Register */
  __IO  uint32_t                       LCDC_HEONEXT;       /**< Offset: 0x368 (R/W  32) High-End Overlay DMA Next Register */
  __IO  uint32_t                       LCDC_HEOUHEAD;      /**< Offset: 0x36C (R/W  32) High-End Overlay U-UV DMA Head Register */
  __IO  uint32_t                       LCDC_HEOUADDR;      /**< Offset: 0x370 (R/W  32) High-End Overlay U-UV DMA Address Register */
  __IO  uint32_t                       LCDC_HEOUCTRL;      /**< Offset: 0x374 (R/W  32) High-End Overlay U-UV DMA Control Register */
  __IO  uint32_t                       LCDC_HEOUNEXT;      /**< Offset: 0x378 (R/W  32) High-End Overlay U-UV DMA Next Register */
  __IO  uint32_t                       LCDC_HEOVHEAD;      /**< Offset: 0x37C (R/W  32) High-End Overlay V DMA Head Register */
  __IO  uint32_t                       LCDC_HEOVADDR;      /**< Offset: 0x380 (R/W  32) High-End Overlay V DMA Address Register */
  __IO  uint32_t                       LCDC_HEOVCTRL;      /**< Offset: 0x384 (R/W  32) High-End Overlay V DMA Control Register */
  __IO  uint32_t                       LCDC_HEOVNEXT;      /**< Offset: 0x388 (R/W  32) High-End Overlay V DMA Next Register */
  __IO  uint32_t                       LCDC_HEOCFG0;       /**< Offset: 0x38C (R/W  32) High-End Overlay Configuration Register 0 */
  __IO  uint32_t                       LCDC_HEOCFG1;       /**< Offset: 0x390 (R/W  32) High-End Overlay Configuration Register 1 */
  __IO  uint32_t                       LCDC_HEOCFG2;       /**< Offset: 0x394 (R/W  32) High-End Overlay Configuration Register 2 */
  __IO  uint32_t                       LCDC_HEOCFG3;       /**< Offset: 0x398 (R/W  32) High-End Overlay Configuration Register 3 */
  __IO  uint32_t                       LCDC_HEOCFG4;       /**< Offset: 0x39C (R/W  32) High-End Overlay Configuration Register 4 */
  __IO  uint32_t                       LCDC_HEOCFG5;       /**< Offset: 0x3A0 (R/W  32) High-End Overlay Configuration Register 5 */
  __IO  uint32_t                       LCDC_HEOCFG6;       /**< Offset: 0x3A4 (R/W  32) High-End Overlay Configuration Register 6 */
  __IO  uint32_t                       LCDC_HEOCFG7;       /**< Offset: 0x3A8 (R/W  32) High-End Overlay Configuration Register 7 */
  __IO  uint32_t                       LCDC_HEOCFG8;       /**< Offset: 0x3AC (R/W  32) High-End Overlay Configuration Register 8 */
  __IO  uint32_t                       LCDC_HEOCFG9;       /**< Offset: 0x3B0 (R/W  32) High-End Overlay Configuration Register 9 */
  __IO  uint32_t                       LCDC_HEOCFG10;      /**< Offset: 0x3B4 (R/W  32) High-End Overlay Configuration Register 10 */
  __IO  uint32_t                       LCDC_HEOCFG11;      /**< Offset: 0x3B8 (R/W  32) High-End Overlay Configuration Register 11 */
  __IO  uint32_t                       LCDC_HEOCFG12;      /**< Offset: 0x3BC (R/W  32) High-End Overlay Configuration Register 12 */
  __IO  uint32_t                       LCDC_HEOCFG13;      /**< Offset: 0x3C0 (R/W  32) High-End Overlay Configuration Register 13 */
  __IO  uint32_t                       LCDC_HEOCFG14;      /**< Offset: 0x3C4 (R/W  32) High-End Overlay Configuration Register 14 */
  __IO  uint32_t                       LCDC_HEOCFG15;      /**< Offset: 0x3C8 (R/W  32) High-End Overlay Configuration Register 15 */
  __IO  uint32_t                       LCDC_HEOCFG16;      /**< Offset: 0x3CC (R/W  32) High-End Overlay Configuration Register 16 */
  __IO  uint32_t                       LCDC_HEOCFG17;      /**< Offset: 0x3D0 (R/W  32) High-End Overlay Configuration Register 17 */
  __IO  uint32_t                       LCDC_HEOCFG18;      /**< Offset: 0x3D4 (R/W  32) High-End Overlay Configuration Register 18 */
  __IO  uint32_t                       LCDC_HEOCFG19;      /**< Offset: 0x3D8 (R/W  32) High-End Overlay Configuration Register 19 */
  __IO  uint32_t                       LCDC_HEOCFG20;      /**< Offset: 0x3DC (R/W  32) High-End Overlay Configuration Register 20 */
  __IO  uint32_t                       LCDC_HEOCFG21;      /**< Offset: 0x3E0 (R/W  32) High-End Overlay Configuration Register 21 */
  __IO  uint32_t                       LCDC_HEOCFG22;      /**< Offset: 0x3E4 (R/W  32) High-End Overlay Configuration Register 22 */
  __IO  uint32_t                       LCDC_HEOCFG23;      /**< Offset: 0x3E8 (R/W  32) High-End Overlay Configuration Register 23 */
  __IO  uint32_t                       LCDC_HEOCFG24;      /**< Offset: 0x3EC (R/W  32) High-End Overlay Configuration Register 24 */
  __IO  uint32_t                       LCDC_HEOCFG25;      /**< Offset: 0x3F0 (R/W  32) High-End Overlay Configuration Register 25 */
  __IO  uint32_t                       LCDC_HEOCFG26;      /**< Offset: 0x3F4 (R/W  32) High-End Overlay Configuration Register 26 */
  __IO  uint32_t                       LCDC_HEOCFG27;      /**< Offset: 0x3F8 (R/W  32) High-End Overlay Configuration Register 27 */
  __IO  uint32_t                       LCDC_HEOCFG28;      /**< Offset: 0x3FC (R/W  32) High-End Overlay Configuration Register 28 */
  __IO  uint32_t                       LCDC_HEOCFG29;      /**< Offset: 0x400 (R/W  32) High-End Overlay Configuration Register 29 */
  __IO  uint32_t                       LCDC_HEOCFG30;      /**< Offset: 0x404 (R/W  32) High-End Overlay Configuration Register 30 */
  __IO  uint32_t                       LCDC_HEOCFG31;      /**< Offset: 0x408 (R/W  32) High-End Overlay Configuration Register 31 */
  __IO  uint32_t                       LCDC_HEOCFG32;      /**< Offset: 0x40C (R/W  32) High-End Overlay Configuration Register 32 */
  __IO  uint32_t                       LCDC_HEOCFG33;      /**< Offset: 0x410 (R/W  32) High-End Overlay Configuration Register 33 */
  __IO  uint32_t                       LCDC_HEOCFG34;      /**< Offset: 0x414 (R/W  32) High-End Overlay Configuration Register 34 */
  __IO  uint32_t                       LCDC_HEOCFG35;      /**< Offset: 0x418 (R/W  32) High-End Overlay Configuration Register 35 */
  __IO  uint32_t                       LCDC_HEOCFG36;      /**< Offset: 0x41C (R/W  32) High-End Overlay Configuration Register 36 */
  __IO  uint32_t                       LCDC_HEOCFG37;      /**< Offset: 0x420 (R/W  32) High-End Overlay Configuration Register 37 */
  __IO  uint32_t                       LCDC_HEOCFG38;      /**< Offset: 0x424 (R/W  32) High-End Overlay Configuration Register 38 */
  __IO  uint32_t                       LCDC_HEOCFG39;      /**< Offset: 0x428 (R/W  32) High-End Overlay Configuration Register 39 */
  __IO  uint32_t                       LCDC_HEOCFG40;      /**< Offset: 0x42C (R/W  32) High-End Overlay Configuration Register 40 */
  __IO  uint32_t                       LCDC_HEOCFG41;      /**< Offset: 0x430 (R/W  32) High-End Overlay Configuration Register 41 */
  __I   uint8_t                        Reserved5[0x10C];
  __O   uint32_t                       LCDC_PPCHER;        /**< Offset: 0x540 ( /W  32) Post Processing Channel Enable Register */
  __O   uint32_t                       LCDC_PPCHDR;        /**< Offset: 0x544 ( /W  32) Post Processing Channel Disable Register */
  __I   uint32_t                       LCDC_PPCHSR;        /**< Offset: 0x548 (R/   32) Post Processing Channel Status Register */
  __O   uint32_t                       LCDC_PPIER;         /**< Offset: 0x54C ( /W  32) Post Processing Interrupt Enable Register */
  __O   uint32_t                       LCDC_PPIDR;         /**< Offset: 0x550 ( /W  32) Post Processing Interrupt Disable Register */
  __I   uint32_t                       LCDC_PPIMR;         /**< Offset: 0x554 (R/   32) Post Processing Interrupt Mask Register */
  __I   uint32_t                       LCDC_PPISR;         /**< Offset: 0x558 (R/   32) Post Processing Interrupt Status Register */
  __IO  uint32_t                       LCDC_PPHEAD;        /**< Offset: 0x55C (R/W  32) Post Processing Head Register */
  __IO  uint32_t                       LCDC_PPADDR;        /**< Offset: 0x560 (R/W  32) Post Processing Address Register */
  __IO  uint32_t                       LCDC_PPCTRL;        /**< Offset: 0x564 (R/W  32) Post Processing Control Register */
  __IO  uint32_t                       LCDC_PPNEXT;        /**< Offset: 0x568 (R/W  32) Post Processing Next Register */
  __IO  uint32_t                       LCDC_PPCFG0;        /**< Offset: 0x56C (R/W  32) Post Processing Configuration Register 0 */
  __IO  uint32_t                       LCDC_PPCFG1;        /**< Offset: 0x570 (R/W  32) Post Processing Configuration Register 1 */
  __IO  uint32_t                       LCDC_PPCFG2;        /**< Offset: 0x574 (R/W  32) Post Processing Configuration Register 2 */
  __IO  uint32_t                       LCDC_PPCFG3;        /**< Offset: 0x578 (R/W  32) Post Processing Configuration Register 3 */
  __IO  uint32_t                       LCDC_PPCFG4;        /**< Offset: 0x57C (R/W  32) Post Processing Configuration Register 4 */
  __IO  uint32_t                       LCDC_PPCFG5;        /**< Offset: 0x580 (R/W  32) Post Processing Configuration Register 5 */
  __I   uint8_t                        Reserved6[0x7C];
  __IO  uint32_t                       LCDC_BASECLUT[256]; /**< Offset: 0x600 (R/W  32) Base CLUT Register */
  __IO  uint32_t                       LCDC_OVR1CLUT[256]; /**< Offset: 0xA00 (R/W  32) Overlay 1 CLUT Register */
  __IO  uint32_t                       LCDC_OVR2CLUT[256]; /**< Offset: 0xE00 (R/W  32) Overlay 2 CLUT Register */
  __IO  uint32_t                       LCDC_HEOCLUT[256];  /**< Offset: 0x1200 (R/W  32) High-End Overlay CLUT Register */
} lcdc_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAMA5D_LCDC_COMPONENT_H_ */
